#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_N001

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_structs.hpp"


namespace SDK::Params
{

// Function ABP_N001.ABP_N001_C.ExecuteUbergraph_ABP_N001
// 0x0148 (0x0148 - 0x0000)
struct ABP_N001_C_ExecuteUbergraph_ABP_N001 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_3;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_4;                     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_5;                     // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_6;                     // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_7;                     // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_8;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_9;                     // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_10;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_11;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_12;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_13;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_14;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyEndToIdle_ReturnValue;  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyLoopToEnd_ReturnValue;  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyLoopToIdle_ReturnValue; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyStartToIdle_ReturnValue; // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_15;                    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTriggerEmoteBodyStartToLoop_ReturnValue; // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeginBodyEmotePhase_ReturnValue;        // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeginBodyEmotePhase_ReturnValue_1;      // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeginBodyEmotePhase_ReturnValue_2;      // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetEmoteBodyPhaseAnim_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_16;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_2;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTriggerEmoteBodyEndToIdle_ReturnValue_1; // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyLoopToEnd_ReturnValue_1; // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyLoopToIdle_ReturnValue_1; // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_17;                    // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyStartToIdle_ReturnValue_1; // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTriggerEmoteBodyStartToLoop_ReturnValue_1; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_18;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeginBodyEmotePhase_ReturnValue_3;      // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeginBodyEmotePhase_ReturnValue_4;      // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeginBodyEmotePhase_ReturnValue_5;      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_3;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_19;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_4;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_5;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_20;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEmoteBodyMotionSetting                CallFunc_GetBodyEmoteSetting_ReturnValue;          // 0x00AC(0x0010)(ConstParm, NoDestructor)
	struct FEmoteBodyMotionSetting                CallFunc_GetBodyEmoteSetting_ReturnValue_1;        // 0x00BC(0x0010)(ConstParm, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_21;                    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_22;                    // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_23;                    // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_24;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_25;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_26;                    // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_27;                    // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_28;                    // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayEmoteBody_Inner_ReturnValue;        // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_29;                    // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_30;                    // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_12;               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_31;                    // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_32;                    // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_13;               // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_33;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_LookAtParams                       CallFunc_GetLookAtParamHead_ReturnValue;           // 0x00E4(0x0018)(NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_LookAtParams                       CallFunc_GetLookAtParamSpine_ReturnValue;          // 0x0100(0x0018)(NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_34;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_14;               // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_35;                    // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_36;                    // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_15;               // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11F[0x1];                                      // 0x011F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_N001_C_ExecuteUbergraph_ABP_N001) == 0x000008, "Wrong alignment on ABP_N001_C_ExecuteUbergraph_ABP_N001");
static_assert(sizeof(ABP_N001_C_ExecuteUbergraph_ABP_N001) == 0x000148, "Wrong size on ABP_N001_C_ExecuteUbergraph_ABP_N001");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, EntryPoint) == 0x000000, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue) == 0x000004, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BreakVector_X) == 0x000008, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BreakVector_Y) == 0x00000C, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BreakVector_Z) == 0x000010, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Less_FloatFloat_ReturnValue) == 0x000015, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_1) == 0x000016, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_2) == 0x000017, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_3) == 0x000018, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_1) == 0x000019, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_4) == 0x00001A, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_5) == 0x00001B, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_2) == 0x00001C, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanOR_ReturnValue) == 0x00001D, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_6) == 0x00001E, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_7) == 0x00001F, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_8) == 0x000020, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_3) == 0x000021, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_4) == 0x000022, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanAND_ReturnValue) == 0x000023, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_9) == 0x000024, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_5) == 0x000025, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanAND_ReturnValue_1) == 0x000026, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000027, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanOR_ReturnValue_1) == 0x000028, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_10) == 0x000029, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_11) == 0x00002A, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_6) == 0x00002B, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_12) == 0x00002C, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_13) == 0x00002D, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_7) == 0x00002E, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanAND_ReturnValue_2) == 0x00002F, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000030, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_14) == 0x000034, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsTriggerEmoteBodyEndToIdle_ReturnValue) == 0x000035, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsTriggerEmoteBodyEndToIdle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanOR_ReturnValue_2) == 0x000036, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_8) == 0x000037, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsTriggerEmoteBodyLoopToEnd_ReturnValue) == 0x000038, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsTriggerEmoteBodyLoopToEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsTriggerEmoteBodyLoopToIdle_ReturnValue) == 0x000039, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsTriggerEmoteBodyLoopToIdle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsTriggerEmoteBodyStartToIdle_ReturnValue) == 0x00003A, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsTriggerEmoteBodyStartToIdle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_15) == 0x00003B, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanOR_ReturnValue_3) == 0x00003C, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000040, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsTriggerEmoteBodyStartToLoop_ReturnValue) == 0x000044, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsTriggerEmoteBodyStartToLoop_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsBeginBodyEmotePhase_ReturnValue) == 0x000045, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsBeginBodyEmotePhase_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsBeginBodyEmotePhase_ReturnValue_1) == 0x000046, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsBeginBodyEmotePhase_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsBeginBodyEmotePhase_ReturnValue_2) == 0x000047, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsBeginBodyEmotePhase_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2) == 0x000048, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x00004C, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetEmoteBodyPhaseAnim_ReturnValue) == 0x000050, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetEmoteBodyPhaseAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_16) == 0x000058, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanOR_ReturnValue_4) == 0x000059, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_1) == 0x000060, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_2) == 0x000068, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3) == 0x000070, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsTriggerEmoteBodyEndToIdle_ReturnValue_1) == 0x000074, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsTriggerEmoteBodyEndToIdle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsTriggerEmoteBodyLoopToEnd_ReturnValue_1) == 0x000075, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsTriggerEmoteBodyLoopToEnd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsTriggerEmoteBodyLoopToIdle_ReturnValue_1) == 0x000076, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsTriggerEmoteBodyLoopToIdle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_17) == 0x000077, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsTriggerEmoteBodyStartToIdle_ReturnValue_1) == 0x000078, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsTriggerEmoteBodyStartToIdle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4) == 0x00007C, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsTriggerEmoteBodyStartToLoop_ReturnValue_1) == 0x000080, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsTriggerEmoteBodyStartToLoop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_18) == 0x000081, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsBeginBodyEmotePhase_ReturnValue_3) == 0x000082, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsBeginBodyEmotePhase_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsBeginBodyEmotePhase_ReturnValue_4) == 0x000083, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsBeginBodyEmotePhase_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsBeginBodyEmotePhase_ReturnValue_5) == 0x000084, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsBeginBodyEmotePhase_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_3) == 0x000088, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_19) == 0x000090, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_4) == 0x000098, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_5) == 0x0000A0, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_20) == 0x0000A8, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetBodyEmoteSetting_ReturnValue) == 0x0000AC, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetBodyEmoteSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetBodyEmoteSetting_ReturnValue_1) == 0x0000BC, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetBodyEmoteSetting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_21) == 0x0000CC, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_9) == 0x0000CD, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_22) == 0x0000CE, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_23) == 0x0000CF, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanAND_ReturnValue_3) == 0x0000D0, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_24) == 0x0000D1, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_25) == 0x0000D2, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_26) == 0x0000D3, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_27) == 0x0000D4, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_10) == 0x0000D5, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_28) == 0x0000D6, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanAND_ReturnValue_4) == 0x0000D7, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_IsPlayEmoteBody_Inner_ReturnValue) == 0x0000D8, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_IsPlayEmoteBody_Inner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_29) == 0x0000D9, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_11) == 0x0000DA, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_30) == 0x0000DB, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_12) == 0x0000DC, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_31) == 0x0000DD, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_32) == 0x0000DE, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_32' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_13) == 0x0000DF, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_33) == 0x0000E0, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_33' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanOR_ReturnValue_5) == 0x0000E1, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetLookAtParamHead_ReturnValue) == 0x0000E4, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetLookAtParamHead_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanAND_ReturnValue_5) == 0x0000FC, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetLookAtParamSpine_ReturnValue) == 0x000100, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetLookAtParamSpine_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_34) == 0x000118, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_34' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_14) == 0x000119, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanAND_ReturnValue_6) == 0x00011A, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanOR_ReturnValue_6) == 0x00011B, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_35) == 0x00011C, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_35' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_HasTag_ReturnValue_36) == 0x00011D, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_HasTag_ReturnValue_36' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_Not_PreBool_ReturnValue_15) == 0x00011E, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_Not_PreBool_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5) == 0x000120, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000124, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_BooleanOR_ReturnValue_7) == 0x000125, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000128, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, K2Node_DynamicCast_AsGame_Character) == 0x000130, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_N001_C_ExecuteUbergraph_ABP_N001, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000140, "Member 'ABP_N001_C_ExecuteUbergraph_ABP_N001::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

// Function ABP_N001.ABP_N001_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_N001_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_N001_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_N001_C_AnimGraph");
static_assert(sizeof(ABP_N001_C_AnimGraph) == 0x000010, "Wrong size on ABP_N001_C_AnimGraph");
static_assert(offsetof(ABP_N001_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_N001_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

