#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPC_BASE_Ex_SimpleTurn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_structs.hpp"


namespace SDK::Params
{

// Function ABP_NPC_BASE_Ex_SimpleTurn.ABP_NPC_BASE_Ex_SimpleTurn_C.ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn
// 0x0200 (0x0200 - 0x0000)
struct ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_3;                     // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_4;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_5;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_6;                     // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_1; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_7;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_8;                     // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_9;                     // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_2; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_10;                    // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_11;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_12;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_3; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_3;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_13;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_14;                    // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_15;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_16;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_17;                    // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_18;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_7;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_19;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_20;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_21;                    // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_22;                    // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_23;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_24;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_25;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_8;                // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_26;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_27;                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_9;                // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_28;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_29;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_10;               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_30;                    // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_11;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_31;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_32;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_33;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_12;               // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_34;                    // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_35;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_13;               // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_14;               // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_36;                    // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_37;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_15;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_38;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_16;               // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_39;                    // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_40;                    // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_17;               // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_41;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_18;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_4; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_42;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_4;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_19;               // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_5;            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_43;                    // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_44;                    // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_20;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_21;               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_45;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTriggerEmoteBodyEndToIdle_ReturnValue;  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_46;                    // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyLoopToEnd_ReturnValue;  // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_22;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyLoopToIdle_ReturnValue; // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyStartToIdle_ReturnValue; // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_47;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyStartToLoop_ReturnValue; // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeginBodyEmotePhase_ReturnValue;        // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeginBodyEmotePhase_ReturnValue_1;      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeginBodyEmotePhase_ReturnValue_2;      // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_2; // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_6;            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_48;                    // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetEmoteBodyPhaseAnim_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_1;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_2;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_3; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTriggerEmoteBodyEndToIdle_ReturnValue_1; // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_49;                    // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyLoopToEnd_ReturnValue_1; // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_23;               // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyLoopToIdle_ReturnValue_1; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyStartToIdle_ReturnValue_1; // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_5; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_4; // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_7;            // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTriggerEmoteBodyStartToLoop_ReturnValue_1; // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeginBodyEmotePhase_ReturnValue_3;      // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeginBodyEmotePhase_ReturnValue_4;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_50;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeginBodyEmotePhase_ReturnValue_5;      // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_3;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_51;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_4;      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          CallFunc_GetEmoteBodyPhaseAnim_ReturnValue_5;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_52;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEmoteBodyMotionSetting                CallFunc_GetBodyEmoteSetting_ReturnValue;          // 0x00FC(0x0010)(ConstParm, NoDestructor)
	struct FEmoteBodyMotionSetting                CallFunc_GetBodyEmoteSetting_ReturnValue_1;        // 0x010C(0x0010)(ConstParm, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_53;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_54;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_55;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_56;                    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_24;               // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_57;                    // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_58;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_25;               // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_59;                    // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_26;               // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_60;                    // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_27;               // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayEmoteBody_Inner_ReturnValue;        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_5; // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_61;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_28;               // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_153[0x1];                                      // 0x0153(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_LookAtParams                       CallFunc_GetLookAtParamHead_ReturnValue;           // 0x0154(0x0018)(NoDestructor)
	struct FST_LookAtParams                       CallFunc_GetLookAtParamSpine_ReturnValue;          // 0x016C(0x0018)(NoDestructor)
	float                                         Temp_float_Variable_6;                             // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_8;                             // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_62;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_63;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_9;                             // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENPCAiType                                    Temp_byte_Variable;                                // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x1];                                      // 0x019B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPCBase*                               K2Node_DynamicCast_AsNPCBase;                      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENPCAiType                                    CallFunc_GetNPCAiType_ReturnValue;                 // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPCBase*                               K2Node_DynamicCast_AsNPCBase_1;                    // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_64;                    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_65;                    // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_29;               // 0x01EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_66;                    // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_30;               // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_8;            // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn) == 0x000008, "Wrong alignment on ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn");
static_assert(sizeof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn) == 0x000200, "Wrong size on ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, EntryPoint) == 0x000000, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue) == 0x000004, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_1) == 0x000005, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x000008, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Less_FloatFloat_ReturnValue) == 0x00000C, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_2) == 0x00000D, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue) == 0x00000E, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_3) == 0x00000F, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_4) == 0x000010, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_5) == 0x000011, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_1) == 0x000012, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_6) == 0x000013, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_1) == 0x000014, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000018, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_7) == 0x000019, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_2) == 0x00001A, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_8) == 0x00001C, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_3) == 0x00001D, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_9) == 0x00001E, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_2) == 0x000020, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_4) == 0x000024, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000025, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_10) == 0x000026, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_5) == 0x000027, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_11) == 0x000028, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_12) == 0x000029, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_3) == 0x00002C, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Less_FloatFloat_ReturnValue_3) == 0x000031, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Less_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_13) == 0x000032, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_14) == 0x000033, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_15) == 0x000034, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_16) == 0x000035, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_6) == 0x000036, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_17) == 0x000037, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_18) == 0x000038, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_7) == 0x000039, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_19) == 0x00003A, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_BooleanAND_ReturnValue_1) == 0x00003B, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_BooleanOR_ReturnValue_1) == 0x00003C, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_20) == 0x00003D, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_21) == 0x00003E, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_22) == 0x00003F, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_23) == 0x000040, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_24) == 0x000041, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_25) == 0x000042, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_8) == 0x000043, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_26) == 0x000044, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_27) == 0x000045, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_BooleanAND_ReturnValue_2) == 0x000046, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_9) == 0x000047, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_28) == 0x000048, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_29) == 0x000049, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_10) == 0x00004A, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_30) == 0x00004B, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_11) == 0x00004C, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_31) == 0x00004D, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_BooleanOR_ReturnValue_2) == 0x00004E, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_BooleanAND_ReturnValue_3) == 0x00004F, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_32) == 0x000050, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_32' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_33) == 0x000051, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_33' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_12) == 0x000052, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_34) == 0x000053, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_34' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_35) == 0x000054, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_35' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_13) == 0x000055, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_14) == 0x000056, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_36) == 0x000057, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_36' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_37) == 0x000058, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_37' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_15) == 0x000059, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_38) == 0x00005A, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_38' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_16) == 0x00005B, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_BooleanOR_ReturnValue_3) == 0x00005C, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_39) == 0x00005D, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_39' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_40) == 0x00005E, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_40' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_17) == 0x00005F, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_HasTag_ReturnValue_41) == 0x000060, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_HasTag_ReturnValue_41' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_Not_PreBool_ReturnValue_18) == 0x000061, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_Not_PreBool_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_4) == 0x000064, "Member 'ABP_NPC_BASE_Ex_SimpleTurn_C_ExecuteUbergraph_ABP_NPC_BASE_Ex_SimpleTurn::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue_4' has a wrong offset!");
