#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_DeC_TrainPropeller_00a

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_DeC_TrainPropeller_00a.ABP_DeC_TrainPropeller_00a_C
// 0x0230 (0x04A0 - 0x0270)
class UABP_DeC_TrainPropeller_00a_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0278(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x02F0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0318(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0390(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x03C0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x03F0(0x00B0)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABP_DeC_TrainPropeller_00a(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_DeC_TrainPropeller_00a_C">();
	}
	static class UABP_DeC_TrainPropeller_00a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_DeC_TrainPropeller_00a_C>();
	}
};
static_assert(alignof(UABP_DeC_TrainPropeller_00a_C) == 0x000010, "Wrong alignment on UABP_DeC_TrainPropeller_00a_C");
static_assert(sizeof(UABP_DeC_TrainPropeller_00a_C) == 0x0004A0, "Wrong size on UABP_DeC_TrainPropeller_00a_C");
static_assert(offsetof(UABP_DeC_TrainPropeller_00a_C, UberGraphFrame) == 0x000270, "Member 'UABP_DeC_TrainPropeller_00a_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_DeC_TrainPropeller_00a_C, AnimGraphNode_Root) == 0x000278, "Member 'UABP_DeC_TrainPropeller_00a_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_DeC_TrainPropeller_00a_C, AnimGraphNode_Slot) == 0x0002A8, "Member 'UABP_DeC_TrainPropeller_00a_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_DeC_TrainPropeller_00a_C, AnimGraphNode_TransitionResult) == 0x0002F0, "Member 'UABP_DeC_TrainPropeller_00a_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_DeC_TrainPropeller_00a_C, AnimGraphNode_SequencePlayer) == 0x000318, "Member 'UABP_DeC_TrainPropeller_00a_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_DeC_TrainPropeller_00a_C, AnimGraphNode_StateResult_1) == 0x000390, "Member 'UABP_DeC_TrainPropeller_00a_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_DeC_TrainPropeller_00a_C, AnimGraphNode_StateResult) == 0x0003C0, "Member 'UABP_DeC_TrainPropeller_00a_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_DeC_TrainPropeller_00a_C, AnimGraphNode_StateMachine) == 0x0003F0, "Member 'UABP_DeC_TrainPropeller_00a_C::AnimGraphNode_StateMachine' has a wrong offset!");

}

