#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Compass

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Compass.ABP_Compass_C
// 0x02E0 (0x0560 - 0x0280)
class UABP_Compass_C final : public UCompassAnimInstanceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0288(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x02B8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0358(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x03D0(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0448(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x04C0(0x00A0)()

public:
	void ExecuteUbergraph_ABP_Compass(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Compass_C">();
	}
	static class UABP_Compass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Compass_C>();
	}
};
static_assert(alignof(UABP_Compass_C) == 0x000010, "Wrong alignment on UABP_Compass_C");
static_assert(sizeof(UABP_Compass_C) == 0x000560, "Wrong size on UABP_Compass_C");
static_assert(offsetof(UABP_Compass_C, UberGraphFrame) == 0x000280, "Member 'UABP_Compass_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Compass_C, AnimGraphNode_Root) == 0x000288, "Member 'UABP_Compass_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Compass_C, AnimGraphNode_BlendListByBool_1) == 0x0002B8, "Member 'UABP_Compass_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_Compass_C, AnimGraphNode_SequencePlayer_2) == 0x000358, "Member 'UABP_Compass_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Compass_C, AnimGraphNode_SequencePlayer_1) == 0x0003D0, "Member 'UABP_Compass_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Compass_C, AnimGraphNode_SequencePlayer) == 0x000448, "Member 'UABP_Compass_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Compass_C, AnimGraphNode_BlendListByBool) == 0x0004C0, "Member 'UABP_Compass_C::AnimGraphNode_BlendListByBool' has a wrong offset!");

}

