#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPP_P000

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABPP_P000.ABPP_P000_C.ExecuteUbergraph_ABPP_P000
// 0x0004 (0x0004 - 0x0000)
struct ABPP_P000_C_ExecuteUbergraph_ABPP_P000 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABPP_P000_C_ExecuteUbergraph_ABPP_P000) == 0x000004, "Wrong alignment on ABPP_P000_C_ExecuteUbergraph_ABPP_P000");
static_assert(sizeof(ABPP_P000_C_ExecuteUbergraph_ABPP_P000) == 0x000004, "Wrong size on ABPP_P000_C_ExecuteUbergraph_ABPP_P000");
static_assert(offsetof(ABPP_P000_C_ExecuteUbergraph_ABPP_P000, EntryPoint) == 0x000000, "Member 'ABPP_P000_C_ExecuteUbergraph_ABPP_P000::EntryPoint' has a wrong offset!");

// Function ABPP_P000.ABPP_P000_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABPP_P000_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABPP_P000_C_AnimGraph) == 0x000008, "Wrong alignment on ABPP_P000_C_AnimGraph");
static_assert(sizeof(ABPP_P000_C_AnimGraph) == 0x000020, "Wrong size on ABPP_P000_C_AnimGraph");
static_assert(offsetof(ABPP_P000_C_AnimGraph, InPose) == 0x000000, "Member 'ABPP_P000_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABPP_P000_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABPP_P000_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

