#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Dead

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Action_Dead.Action_Dead_C
// 0x0010 (0x0140 - 0x0130)
class UAction_Dead_C : public UActionStateBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0130(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bTakenFromFront;                                   // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCanceld;                                          // 0x0139(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnExit();
	struct FRotator GetTargetRotation();
	bool IsTakenFromFront();
	void GetReaction(EDamageReactionType* ReactionType);
	void Cancel();
	void Update(float DeltaTime);
	void Exit();
	void Enter_Ground();
	void Enter_Air();
	void Enter_Abnormal();
	void Reaction(EDamageReactionType Type);
	void Enter_Water();
	void OnLand();
	void Enter_Ride();
	void Enter_Dive();
	void ExecuteUbergraph_Action_Dead(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Action_Dead_C">();
	}
	static class UAction_Dead_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAction_Dead_C>();
	}
};
static_assert(alignof(UAction_Dead_C) == 0x000008, "Wrong alignment on UAction_Dead_C");
static_assert(sizeof(UAction_Dead_C) == 0x000140, "Wrong size on UAction_Dead_C");
static_assert(offsetof(UAction_Dead_C, UberGraphFrame) == 0x000130, "Member 'UAction_Dead_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAction_Dead_C, bTakenFromFront) == 0x000138, "Member 'UAction_Dead_C::bTakenFromFront' has a wrong offset!");
static_assert(offsetof(UAction_Dead_C, bCanceld) == 0x000139, "Member 'UAction_Dead_C::bCanceld' has a wrong offset!");

}

