#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Damage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Action_Damage.Action_Damage_C
// 0x0010 (0x0140 - 0x0130)
class UAction_Damage_C final : public UActionStateBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0130(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bAbilityExecuted;                                  // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bTakenFromFront;                                   // 0x0139(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	struct FRotator GetTargetRotation();
	void IsTakenFromFront(bool* OutputPin);
	void IsKnockBackReaction(EDamageReactionType Selection, bool* Activate_0);
	void KnockBack();
	void GetReaction(EDamageReactionType* EReaction);
	void Cancel();
	void Enter();
	void Update(float DeltaTime);
	void Exit();
	void Enter_Ground();
	void Enter_Air();
	void Reset();
	void Reaction(EDamageReactionType Type);
	void Enter_Water();
	void OnLand();
	void Enter_Ride();
	void Enter_Dive();
	void ExecuteUbergraph_Action_Damage(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Action_Damage_C">();
	}
	static class UAction_Damage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAction_Damage_C>();
	}
};
static_assert(alignof(UAction_Damage_C) == 0x000008, "Wrong alignment on UAction_Damage_C");
static_assert(sizeof(UAction_Damage_C) == 0x000140, "Wrong size on UAction_Damage_C");
static_assert(offsetof(UAction_Damage_C, UberGraphFrame) == 0x000130, "Member 'UAction_Damage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAction_Damage_C, bAbilityExecuted) == 0x000138, "Member 'UAction_Damage_C::bAbilityExecuted' has a wrong offset!");
static_assert(offsetof(UAction_Damage_C, bTakenFromFront) == 0x000139, "Member 'UAction_Damage_C::bTakenFromFront' has a wrong offset!");

}

