#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Field

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Action_Field.Action_Field_C
// 0x0028 (0x0158 - 0x0130)
class UAction_Field_C final : public UActionStateBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0130(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Executed;                                          // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSuccessed;                                        // 0x0139(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Canceled;                                          // 0x013A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13B[0x5];                                      // 0x013B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldActionEventStruct                FieldActionInfo;                                   // 0x0140(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void Button_Down(bool bRelease);
	void ExecuteUbergraph_Action_Field(int32 EntryPoint);
	void Enter_Ground();
	void Enter_Air();
	void Cancel();
	void OnLand();
	void Exit();
	void Button_B(bool bRelease);
	void Button_L(bool bRelease);
	void EndInteract();
	void Button_X(bool bRelease);
	void Button_Y(bool bRelease);
	void Button_A(bool bRelease);
	void Button_Up(bool bRelease);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Action_Field_C">();
	}
	static class UAction_Field_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAction_Field_C>();
	}
};
static_assert(alignof(UAction_Field_C) == 0x000008, "Wrong alignment on UAction_Field_C");
static_assert(sizeof(UAction_Field_C) == 0x000158, "Wrong size on UAction_Field_C");
static_assert(offsetof(UAction_Field_C, UberGraphFrame) == 0x000130, "Member 'UAction_Field_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAction_Field_C, Executed) == 0x000138, "Member 'UAction_Field_C::Executed' has a wrong offset!");
static_assert(offsetof(UAction_Field_C, bSuccessed) == 0x000139, "Member 'UAction_Field_C::bSuccessed' has a wrong offset!");
static_assert(offsetof(UAction_Field_C, Canceled) == 0x00013A, "Member 'UAction_Field_C::Canceled' has a wrong offset!");
static_assert(offsetof(UAction_Field_C, FieldActionInfo) == 0x000140, "Member 'UAction_Field_C::FieldActionInfo' has a wrong offset!");

}

