#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Field

#include "Basic.hpp"

#include "DarwinGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Action_Field.Action_Field_C.Button_Down
// 0x0001 (0x0001 - 0x0000)
struct Action_Field_C_Button_Down final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Field_C_Button_Down) == 0x000001, "Wrong alignment on Action_Field_C_Button_Down");
static_assert(sizeof(Action_Field_C_Button_Down) == 0x000001, "Wrong size on Action_Field_C_Button_Down");
static_assert(offsetof(Action_Field_C_Button_Down, bRelease) == 0x000000, "Member 'Action_Field_C_Button_Down::bRelease' has a wrong offset!");

// Function Action_Field.Action_Field_C.ExecuteUbergraph_Action_Field
// 0x03F8 (0x03F8 - 0x0000)
struct Action_Field_C_ExecuteUbergraph_Action_Field final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePaused_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActivateAbilities_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_1;        // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_2;        // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFieldActionEnum>                      K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldActionEventStruct                CallFunc_GetFieldActionInfo_ReturnValue;           // 0x0070(0x0018)(NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character_1;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFieldActionEnum>                      K2Node_MakeArray_Array_1;                          // 0x00C8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FFieldActionEventStruct                CallFunc_GetFieldActionInfo_ReturnValue_1;         // 0x00D8(0x0018)(NoDestructor)
	struct FFieldActionEventStruct                CallFunc_GetFieldActionInfo_ReturnValue_2;         // 0x00F0(0x0018)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_3;        // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AArtifactObjectBase*                    K2Node_DynamicCast_AsArtifact_Object_Base;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_4;        // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_6;                           // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRelease_5;                           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          Temp_object_Variable;                              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterMovementInterfaceForABP> K2Node_DynamicCast_AsCharacter_Movement_Interface_for_ABP; // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFieldActionEnum>                      K2Node_MakeArray_Array_2;                          // 0x0190(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character_2;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_5;        // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_6;        // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_7;        // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldActionEventStruct                CallFunc_GetFieldActionInfo_ReturnValue_3;         // 0x0200(0x0018)(NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_2;             // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IObjectReactionInterface> K2Node_DynamicCast_AsObject_Reaction_Interface;    // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character_3;           // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFieldActionEventStruct                CallFunc_GetFieldActionInfo_ReturnValue_4;         // 0x0248(0x0018)(NoDestructor)
	bool                                          K2Node_Event_bRelease_4;                           // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_3;                           // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_2;                           // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          Temp_object_Variable_1;                            // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_8;        // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLinkMenuOpened_ReturnValue;             // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterMovementInterfaceForABP> K2Node_DynamicCast_AsCharacter_Movement_Interface_for_ABP_1; // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_9;        // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_10;       // 0x02B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_11;       // 0x02D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLinkMenuOpened_ReturnValue_1;           // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLinkMenuOpened_ReturnValue_2;           // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_12;       // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_13;       // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_1;                           // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_14;       // 0x0318(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLinkMenuOpened_ReturnValue_3;           // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_15;       // 0x0330(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease;                             // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character_4;           // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_24;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFieldActionEnum>                      K2Node_MakeArray_Array_3;                          // 0x0358(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_3;             // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36B[0x5];                                      // 0x036B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_16;       // 0x0370(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_25;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_17;       // 0x0388(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_26;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGPACharacter*                          CallFunc_GetLinkTarget_ReturnValue;                // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          Temp_object_Variable_2;                            // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_18;       // 0x03B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_27;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontage_ReturnValue;      // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_19;       // 0x03D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_28;                    // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E2[0x2];                                      // 0x03E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Montage_GetCurrentSection_ReturnValue;    // 0x03E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x03ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x03EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSuccessSection_ReturnValue;             // 0x03EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Field_C_ExecuteUbergraph_Action_Field) == 0x000008, "Wrong alignment on Action_Field_C_ExecuteUbergraph_Action_Field");
static_assert(sizeof(Action_Field_C_ExecuteUbergraph_Action_Field) == 0x0003F8, "Wrong size on Action_Field_C_ExecuteUbergraph_Action_Field");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, EntryPoint) == 0x000000, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_IsGamePaused_ReturnValue) == 0x000004, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_IsGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_ActivateAbilities_ReturnValue) == 0x000006, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_ActivateAbilities_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface) == 0x000008, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_1) == 0x000020, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_2) == 0x000038, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_2' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_MakeArray_Array) == 0x000050, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsPlayer_Character) == 0x000060, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsPlayer_Character' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_3) == 0x000068, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_GetFieldActionInfo_ReturnValue) == 0x000070, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_GetFieldActionInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000088, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_BreakRotator_Roll) == 0x000094, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_BreakRotator_Pitch) == 0x000098, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_BreakRotator_Yaw) == 0x00009C, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000A0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_MakeRotator_ReturnValue) == 0x0000A4, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000B0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_Array_Contains_ReturnValue) == 0x0000B1, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsPlayer_Character_1) == 0x0000B8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_4) == 0x0000C0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_MakeArray_Array_1) == 0x0000C8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_GetFieldActionInfo_ReturnValue_1) == 0x0000D8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_GetFieldActionInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_GetFieldActionInfo_ReturnValue_2) == 0x0000F0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_GetFieldActionInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000108, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_3) == 0x000110, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_3' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_5) == 0x000120, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_GetAnimInstance_ReturnValue) == 0x000128, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_Array_Contains_ReturnValue_1) == 0x000130, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsArtifact_Object_Base) == 0x000138, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsArtifact_Object_Base' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_6) == 0x000140, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_IsValid_ReturnValue) == 0x000141, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_4) == 0x000148, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_4' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_7) == 0x000158, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_Event_bRelease_6) == 0x000159, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_Event_bRelease_6' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000160, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_Event_bRelease_5) == 0x000168, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_Event_bRelease_5' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, Temp_object_Variable) == 0x000170, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Movement_Interface_for_ABP) == 0x000178, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Movement_Interface_for_ABP' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_8) == 0x000188, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_MakeArray_Array_2) == 0x000190, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsPlayer_Character_2) == 0x0001A0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsPlayer_Character_2' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_9) == 0x0001A8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_5) == 0x0001B0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_5' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_10) == 0x0001C0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_6) == 0x0001C8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_6' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_11) == 0x0001D8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_GetAnimInstance_ReturnValue_2) == 0x0001E0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_7) == 0x0001E8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_7' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_12) == 0x0001F8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_GetFieldActionInfo_ReturnValue_3) == 0x000200, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_GetFieldActionInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000218, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_Array_Contains_ReturnValue_2) == 0x000219, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_Array_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsObject_Reaction_Interface) == 0x000220, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsObject_Reaction_Interface' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_13) == 0x000230, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_IsValid_ReturnValue_1) == 0x000231, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsPlayer_Character_3) == 0x000238, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsPlayer_Character_3' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_14) == 0x000240, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_Not_PreBool_ReturnValue_1) == 0x000241, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_GetFieldActionInfo_ReturnValue_4) == 0x000248, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_GetFieldActionInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_Event_bRelease_4) == 0x000260, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_Event_bRelease_4' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000261, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_Event_bRelease_3) == 0x000262, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_Event_bRelease_3' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_Event_bRelease_2) == 0x000263, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_Event_bRelease_2' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, Temp_object_Variable_1) == 0x000268, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_8) == 0x000270, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_8' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_15) == 0x000280, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_15' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_IsLinkMenuOpened_ReturnValue) == 0x000281, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_IsLinkMenuOpened_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Movement_Interface_for_ABP_1) == 0x000288, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Movement_Interface_for_ABP_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_16) == 0x000298, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_16' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_9) == 0x0002A0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_9' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_17) == 0x0002B0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_17' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_10) == 0x0002B8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_10' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_18) == 0x0002C8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_18' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_11) == 0x0002D0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_11' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_19) == 0x0002E0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_19' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_IsLinkMenuOpened_ReturnValue_1) == 0x0002E1, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_IsLinkMenuOpened_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_IsLinkMenuOpened_ReturnValue_2) == 0x0002E2, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_IsLinkMenuOpened_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_12) == 0x0002E8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_12' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_20) == 0x0002F8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_20' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_13) == 0x000300, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_13' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_21) == 0x000310, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_21' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_Event_bRelease_1) == 0x000311, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_Event_bRelease_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_14) == 0x000318, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_14' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_22) == 0x000328, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_22' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_IsLinkMenuOpened_ReturnValue_3) == 0x000329, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_IsLinkMenuOpened_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_15) == 0x000330, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_15' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_23) == 0x000340, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_23' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_Event_bRelease) == 0x000341, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_Event_bRelease' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsPlayer_Character_4) == 0x000348, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsPlayer_Character_4' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_24) == 0x000350, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_24' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_MakeArray_Array_3) == 0x000358, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_Array_Contains_ReturnValue_3) == 0x000368, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_Array_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000369, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x00036A, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_16) == 0x000370, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_16' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_25) == 0x000380, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_25' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_17) == 0x000388, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_17' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_26) == 0x000398, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_26' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_GetLinkTarget_ReturnValue) == 0x0003A0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_GetLinkTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, Temp_object_Variable_2) == 0x0003A8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_18) == 0x0003B0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_18' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_27) == 0x0003C0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_27' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_GetCurrentActiveMontage_ReturnValue) == 0x0003C8, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_GetCurrentActiveMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_AsCharacter_Interface_19) == 0x0003D0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_AsCharacter_Interface_19' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, K2Node_DynamicCast_bSuccess_28) == 0x0003E0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::K2Node_DynamicCast_bSuccess_28' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_IsValid_ReturnValue_2) == 0x0003E1, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_Montage_GetCurrentSection_ReturnValue) == 0x0003E4, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_Montage_GetCurrentSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_IsValid_ReturnValue_3) == 0x0003EC, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_NotEqual_NameName_ReturnValue) == 0x0003ED, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x0003EE, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_IsSuccessSection_ReturnValue) == 0x0003EF, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_IsSuccessSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_BooleanAND_ReturnValue) == 0x0003F0, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_Not_PreBool_ReturnValue_2) == 0x0003F1, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Action_Field_C_ExecuteUbergraph_Action_Field, CallFunc_BooleanAND_ReturnValue_1) == 0x0003F2, "Member 'Action_Field_C_ExecuteUbergraph_Action_Field::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function Action_Field.Action_Field_C.Button_B
// 0x0001 (0x0001 - 0x0000)
struct Action_Field_C_Button_B final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Field_C_Button_B) == 0x000001, "Wrong alignment on Action_Field_C_Button_B");
static_assert(sizeof(Action_Field_C_Button_B) == 0x000001, "Wrong size on Action_Field_C_Button_B");
static_assert(offsetof(Action_Field_C_Button_B, bRelease) == 0x000000, "Member 'Action_Field_C_Button_B::bRelease' has a wrong offset!");

// Function Action_Field.Action_Field_C.Button_L
// 0x0001 (0x0001 - 0x0000)
struct Action_Field_C_Button_L final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Field_C_Button_L) == 0x000001, "Wrong alignment on Action_Field_C_Button_L");
static_assert(sizeof(Action_Field_C_Button_L) == 0x000001, "Wrong size on Action_Field_C_Button_L");
static_assert(offsetof(Action_Field_C_Button_L, bRelease) == 0x000000, "Member 'Action_Field_C_Button_L::bRelease' has a wrong offset!");

// Function Action_Field.Action_Field_C.Button_X
// 0x0001 (0x0001 - 0x0000)
struct Action_Field_C_Button_X final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Field_C_Button_X) == 0x000001, "Wrong alignment on Action_Field_C_Button_X");
static_assert(sizeof(Action_Field_C_Button_X) == 0x000001, "Wrong size on Action_Field_C_Button_X");
static_assert(offsetof(Action_Field_C_Button_X, bRelease) == 0x000000, "Member 'Action_Field_C_Button_X::bRelease' has a wrong offset!");

// Function Action_Field.Action_Field_C.Button_Y
// 0x0001 (0x0001 - 0x0000)
struct Action_Field_C_Button_Y final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Field_C_Button_Y) == 0x000001, "Wrong alignment on Action_Field_C_Button_Y");
static_assert(sizeof(Action_Field_C_Button_Y) == 0x000001, "Wrong size on Action_Field_C_Button_Y");
static_assert(offsetof(Action_Field_C_Button_Y, bRelease) == 0x000000, "Member 'Action_Field_C_Button_Y::bRelease' has a wrong offset!");

// Function Action_Field.Action_Field_C.Button_A
// 0x0001 (0x0001 - 0x0000)
struct Action_Field_C_Button_A final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Field_C_Button_A) == 0x000001, "Wrong alignment on Action_Field_C_Button_A");
static_assert(sizeof(Action_Field_C_Button_A) == 0x000001, "Wrong size on Action_Field_C_Button_A");
static_assert(offsetof(Action_Field_C_Button_A, bRelease) == 0x000000, "Member 'Action_Field_C_Button_A::bRelease' has a wrong offset!");

// Function Action_Field.Action_Field_C.Button_Up
// 0x0001 (0x0001 - 0x0000)
struct Action_Field_C_Button_Up final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Field_C_Button_Up) == 0x000001, "Wrong alignment on Action_Field_C_Button_Up");
static_assert(sizeof(Action_Field_C_Button_Up) == 0x000001, "Wrong size on Action_Field_C_Button_Up");
static_assert(offsetof(Action_Field_C_Button_Up, bRelease) == 0x000000, "Member 'Action_Field_C_Button_Up::bRelease' has a wrong offset!");

}

