#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_SlingShot

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DarwinGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Action_SlingShot.Action_SlingShot_C.IsAimAssistContinuable
// 0x0060 (0x0060 - 0x0000)
struct Action_SlingShot_C_IsAimAssistContinuable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EActionEffectType>                     K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActionDetailID_ID;                     // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetTarget_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActionEffectType                             CallFunc_GetEffectType_ReturnValue;                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTargetOfAction_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAimTargetComponent*                    K2Node_DynamicCast_AsAim_Target_Component;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_IsAimAssistContinuable) == 0x000008, "Wrong alignment on Action_SlingShot_C_IsAimAssistContinuable");
static_assert(sizeof(Action_SlingShot_C_IsAimAssistContinuable) == 0x000060, "Wrong size on Action_SlingShot_C_IsAimAssistContinuable");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, ReturnValue) == 0x000000, "Member 'Action_SlingShot_C_IsAimAssistContinuable::ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, K2Node_MakeArray_Array) == 0x000008, "Member 'Action_SlingShot_C_IsAimAssistContinuable::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, K2Node_DynamicCast_AsPlayer_Character) == 0x000018, "Member 'Action_SlingShot_C_IsAimAssistContinuable::K2Node_DynamicCast_AsPlayer_Character' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Action_SlingShot_C_IsAimAssistContinuable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, CallFunc_GetActionDetailID_ID) == 0x000024, "Member 'Action_SlingShot_C_IsAimAssistContinuable::CallFunc_GetActionDetailID_ID' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, CallFunc_GetTarget_ReturnValue) == 0x000030, "Member 'Action_SlingShot_C_IsAimAssistContinuable::CallFunc_GetTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, CallFunc_GetEffectType_ReturnValue) == 0x000038, "Member 'Action_SlingShot_C_IsAimAssistContinuable::CallFunc_GetEffectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'Action_SlingShot_C_IsAimAssistContinuable::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, CallFunc_Array_Contains_ReturnValue) == 0x000048, "Member 'Action_SlingShot_C_IsAimAssistContinuable::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, CallFunc_IsTargetOfAction_ReturnValue) == 0x000049, "Member 'Action_SlingShot_C_IsAimAssistContinuable::CallFunc_IsTargetOfAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'Action_SlingShot_C_IsAimAssistContinuable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, CallFunc_IsValid_ReturnValue) == 0x00004B, "Member 'Action_SlingShot_C_IsAimAssistContinuable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, K2Node_DynamicCast_AsAim_Target_Component) == 0x000050, "Member 'Action_SlingShot_C_IsAimAssistContinuable::K2Node_DynamicCast_AsAim_Target_Component' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_IsAimAssistContinuable, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'Action_SlingShot_C_IsAimAssistContinuable::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.GetActionDetailID
// 0x0068 (0x0068 - 0x0000)
struct Action_SlingShot_C_GetActionDetailID final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0008(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_Bullet                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0020(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_GetActionDetailID) == 0x000008, "Wrong alignment on Action_SlingShot_C_GetActionDetailID");
static_assert(sizeof(Action_SlingShot_C_GetActionDetailID) == 0x000068, "Wrong size on Action_SlingShot_C_GetActionDetailID");
static_assert(offsetof(Action_SlingShot_C_GetActionDetailID, ID) == 0x000000, "Member 'Action_SlingShot_C_GetActionDetailID::ID' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_GetActionDetailID, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000008, "Member 'Action_SlingShot_C_GetActionDetailID::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_GetActionDetailID, CallFunc_Array_Get_Item) == 0x000018, "Member 'Action_SlingShot_C_GetActionDetailID::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_GetActionDetailID, CallFunc_GetDataTableRowFromName_OutRow) == 0x000020, "Member 'Action_SlingShot_C_GetActionDetailID::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_GetActionDetailID, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000060, "Member 'Action_SlingShot_C_GetActionDetailID::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.SetActionDetailID
// 0x0070 (0x0070 - 0x0000)
struct Action_SlingShot_C_SetActionDetailID final
{
public:
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0000(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_Bullet                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_SetActionDetailID) == 0x000008, "Wrong alignment on Action_SlingShot_C_SetActionDetailID");
static_assert(sizeof(Action_SlingShot_C_SetActionDetailID) == 0x000070, "Wrong size on Action_SlingShot_C_SetActionDetailID");
static_assert(offsetof(Action_SlingShot_C_SetActionDetailID, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000000, "Member 'Action_SlingShot_C_SetActionDetailID::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_SetActionDetailID, K2Node_DynamicCast_AsPlayer_Character) == 0x000010, "Member 'Action_SlingShot_C_SetActionDetailID::K2Node_DynamicCast_AsPlayer_Character' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_SetActionDetailID, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Action_SlingShot_C_SetActionDetailID::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_SetActionDetailID, CallFunc_Array_Get_Item) == 0x00001C, "Member 'Action_SlingShot_C_SetActionDetailID::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_SetActionDetailID, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'Action_SlingShot_C_SetActionDetailID::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(Action_SlingShot_C_SetActionDetailID, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000068, "Member 'Action_SlingShot_C_SetActionDetailID::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.Move
// 0x000C (0x000C - 0x0000)
struct Action_SlingShot_C_Move final
{
public:
	struct FVector                                InputVector;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_SlingShot_C_Move) == 0x000004, "Wrong alignment on Action_SlingShot_C_Move");
static_assert(sizeof(Action_SlingShot_C_Move) == 0x00000C, "Wrong size on Action_SlingShot_C_Move");
static_assert(offsetof(Action_SlingShot_C_Move, InputVector) == 0x000000, "Member 'Action_SlingShot_C_Move::InputVector' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.ChangeViewportAndUI
// 0x0001 (0x0001 - 0x0000)
struct Action_SlingShot_C_ChangeViewportAndUI final
{
public:
	bool                                          visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_ChangeViewportAndUI) == 0x000001, "Wrong alignment on Action_SlingShot_C_ChangeViewportAndUI");
static_assert(sizeof(Action_SlingShot_C_ChangeViewportAndUI) == 0x000001, "Wrong size on Action_SlingShot_C_ChangeViewportAndUI");
static_assert(offsetof(Action_SlingShot_C_ChangeViewportAndUI, visible) == 0x000000, "Member 'Action_SlingShot_C_ChangeViewportAndUI::visible' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.Update
// 0x0004 (0x0004 - 0x0000)
struct Action_SlingShot_C_Update final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_SlingShot_C_Update) == 0x000004, "Wrong alignment on Action_SlingShot_C_Update");
static_assert(sizeof(Action_SlingShot_C_Update) == 0x000004, "Wrong size on Action_SlingShot_C_Update");
static_assert(offsetof(Action_SlingShot_C_Update, DeltaTime) == 0x000000, "Member 'Action_SlingShot_C_Update::DeltaTime' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.HoldSlingShot
// 0x0001 (0x0001 - 0x0000)
struct Action_SlingShot_C_HoldSlingShot final
{
public:
	bool                                          End;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_HoldSlingShot) == 0x000001, "Wrong alignment on Action_SlingShot_C_HoldSlingShot");
static_assert(sizeof(Action_SlingShot_C_HoldSlingShot) == 0x000001, "Wrong size on Action_SlingShot_C_HoldSlingShot");
static_assert(offsetof(Action_SlingShot_C_HoldSlingShot, End) == 0x000000, "Member 'Action_SlingShot_C_HoldSlingShot::End' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.Button_Y
// 0x0001 (0x0001 - 0x0000)
struct Action_SlingShot_C_Button_Y final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_Button_Y) == 0x000001, "Wrong alignment on Action_SlingShot_C_Button_Y");
static_assert(sizeof(Action_SlingShot_C_Button_Y) == 0x000001, "Wrong size on Action_SlingShot_C_Button_Y");
static_assert(offsetof(Action_SlingShot_C_Button_Y, bRelease) == 0x000000, "Member 'Action_SlingShot_C_Button_Y::bRelease' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.Button_A
// 0x0001 (0x0001 - 0x0000)
struct Action_SlingShot_C_Button_A final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_Button_A) == 0x000001, "Wrong alignment on Action_SlingShot_C_Button_A");
static_assert(sizeof(Action_SlingShot_C_Button_A) == 0x000001, "Wrong size on Action_SlingShot_C_Button_A");
static_assert(offsetof(Action_SlingShot_C_Button_A, bRelease) == 0x000000, "Member 'Action_SlingShot_C_Button_A::bRelease' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.Button_R
// 0x0001 (0x0001 - 0x0000)
struct Action_SlingShot_C_Button_R final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_Button_R) == 0x000001, "Wrong alignment on Action_SlingShot_C_Button_R");
static_assert(sizeof(Action_SlingShot_C_Button_R) == 0x000001, "Wrong size on Action_SlingShot_C_Button_R");
static_assert(offsetof(Action_SlingShot_C_Button_R, bRelease) == 0x000000, "Member 'Action_SlingShot_C_Button_R::bRelease' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.Button_RT
// 0x0001 (0x0001 - 0x0000)
struct Action_SlingShot_C_Button_RT final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_Button_RT) == 0x000001, "Wrong alignment on Action_SlingShot_C_Button_RT");
static_assert(sizeof(Action_SlingShot_C_Button_RT) == 0x000001, "Wrong size on Action_SlingShot_C_Button_RT");
static_assert(offsetof(Action_SlingShot_C_Button_RT, bRelease) == 0x000000, "Member 'Action_SlingShot_C_Button_RT::bRelease' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.Button_L
// 0x0001 (0x0001 - 0x0000)
struct Action_SlingShot_C_Button_L final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_Button_L) == 0x000001, "Wrong alignment on Action_SlingShot_C_Button_L");
static_assert(sizeof(Action_SlingShot_C_Button_L) == 0x000001, "Wrong size on Action_SlingShot_C_Button_L");
static_assert(offsetof(Action_SlingShot_C_Button_L, bRelease) == 0x000000, "Member 'Action_SlingShot_C_Button_L::bRelease' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.Thumb_Left
// 0x0001 (0x0001 - 0x0000)
struct Action_SlingShot_C_Thumb_Left final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_Thumb_Left) == 0x000001, "Wrong alignment on Action_SlingShot_C_Thumb_Left");
static_assert(sizeof(Action_SlingShot_C_Thumb_Left) == 0x000001, "Wrong size on Action_SlingShot_C_Thumb_Left");
static_assert(offsetof(Action_SlingShot_C_Thumb_Left, bRelease) == 0x000000, "Member 'Action_SlingShot_C_Thumb_Left::bRelease' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.Button_X
// 0x0001 (0x0001 - 0x0000)
struct Action_SlingShot_C_Button_X final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_Button_X) == 0x000001, "Wrong alignment on Action_SlingShot_C_Button_X");
static_assert(sizeof(Action_SlingShot_C_Button_X) == 0x000001, "Wrong size on Action_SlingShot_C_Button_X");
static_assert(offsetof(Action_SlingShot_C_Button_X, bRelease) == 0x000000, "Member 'Action_SlingShot_C_Button_X::bRelease' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.Button_B
// 0x0001 (0x0001 - 0x0000)
struct Action_SlingShot_C_Button_B final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_Button_B) == 0x000001, "Wrong alignment on Action_SlingShot_C_Button_B");
static_assert(sizeof(Action_SlingShot_C_Button_B) == 0x000001, "Wrong size on Action_SlingShot_C_Button_B");
static_assert(offsetof(Action_SlingShot_C_Button_B, bRelease) == 0x000000, "Member 'Action_SlingShot_C_Button_B::bRelease' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.SwordHide
// 0x0001 (0x0001 - 0x0000)
struct Action_SlingShot_C_SwordHide final
{
public:
	bool                                          IsBattleMode;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_SlingShot_C_SwordHide) == 0x000001, "Wrong alignment on Action_SlingShot_C_SwordHide");
static_assert(sizeof(Action_SlingShot_C_SwordHide) == 0x000001, "Wrong size on Action_SlingShot_C_SwordHide");
static_assert(offsetof(Action_SlingShot_C_SwordHide, IsBattleMode) == 0x000000, "Member 'Action_SlingShot_C_SwordHide::IsBattleMode' has a wrong offset!");

// Function Action_SlingShot.Action_SlingShot_C.ExecuteUbergraph_Action_SlingShot
// 0x0708 (0x0708 - 0x0000)
struct Action_SlingShot_C_ExecuteUbergraph_Action_SlingShot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpecialAbility_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameDataFlag*                          CallFunc_GetGameDataFlag_GameDataFlag;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpecialAbility_ReturnValue_1;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFlag_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameDataFlag*                          CallFunc_GetGameDataFlag_GameDataFlag_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFlag_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSpecialAbility_ReturnValue_2;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameDataFlag*                          CallFunc_GetGameDataFlag_GameDataFlag_2;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFlag_ReturnValue_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameDataFlag*                          CallFunc_GetGameDataFlag_GameDataFlag_3;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpecialAbility_ReturnValue_3;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFlag_ReturnValue_3;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_InputVector;                          // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExecuteAbility_ReturnValue;               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_1;        // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReadyToShot_ReturnValue;                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_2;        // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalcAxisValue_ReturnValue;                // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Visible;                        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_3;        // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Shot_IconReticle_C*                  CallFunc_GetSlingShotReticle_OutWidget;            // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Shot_WinStatus_C*                    CallFunc_GetSlingShotSelect_OutWidget;             // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          Temp_object_Variable_2;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_4;        // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterMovementInterfaceForABP> K2Node_DynamicCast_AsCharacter_Movement_Interface_for_ABP; // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterMovementInterfaceForABP> K2Node_DynamicCast_AsCharacter_Movement_Interface_for_ABP_1; // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterMovementInterfaceForABP> K2Node_DynamicCast_AsCharacter_Movement_Interface_for_ABP_2; // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterMovementInterfaceForABP> K2Node_DynamicCast_AsCharacter_Movement_Interface_for_ABP_3; // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_5;        // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_6;        // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentStateTag_ReturnValue;           // 0x01EC(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_End;                            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_7;        // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x6];                                      // 0x0212(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_8;        // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Shot_IconReticle_C*                  CallFunc_GetSlingShotReticle_OutWidget_1;          // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_9;        // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_10;       // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_11;       // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentStateTag_ReturnValue_1;         // 0x028C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_12;       // 0x0298(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_13;       // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentStateTag_ReturnValue_2;         // 0x02C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x02D0(0x0020)()
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_14;       // 0x02F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateBase*                             CallFunc_GetCurrentState_ReturnValue;              // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetEquipment_ReturnValue;                 // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_15;       // 0x0328(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetEquipment_ReturnValue_1;               // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_16;       // 0x0348(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_17;       // 0x0360(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_18;       // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   CallFunc_GetLinkType_self_CastInput;               // 0x0390(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELinkType                                     CallFunc_GetLinkType_ReturnValue;                  // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x03A4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_19;       // 0x03B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_20;       // 0x03D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_24;                    // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_21;       // 0x03F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_25;                    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReadyToShot_ReturnValue_1;              // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402[0x6];                                      // 0x0402(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_22;       // 0x0408(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_26;                    // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_23;       // 0x0420(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_27;                    // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameDataFlag*                          CallFunc_GetGameDataFlag_GameDataFlag_4;           // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpecialAbility_ReturnValue_4;           // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFlag_ReturnValue_4;                    // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44A[0x6];                                      // 0x044A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          Temp_object_Variable_3;                            // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_28;                    // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDarwinAnimInstance*                    K2Node_DynamicCast_AsDarwin_Anim_Instance;         // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_29;                    // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterMovementInterfaceForABP> K2Node_DynamicCast_AsCharacter_Movement_Interface_for_ABP_4; // 0x0478(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_30;                    // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character_1;           // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_31;                    // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Shot_IconReticle_C*                  CallFunc_GetSlingShotReticle_OutWidget_2;          // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Shot_IconReticle_C*                  CallFunc_GetSlingShotReticle_OutWidget_3;          // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Shot_IconReticle_C*                  CallFunc_GetSlingShotReticle_OutWidget_4;          // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character_2;           // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_32;                    // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanChangeTarget_ReturnValue;              // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C2[0x6];                                      // 0x04C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Shot_IconReticle_C*                  CallFunc_GetSlingShotReticle_OutWidget_5;          // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Shot_IconReticle_C*                  CallFunc_GetSlingShotReticle_OutWidget_6;          // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRelease_7;                           // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_6;                           // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_5;                           // 0x04DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_4;                           // 0x04DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_3;                           // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_2;                           // 0x04DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DE[0x2];                                      // 0x04DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameDataFlag*                          CallFunc_GetGameDataFlag_GameDataFlag_5;           // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpecialAbility_ReturnValue_5;           // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFlag_ReturnValue_5;                    // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EA[0x6];                                      // 0x04EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Shot_WinStatus_C*                    CallFunc_GetSlingShotSelect_OutWidget_1;           // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_1;                           // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease;                             // 0x04FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FB[0x5];                                      // 0x04FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameDataFlag*                          CallFunc_GetGameDataFlag_GameDataFlag_6;           // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0508(0x0020)()
	bool                                          CallFunc_GetFlag_ReturnValue_6;                    // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue_1;             // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52A[0x6];                                      // 0x052A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventSystemManager*                    CallFunc_GetInstance_ReturnValue;                  // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSpecialAbility_ReturnValue_6;           // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0539(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayEvent_ReturnValue;                  // 0x053A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStandable_ReturnValue;                  // 0x053B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetSelectProjectileIndex_OutProjectileIndex; // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_542[0x2];                                      // 0x0542(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectProjectileIndex_OutProjectileIndex_1; // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   CallFunc_HasTag_self_CastInput;                    // 0x0548(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0559(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A[0x2];                                      // 0x055A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalcAxisValue_ReturnValue_1;              // 0x055C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   CallFunc_SwitchToBattleMode_self_CastInput;        // 0x0560(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsBattleMode;                   // 0x0571(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_572[0x6];                                      // 0x0572(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_24;       // 0x0578(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
