#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Action_Attack

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DarwinGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Action_Attack.Action_Attack_C.Button_A
// 0x0001 (0x0001 - 0x0000)
struct Action_Attack_C_Button_A final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Action_Attack_C_Button_A) == 0x000001, "Wrong alignment on Action_Attack_C_Button_A");
static_assert(sizeof(Action_Attack_C_Button_A) == 0x000001, "Wrong size on Action_Attack_C_Button_A");
static_assert(offsetof(Action_Attack_C_Button_A, bRelease) == 0x000000, "Member 'Action_Attack_C_Button_A::bRelease' has a wrong offset!");

// Function Action_Attack.Action_Attack_C.ExecuteUbergraph_Action_Attack
// 0x0438 (0x0438 - 0x0000)
struct Action_Attack_C_ExecuteUbergraph_Action_Attack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_1;        // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAirAttackData_Found;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetMoveRotation_ReturnValue;              // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetTargetComponent_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetTargetComponent_ReturnValue_1;         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_GetTargetComponent_ReturnValue_2;         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_2;        // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_3;        // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_127[0x1];                                      // 0x0127(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_2;        // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGroundAttackData_ReturnValue;          // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_3;        // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentStateTag_ReturnValue;           // 0x016C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_4;        // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_5;        // 0x0190(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTargetBelow_ReturnValue;                // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_End_1;                          // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x01A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_6;        // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_7;        // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLinkMenuOpened_ReturnValue;             // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLinkMenuOpened_ReturnValue_1;           // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D3[0x5];                                      // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_8;        // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_9;        // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USwitchCollisionMovementComponent*      CallFunc_GetDarwinCharacterMovement_ReturnValue;   // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_10;       // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLinkMenuOpened_ReturnValue_2;           // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_11;       // 0x0230(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionableBurial_ReturnValue;           // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_End;                            // 0x0243(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_TotalDuration;                  // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_5;                           // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_4;                           // 0x024A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_3;                           // 0x024B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_12;       // 0x0250(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalculateTargetDistanceAndHeight_Result;  // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalculateTargetDistanceAndHeight_Distance; // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateTargetDistanceAndHeight_Height;  // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalculateTargetDistanceAndHeight_Direction; // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CalculateTargetDistanceAndHeight_Result_1; // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalculateTargetDistanceAndHeight_Distance_1; // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateTargetDistanceAndHeight_Height_1; // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalculateTargetDistanceAndHeight_Direction_1; // 0x029C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_13;       // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x02BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Air;                            // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x02C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_14;       // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExecuteAbility_ReturnValue;               // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_302[0x6];                                      // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_15;       // 0x0308(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExecuteAbility_ReturnValue_1;             // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31A[0x6];                                      // 0x031A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_16;       // 0x0320(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTargetInAirRange_ReturnValue;           // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332[0x6];                                      // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameDatabase*                          CallFunc_GetGameDatabase_GameDatabase;             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameDataHistory*                       CallFunc_GetHistory_ReturnValue;                   // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character_1;           // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USwitchCollisionMovementComponent*      CallFunc_GetDarwinCharacterMovement_ReturnValue_1; // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USwitchCollisionMovementComponent*      CallFunc_GetDarwinCharacterMovement_ReturnValue_2; // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USwitchCollisionMovementComponent*      CallFunc_GetDarwinCharacterMovement_ReturnValue_3; // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRelease_2;                           // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_1;                           // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_17;       // 0x0380(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_18;       // 0x0398(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease;                             // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA[0x6];                                      // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_19;       // 0x03B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_20;       // 0x03C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_21;       // 0x03E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_22;       // 0x03F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_24;                    // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLinkMenuOpened_ReturnValue_3;           // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40A[0x2];                                      // 0x040A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalcAxisValue_ReturnValue;                // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0412(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_413[0x5];                                      // 0x0413(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_23;       // 0x0418(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_25;                    // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentActionStateTag_ReturnValue;     // 0x042C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Action_Attack_C_ExecuteUbergraph_Action_Attack) == 0x000008, "Wrong alignment on Action_Attack_C_ExecuteUbergraph_Action_Attack");
static_assert(sizeof(Action_Attack_C_ExecuteUbergraph_Action_Attack) == 0x000438, "Wrong size on Action_Attack_C_ExecuteUbergraph_Action_Attack");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, EntryPoint) == 0x000000, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::EntryPoint' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, Temp_struct_Variable) == 0x000004, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000C, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_MatchesTag_ReturnValue) == 0x00000D, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface) == 0x000010, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_Event_DeltaTime) == 0x000024, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface_1) == 0x000028, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_GetAirAttackData_Found) == 0x000039, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_GetAirAttackData_Found' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_GetMoveRotation_ReturnValue) == 0x00003C, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_GetMoveRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_GetTargetComponent_ReturnValue) == 0x000058, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_GetTargetComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000064, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000068, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_FindLookAtRotation_ReturnValue) == 0x000074, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000080, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_BreakRotator_Roll) == 0x00008C, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_BreakRotator_Pitch) == 0x000090, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_BreakRotator_Yaw) == 0x000094, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000098, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_MakeRotator_ReturnValue) == 0x00009C, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_RInterpTo_ReturnValue) == 0x0000A8, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000B4, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x0000B5, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_GetTargetComponent_ReturnValue_1) == 0x0000B8, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_GetTargetComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_Not_PreBool_ReturnValue) == 0x0000C1, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000C4, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_BooleanAND_ReturnValue) == 0x0000D0, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_GetTargetComponent_ReturnValue_2) == 0x0000D8, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_GetTargetComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_IsValid_ReturnValue_2) == 0x0000E0, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0000E4, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x0000F0, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_K2_SetActorRotation_ReturnValue_2) == 0x0000FC, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_K2_SetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000100, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_BreakRotator_Roll_1) == 0x00010C, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_BreakRotator_Pitch_1) == 0x000110, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_BreakRotator_Yaw_1) == 0x000114, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_MakeRotator_ReturnValue_1) == 0x000118, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_K2_SetActorRotation_ReturnValue_3) == 0x000124, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_K2_SetActorRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_Not_PreBool_ReturnValue_1) == 0x000125, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_BooleanAND_ReturnValue_1) == 0x000126, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_GetOwner_ReturnValue) == 0x000128, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface_2) == 0x000130, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface_2' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_2) == 0x000140, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_GetGroundAttackData_ReturnValue) == 0x000141, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_GetGroundAttackData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsPlayer_Character) == 0x000148, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsPlayer_Character' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_3) == 0x000150, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface_3) == 0x000158, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface_3' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_4) == 0x000168, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_GetCurrentStateTag_ReturnValue) == 0x00016C, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_GetCurrentStateTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_Not_PreBool_ReturnValue_2) == 0x000174, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface_4) == 0x000178, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface_4' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_5) == 0x000188, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface_5) == 0x000190, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface_5' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_6) == 0x0001A0, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_IsTargetBelow_ReturnValue) == 0x0001A1, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_IsTargetBelow_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_CustomEvent_End_1) == 0x0001A2, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_CustomEvent_End_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_Not_PreBool_ReturnValue_3) == 0x0001A3, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_BooleanAND_ReturnValue_2) == 0x0001A4, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface_6) == 0x0001A8, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface_6' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_7) == 0x0001B8, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface_7) == 0x0001C0, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface_7' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_8) == 0x0001D0, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_IsLinkMenuOpened_ReturnValue) == 0x0001D1, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_IsLinkMenuOpened_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_IsLinkMenuOpened_ReturnValue_1) == 0x0001D2, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_IsLinkMenuOpened_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface_8) == 0x0001D8, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface_8' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_9) == 0x0001E8, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface_9) == 0x0001F0, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface_9' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_10) == 0x000200, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_GetDarwinCharacterMovement_ReturnValue) == 0x000208, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_GetDarwinCharacterMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_IsValid_ReturnValue_3) == 0x000210, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface_10) == 0x000218, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface_10' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_11) == 0x000228, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_IsLinkMenuOpened_ReturnValue_2) == 0x000229, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_IsLinkMenuOpened_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface_11) == 0x000230, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface_11' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_12) == 0x000240, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_IsActionableBurial_ReturnValue) == 0x000241, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_IsActionableBurial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_BooleanOR_ReturnValue) == 0x000242, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_CustomEvent_End) == 0x000243, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_CustomEvent_End' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_CustomEvent_TotalDuration) == 0x000244, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_CustomEvent_TotalDuration' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_Not_PreBool_ReturnValue_4) == 0x000248, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_Event_bRelease_5) == 0x000249, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_Event_bRelease_5' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_Event_bRelease_4) == 0x00024A, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_Event_bRelease_4' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_Event_bRelease_3) == 0x00024B, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_Event_bRelease_3' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_BooleanOR_ReturnValue_1) == 0x00024C, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface_12) == 0x000250, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface_12' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_13) == 0x000260, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_BreakVector2D_X) == 0x000264, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_BreakVector2D_Y) == 0x000268, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_CalculateTargetDistanceAndHeight_Result) == 0x00026C, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_CalculateTargetDistanceAndHeight_Result' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_CalculateTargetDistanceAndHeight_Distance) == 0x000270, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_CalculateTargetDistanceAndHeight_Distance' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_CalculateTargetDistanceAndHeight_Height) == 0x000274, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_CalculateTargetDistanceAndHeight_Height' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_CalculateTargetDistanceAndHeight_Direction) == 0x000278, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_CalculateTargetDistanceAndHeight_Direction' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000284, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_MakeVector2D_ReturnValue) == 0x000288, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_CalculateTargetDistanceAndHeight_Result_1) == 0x000290, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_CalculateTargetDistanceAndHeight_Result_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_CalculateTargetDistanceAndHeight_Distance_1) == 0x000294, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_CalculateTargetDistanceAndHeight_Distance_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_CalculateTargetDistanceAndHeight_Height_1) == 0x000298, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_CalculateTargetDistanceAndHeight_Height_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_CalculateTargetDistanceAndHeight_Direction_1) == 0x00029C, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_CalculateTargetDistanceAndHeight_Direction_1' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_AsCharacter_Interface_13) == 0x0002A8, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_AsCharacter_Interface_13' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, K2Node_DynamicCast_bSuccess_14) == 0x0002B8, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::K2Node_DynamicCast_bSuccess_14' has a wrong offset!");
static_assert(offsetof(Action_Attack_C_ExecuteUbergraph_Action_Attack, CallFunc_MakeVector2D_ReturnValue_1) == 0x0002BC, "Member 'Action_Attack_C_ExecuteUbergraph_Action_Attack::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
