#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_ApplyAttribute

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AN_ApplyAttribute.AN_ApplyAttribute_C.Received_Notify
// 0x0040 (0x0040 - 0x0000)
struct AN_ApplyAttribute_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyAttributeGameplayEffect_ReturnValue; // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_ApplyAttribute_C_Received_Notify) == 0x000008, "Wrong alignment on AN_ApplyAttribute_C_Received_Notify");
static_assert(sizeof(AN_ApplyAttribute_C_Received_Notify) == 0x000040, "Wrong size on AN_ApplyAttribute_C_Received_Notify");
static_assert(offsetof(AN_ApplyAttribute_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_ApplyAttribute_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_ApplyAttribute_C_Received_Notify, Animation) == 0x000008, "Member 'AN_ApplyAttribute_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_ApplyAttribute_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AN_ApplyAttribute_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ApplyAttribute_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AN_ApplyAttribute_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ApplyAttribute_C_Received_Notify, K2Node_DynamicCast_AsCharacter_Interface) == 0x000020, "Member 'AN_ApplyAttribute_C_Received_Notify::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(AN_ApplyAttribute_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AN_ApplyAttribute_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_ApplyAttribute_C_Received_Notify, CallFunc_DoesImplementInterface_ReturnValue) == 0x000031, "Member 'AN_ApplyAttribute_C_Received_Notify::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_ApplyAttribute_C_Received_Notify, CallFunc_ApplyAttributeGameplayEffect_ReturnValue) == 0x000034, "Member 'AN_ApplyAttribute_C_Received_Notify::CallFunc_ApplyAttributeGameplayEffect_ReturnValue' has a wrong offset!");

}

