#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_AttachWeapon

#include "Basic.hpp"


namespace SDK::Params
{

// Function AN_AttachWeapon.AN_AttachWeapon_C.Received_Notify
// 0x0058 (0x0058 - 0x0000)
struct AN_AttachWeapon_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSocketNameFromESoket_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_1;        // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsIgnore_isIgnore;                        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AN_AttachWeapon_C_Received_Notify) == 0x000008, "Wrong alignment on AN_AttachWeapon_C_Received_Notify");
static_assert(sizeof(AN_AttachWeapon_C_Received_Notify) == 0x000058, "Wrong size on AN_AttachWeapon_C_Received_Notify");
static_assert(offsetof(AN_AttachWeapon_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_AttachWeapon_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_Received_Notify, Animation) == 0x000008, "Member 'AN_AttachWeapon_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AN_AttachWeapon_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AN_AttachWeapon_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_Received_Notify, CallFunc_GetSocketNameFromESoket_ReturnValue) == 0x000020, "Member 'AN_AttachWeapon_C_Received_Notify::CallFunc_GetSocketNameFromESoket_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_Received_Notify, K2Node_DynamicCast_AsCharacter_Interface) == 0x000028, "Member 'AN_AttachWeapon_C_Received_Notify::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AN_AttachWeapon_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_Received_Notify, K2Node_DynamicCast_AsCharacter_Interface_1) == 0x000040, "Member 'AN_AttachWeapon_C_Received_Notify::K2Node_DynamicCast_AsCharacter_Interface_1' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'AN_AttachWeapon_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_Received_Notify, CallFunc_IsIgnore_isIgnore) == 0x000051, "Member 'AN_AttachWeapon_C_Received_Notify::CallFunc_IsIgnore_isIgnore' has a wrong offset!");

// Function AN_AttachWeapon.AN_AttachWeapon_C.isIgnore
// 0x0030 (0x0030 - 0x0000)
struct AN_AttachWeapon_C_isIgnore final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjectName_0;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachTo;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isIgnore_0;                                        // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayingUseSwordAction_ReturnValue;      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AN_AttachWeapon_C_isIgnore) == 0x000008, "Wrong alignment on AN_AttachWeapon_C_isIgnore");
static_assert(sizeof(AN_AttachWeapon_C_isIgnore) == 0x000030, "Wrong size on AN_AttachWeapon_C_isIgnore");
static_assert(offsetof(AN_AttachWeapon_C_isIgnore, Owner) == 0x000000, "Member 'AN_AttachWeapon_C_isIgnore::Owner' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_isIgnore, ObjectName_0) == 0x000008, "Member 'AN_AttachWeapon_C_isIgnore::ObjectName_0' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_isIgnore, AttachTo) == 0x000010, "Member 'AN_AttachWeapon_C_isIgnore::AttachTo' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_isIgnore, isIgnore_0) == 0x000018, "Member 'AN_AttachWeapon_C_isIgnore::isIgnore_0' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_isIgnore, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000019, "Member 'AN_AttachWeapon_C_isIgnore::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_isIgnore, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x00001A, "Member 'AN_AttachWeapon_C_isIgnore::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_isIgnore, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x00001B, "Member 'AN_AttachWeapon_C_isIgnore::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_isIgnore, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'AN_AttachWeapon_C_isIgnore::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_isIgnore, K2Node_DynamicCast_AsPlayer_Character) == 0x000020, "Member 'AN_AttachWeapon_C_isIgnore::K2Node_DynamicCast_AsPlayer_Character' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_isIgnore, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AN_AttachWeapon_C_isIgnore::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_isIgnore, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'AN_AttachWeapon_C_isIgnore::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_AttachWeapon_C_isIgnore, CallFunc_IsPlayingUseSwordAction_ReturnValue) == 0x00002A, "Member 'AN_AttachWeapon_C_isIgnore::CallFunc_IsPlayingUseSwordAction_ReturnValue' has a wrong offset!");

}

