#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_GrabWeapon

#include "Basic.hpp"


namespace SDK::Params
{

// Function AN_GrabWeapon.AN_GrabWeapon_C.Received_Notify
// 0x0058 (0x0058 - 0x0000)
struct AN_GrabWeapon_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASlingShot*                             K2Node_DynamicCast_AsSling_Shot;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetEquipment_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_GrabWeapon_C_Received_Notify) == 0x000008, "Wrong alignment on AN_GrabWeapon_C_Received_Notify");
static_assert(sizeof(AN_GrabWeapon_C_Received_Notify) == 0x000058, "Wrong size on AN_GrabWeapon_C_Received_Notify");
static_assert(offsetof(AN_GrabWeapon_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_GrabWeapon_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_GrabWeapon_C_Received_Notify, Animation) == 0x000008, "Member 'AN_GrabWeapon_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_GrabWeapon_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AN_GrabWeapon_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_GrabWeapon_C_Received_Notify, Temp_object_Variable) == 0x000018, "Member 'AN_GrabWeapon_C_Received_Notify::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AN_GrabWeapon_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'AN_GrabWeapon_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_GrabWeapon_C_Received_Notify, K2Node_DynamicCast_AsCharacter_Interface) == 0x000028, "Member 'AN_GrabWeapon_C_Received_Notify::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(AN_GrabWeapon_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AN_GrabWeapon_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_GrabWeapon_C_Received_Notify, K2Node_DynamicCast_AsSling_Shot) == 0x000040, "Member 'AN_GrabWeapon_C_Received_Notify::K2Node_DynamicCast_AsSling_Shot' has a wrong offset!");
static_assert(offsetof(AN_GrabWeapon_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'AN_GrabWeapon_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AN_GrabWeapon_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'AN_GrabWeapon_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_GrabWeapon_C_Received_Notify, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'AN_GrabWeapon_C_Received_Notify::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_GrabWeapon_C_Received_Notify, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00004C, "Member 'AN_GrabWeapon_C_Received_Notify::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_GrabWeapon_C_Received_Notify, CallFunc_GetEquipment_ReturnValue) == 0x000050, "Member 'AN_GrabWeapon_C_Received_Notify::CallFunc_GetEquipment_ReturnValue' has a wrong offset!");

}

