#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_Release

#include "Basic.hpp"

#include "DarwinGame_structs.hpp"


namespace SDK::Params
{

// Function AN_Release.AN_Release_C.Received_Notify
// 0x0080 (0x0080 - 0x0000)
struct AN_Release_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFieldManager*                          CallFunc_GetInstance_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFieldActionEventStruct                CallFunc_GetFieldActionInfo_ReturnValue;           // 0x0040(0x0018)(NoDestructor)
	class UFieldObjectManager*                    CallFunc_GetFieldObjectManager_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IObjectUtilInterface>  K2Node_DynamicCast_AsObject_Util_Interface;        // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetObjectID_ReturnValue;                  // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AN_Release_C_Received_Notify) == 0x000008, "Wrong alignment on AN_Release_C_Received_Notify");
static_assert(sizeof(AN_Release_C_Received_Notify) == 0x000080, "Wrong size on AN_Release_C_Received_Notify");
static_assert(offsetof(AN_Release_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_Release_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_Release_C_Received_Notify, Animation) == 0x000008, "Member 'AN_Release_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_Release_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AN_Release_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Release_C_Received_Notify, Temp_name_Variable) == 0x000014, "Member 'AN_Release_C_Received_Notify::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(AN_Release_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'AN_Release_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Release_C_Received_Notify, K2Node_DynamicCast_AsPlayer_Character) == 0x000028, "Member 'AN_Release_C_Received_Notify::K2Node_DynamicCast_AsPlayer_Character' has a wrong offset!");
static_assert(offsetof(AN_Release_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AN_Release_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_Release_C_Received_Notify, CallFunc_GetInstance_ReturnValue) == 0x000038, "Member 'AN_Release_C_Received_Notify::CallFunc_GetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Release_C_Received_Notify, CallFunc_GetFieldActionInfo_ReturnValue) == 0x000040, "Member 'AN_Release_C_Received_Notify::CallFunc_GetFieldActionInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Release_C_Received_Notify, CallFunc_GetFieldObjectManager_ReturnValue) == 0x000058, "Member 'AN_Release_C_Received_Notify::CallFunc_GetFieldObjectManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_Release_C_Received_Notify, K2Node_DynamicCast_AsObject_Util_Interface) == 0x000060, "Member 'AN_Release_C_Received_Notify::K2Node_DynamicCast_AsObject_Util_Interface' has a wrong offset!");
static_assert(offsetof(AN_Release_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'AN_Release_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AN_Release_C_Received_Notify, CallFunc_GetObjectID_ReturnValue) == 0x000074, "Member 'AN_Release_C_Received_Notify::CallFunc_GetObjectID_ReturnValue' has a wrong offset!");

}

