#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_SpawnSplash

#include "Basic.hpp"


namespace SDK::Params
{

// Function AN_SpawnSplash.AN_SpawnSplash_C.Received_Notify
// 0x0048 (0x0048 - 0x0000)
struct AN_SpawnSplash_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGPACharacter*                          K2Node_DynamicCast_AsGPACharacter;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateBase*                             CallFunc_GetCurrentState_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWaterStateSwim*                        K2Node_DynamicCast_AsWater_State_Swim;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AN_SpawnSplash_C_Received_Notify) == 0x000008, "Wrong alignment on AN_SpawnSplash_C_Received_Notify");
static_assert(sizeof(AN_SpawnSplash_C_Received_Notify) == 0x000048, "Wrong size on AN_SpawnSplash_C_Received_Notify");
static_assert(offsetof(AN_SpawnSplash_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_SpawnSplash_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_SpawnSplash_C_Received_Notify, Animation) == 0x000008, "Member 'AN_SpawnSplash_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AN_SpawnSplash_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AN_SpawnSplash_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SpawnSplash_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AN_SpawnSplash_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SpawnSplash_C_Received_Notify, K2Node_DynamicCast_AsGPACharacter) == 0x000020, "Member 'AN_SpawnSplash_C_Received_Notify::K2Node_DynamicCast_AsGPACharacter' has a wrong offset!");
static_assert(offsetof(AN_SpawnSplash_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AN_SpawnSplash_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AN_SpawnSplash_C_Received_Notify, CallFunc_GetCurrentState_ReturnValue) == 0x000030, "Member 'AN_SpawnSplash_C_Received_Notify::CallFunc_GetCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SpawnSplash_C_Received_Notify, K2Node_DynamicCast_AsWater_State_Swim) == 0x000038, "Member 'AN_SpawnSplash_C_Received_Notify::K2Node_DynamicCast_AsWater_State_Swim' has a wrong offset!");
static_assert(offsetof(AN_SpawnSplash_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'AN_SpawnSplash_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

