#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AS_ComboInputTime

#include "Basic.hpp"


namespace SDK::Params
{

// Function AS_ComboInputTime.AS_ComboInputTime_C.OnComboInputBegin
// 0x0048 (0x0048 - 0x0000)
struct AS_ComboInputTime_C_OnComboInputBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGPACharacter*                          K2Node_DynamicCast_AsGPACharacter;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActionStateBase*                       CallFunc_GetCurrentActionState_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAction_Attack_C*                       K2Node_DynamicCast_AsAction_Attack;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AS_ComboInputTime_C_OnComboInputBegin) == 0x000008, "Wrong alignment on AS_ComboInputTime_C_OnComboInputBegin");
static_assert(sizeof(AS_ComboInputTime_C_OnComboInputBegin) == 0x000048, "Wrong size on AS_ComboInputTime_C_OnComboInputBegin");
static_assert(offsetof(AS_ComboInputTime_C_OnComboInputBegin, MeshComp) == 0x000000, "Member 'AS_ComboInputTime_C_OnComboInputBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_OnComboInputBegin, Animation) == 0x000008, "Member 'AS_ComboInputTime_C_OnComboInputBegin::Animation' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_OnComboInputBegin, TotalDuration) == 0x000010, "Member 'AS_ComboInputTime_C_OnComboInputBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_OnComboInputBegin, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AS_ComboInputTime_C_OnComboInputBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_OnComboInputBegin, K2Node_DynamicCast_AsGPACharacter) == 0x000020, "Member 'AS_ComboInputTime_C_OnComboInputBegin::K2Node_DynamicCast_AsGPACharacter' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_OnComboInputBegin, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AS_ComboInputTime_C_OnComboInputBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_OnComboInputBegin, CallFunc_GetCurrentActionState_ReturnValue) == 0x000030, "Member 'AS_ComboInputTime_C_OnComboInputBegin::CallFunc_GetCurrentActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_OnComboInputBegin, K2Node_DynamicCast_AsAction_Attack) == 0x000038, "Member 'AS_ComboInputTime_C_OnComboInputBegin::K2Node_DynamicCast_AsAction_Attack' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_OnComboInputBegin, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'AS_ComboInputTime_C_OnComboInputBegin::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function AS_ComboInputTime.AS_ComboInputTime_C.Received_NotifyEnd
// 0x0048 (0x0048 - 0x0000)
struct AS_ComboInputTime_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGPACharacter*                          K2Node_DynamicCast_AsGPACharacter;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActionStateBase*                       CallFunc_GetCurrentActionState_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAction_Attack_C*                       K2Node_DynamicCast_AsAction_Attack;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AS_ComboInputTime_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on AS_ComboInputTime_C_Received_NotifyEnd");
static_assert(sizeof(AS_ComboInputTime_C_Received_NotifyEnd) == 0x000048, "Wrong size on AS_ComboInputTime_C_Received_NotifyEnd");
static_assert(offsetof(AS_ComboInputTime_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'AS_ComboInputTime_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'AS_ComboInputTime_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_Received_NotifyEnd, ReturnValue) == 0x000010, "Member 'AS_ComboInputTime_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_Received_NotifyEnd, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AS_ComboInputTime_C_Received_NotifyEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_Received_NotifyEnd, K2Node_DynamicCast_AsGPACharacter) == 0x000020, "Member 'AS_ComboInputTime_C_Received_NotifyEnd::K2Node_DynamicCast_AsGPACharacter' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_Received_NotifyEnd, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AS_ComboInputTime_C_Received_NotifyEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_Received_NotifyEnd, CallFunc_GetCurrentActionState_ReturnValue) == 0x000030, "Member 'AS_ComboInputTime_C_Received_NotifyEnd::CallFunc_GetCurrentActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_Received_NotifyEnd, K2Node_DynamicCast_AsAction_Attack) == 0x000038, "Member 'AS_ComboInputTime_C_Received_NotifyEnd::K2Node_DynamicCast_AsAction_Attack' has a wrong offset!");
static_assert(offsetof(AS_ComboInputTime_C_Received_NotifyEnd, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'AS_ComboInputTime_C_Received_NotifyEnd::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

