#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AS_Guarantee_FlyingMode

#include "Basic.hpp"


namespace SDK::Params
{

// Function AS_Guarantee_FlyingMode.AS_Guarantee_FlyingMode_C.Received_NotifyBegin
// 0x0048 (0x0048 - 0x0000)
struct AS_Guarantee_FlyingMode_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGPACharacter*                          K2Node_DynamicCast_AsGPACharacter;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AS_Guarantee_FlyingMode_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on AS_Guarantee_FlyingMode_C_Received_NotifyBegin");
static_assert(sizeof(AS_Guarantee_FlyingMode_C_Received_NotifyBegin) == 0x000048, "Wrong size on AS_Guarantee_FlyingMode_C_Received_NotifyBegin");
static_assert(offsetof(AS_Guarantee_FlyingMode_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'AS_Guarantee_FlyingMode_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(AS_Guarantee_FlyingMode_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'AS_Guarantee_FlyingMode_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(AS_Guarantee_FlyingMode_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'AS_Guarantee_FlyingMode_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(AS_Guarantee_FlyingMode_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'AS_Guarantee_FlyingMode_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_Guarantee_FlyingMode_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AS_Guarantee_FlyingMode_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_Guarantee_FlyingMode_C_Received_NotifyBegin, K2Node_DynamicCast_AsGPACharacter) == 0x000020, "Member 'AS_Guarantee_FlyingMode_C_Received_NotifyBegin::K2Node_DynamicCast_AsGPACharacter' has a wrong offset!");
static_assert(offsetof(AS_Guarantee_FlyingMode_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AS_Guarantee_FlyingMode_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AS_Guarantee_FlyingMode_C_Received_NotifyBegin, K2Node_DynamicCast_AsCharacter_Interface) == 0x000030, "Member 'AS_Guarantee_FlyingMode_C_Received_NotifyBegin::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(AS_Guarantee_FlyingMode_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'AS_Guarantee_FlyingMode_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

