#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AS_ZoomUp

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AS_ZoomUp.AS_ZoomUp_C.Received_NotifyTick
// 0x0178 (0x0178 - 0x0000)
struct AS_ZoomUp_C_Received_NotifyTick final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameDeltaTime;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADarwinCamera*                          Camera;                                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      PlayerController;                                  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ControlRotation;                                   // 0x0030(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADarwinCamera*                          K2Node_DynamicCast_AsDarwin_Camera;                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AS_ZoomUp_C_Received_NotifyTick) == 0x000008, "Wrong alignment on AS_ZoomUp_C_Received_NotifyTick");
static_assert(sizeof(AS_ZoomUp_C_Received_NotifyTick) == 0x000178, "Wrong size on AS_ZoomUp_C_Received_NotifyTick");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, MeshComp) == 0x000000, "Member 'AS_ZoomUp_C_Received_NotifyTick::MeshComp' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, Animation) == 0x000008, "Member 'AS_ZoomUp_C_Received_NotifyTick::Animation' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, FrameDeltaTime) == 0x000010, "Member 'AS_ZoomUp_C_Received_NotifyTick::FrameDeltaTime' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, ReturnValue) == 0x000014, "Member 'AS_ZoomUp_C_Received_NotifyTick::ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, Owner) == 0x000018, "Member 'AS_ZoomUp_C_Received_NotifyTick::Owner' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, Camera) == 0x000020, "Member 'AS_ZoomUp_C_Received_NotifyTick::Camera' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, PlayerController) == 0x000028, "Member 'AS_ZoomUp_C_Received_NotifyTick::PlayerController' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, ControlRotation) == 0x000030, "Member 'AS_ZoomUp_C_Received_NotifyTick::ControlRotation' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00003C, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_BreakRotator_Roll) == 0x000048, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_BreakRotator_Pitch) == 0x00004C, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_BreakRotator_Yaw) == 0x000050, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000054, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_MakeRotator_ReturnValue) == 0x000060, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_MakeRotator_ReturnValue_1) == 0x00006C, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_GetUpVector_ReturnValue) == 0x000078, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_GetRightVector_ReturnValue) == 0x000084, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_MakeRotator_ReturnValue_2) == 0x000090, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_GetForwardVector_ReturnValue) == 0x00009C, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A8, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_RotateAngleAxis_ReturnValue) == 0x0000B4, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_NegateVector_ReturnValue) == 0x0000C0, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_NegateVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000CC, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D8, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_GetPlayerController_ReturnValue) == 0x0000E8, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000F0, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_IsValid_ReturnValue) == 0x0000FC, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_BreakRotator_Roll_1) == 0x000100, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_BreakRotator_Pitch_1) == 0x000104, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_BreakRotator_Yaw_1) == 0x000108, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_GetViewTarget_ReturnValue) == 0x000110, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_GetOwner_ReturnValue) == 0x000118, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, K2Node_DynamicCast_AsDarwin_Camera) == 0x000120, "Member 'AS_ZoomUp_C_Received_NotifyTick::K2Node_DynamicCast_AsDarwin_Camera' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'AS_ZoomUp_C_Received_NotifyTick::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_IsValid_ReturnValue_1) == 0x000129, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x00012C, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000138, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000144, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x000150, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_BreakRotator_Roll_2) == 0x00015C, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_BreakRotator_Pitch_2) == 0x000160, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_BreakRotator_Yaw_2) == 0x000164, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyTick, CallFunc_MakeRotator_ReturnValue_3) == 0x000168, "Member 'AS_ZoomUp_C_Received_NotifyTick::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");

// Function AS_ZoomUp.AS_ZoomUp_C.GetNotifyName
// 0x0010 (0x0010 - 0x0000)
struct AS_ZoomUp_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(AS_ZoomUp_C_GetNotifyName) == 0x000008, "Wrong alignment on AS_ZoomUp_C_GetNotifyName");
static_assert(sizeof(AS_ZoomUp_C_GetNotifyName) == 0x000010, "Wrong size on AS_ZoomUp_C_GetNotifyName");
static_assert(offsetof(AS_ZoomUp_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'AS_ZoomUp_C_GetNotifyName::ReturnValue' has a wrong offset!");

// Function AS_ZoomUp.AS_ZoomUp_C.Received_NotifyEnd
// 0x0050 (0x0050 - 0x0000)
struct AS_ZoomUp_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADarwinCamera*                          K2Node_DynamicCast_AsDarwin_Camera;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AS_ZoomUp_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on AS_ZoomUp_C_Received_NotifyEnd");
static_assert(sizeof(AS_ZoomUp_C_Received_NotifyEnd) == 0x000050, "Wrong size on AS_ZoomUp_C_Received_NotifyEnd");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'AS_ZoomUp_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'AS_ZoomUp_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyEnd, ReturnValue) == 0x000010, "Member 'AS_ZoomUp_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyEnd, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AS_ZoomUp_C_Received_NotifyEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyEnd, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AS_ZoomUp_C_Received_NotifyEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyEnd, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'AS_ZoomUp_C_Received_NotifyEnd::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyEnd, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'AS_ZoomUp_C_Received_NotifyEnd::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyEnd, CallFunc_GetViewTarget_ReturnValue) == 0x000038, "Member 'AS_ZoomUp_C_Received_NotifyEnd::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyEnd, K2Node_DynamicCast_AsDarwin_Camera) == 0x000040, "Member 'AS_ZoomUp_C_Received_NotifyEnd::K2Node_DynamicCast_AsDarwin_Camera' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyEnd, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AS_ZoomUp_C_Received_NotifyEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AS_ZoomUp.AS_ZoomUp_C.Received_NotifyBegin
// 0x0050 (0x0050 - 0x0000)
struct AS_ZoomUp_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADarwinCamera*                          K2Node_DynamicCast_AsDarwin_Camera;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AS_ZoomUp_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on AS_ZoomUp_C_Received_NotifyBegin");
static_assert(sizeof(AS_ZoomUp_C_Received_NotifyBegin) == 0x000050, "Wrong size on AS_ZoomUp_C_Received_NotifyBegin");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'AS_ZoomUp_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'AS_ZoomUp_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'AS_ZoomUp_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'AS_ZoomUp_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AS_ZoomUp_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AS_ZoomUp_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyBegin, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'AS_ZoomUp_C_Received_NotifyBegin::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'AS_ZoomUp_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyBegin, CallFunc_GetViewTarget_ReturnValue) == 0x000038, "Member 'AS_ZoomUp_C_Received_NotifyBegin::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyBegin, K2Node_DynamicCast_AsDarwin_Camera) == 0x000040, "Member 'AS_ZoomUp_C_Received_NotifyBegin::K2Node_DynamicCast_AsDarwin_Camera' has a wrong offset!");
static_assert(offsetof(AS_ZoomUp_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AS_ZoomUp_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AS_ZoomUp.AS_ZoomUp_C.GetDestAngle
// 0x0004 (0x0004 - 0x0000)
struct AS_ZoomUp_C_GetDestAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AS_ZoomUp_C_GetDestAngle) == 0x000004, "Wrong alignment on AS_ZoomUp_C_GetDestAngle");
static_assert(sizeof(AS_ZoomUp_C_GetDestAngle) == 0x000004, "Wrong size on AS_ZoomUp_C_GetDestAngle");
static_assert(offsetof(AS_ZoomUp_C_GetDestAngle, ReturnValue) == 0x000000, "Member 'AS_ZoomUp_C_GetDestAngle::ReturnValue' has a wrong offset!");

// Function AS_ZoomUp.AS_ZoomUp_C.GetDestLength
// 0x0004 (0x0004 - 0x0000)
struct AS_ZoomUp_C_GetDestLength final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AS_ZoomUp_C_GetDestLength) == 0x000004, "Wrong alignment on AS_ZoomUp_C_GetDestLength");
static_assert(sizeof(AS_ZoomUp_C_GetDestLength) == 0x000004, "Wrong size on AS_ZoomUp_C_GetDestLength");
static_assert(offsetof(AS_ZoomUp_C_GetDestLength, ReturnValue) == 0x000000, "Member 'AS_ZoomUp_C_GetDestLength::ReturnValue' has a wrong offset!");

// Function AS_ZoomUp.AS_ZoomUp_C.GetDestYaw
// 0x0004 (0x0004 - 0x0000)
struct AS_ZoomUp_C_GetDestYaw final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AS_ZoomUp_C_GetDestYaw) == 0x000004, "Wrong alignment on AS_ZoomUp_C_GetDestYaw");
static_assert(sizeof(AS_ZoomUp_C_GetDestYaw) == 0x000004, "Wrong size on AS_ZoomUp_C_GetDestYaw");
static_assert(offsetof(AS_ZoomUp_C_GetDestYaw, ReturnValue) == 0x000000, "Member 'AS_ZoomUp_C_GetDestYaw::ReturnValue' has a wrong offset!");

}

