#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_InputFunction

#include "Basic.hpp"

#include "DarwinGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BI_InputFunction.BI_InputFunction_C.AnalogStick_LX
// 0x0004 (0x0004 - 0x0000)
struct BI_InputFunction_C_AnalogStick_LX final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_AnalogStick_LX) == 0x000004, "Wrong alignment on BI_InputFunction_C_AnalogStick_LX");
static_assert(sizeof(BI_InputFunction_C_AnalogStick_LX) == 0x000004, "Wrong size on BI_InputFunction_C_AnalogStick_LX");
static_assert(offsetof(BI_InputFunction_C_AnalogStick_LX, AxisValue) == 0x000000, "Member 'BI_InputFunction_C_AnalogStick_LX::AxisValue' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.AnalogStick_LY
// 0x0004 (0x0004 - 0x0000)
struct BI_InputFunction_C_AnalogStick_LY final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_AnalogStick_LY) == 0x000004, "Wrong alignment on BI_InputFunction_C_AnalogStick_LY");
static_assert(sizeof(BI_InputFunction_C_AnalogStick_LY) == 0x000004, "Wrong size on BI_InputFunction_C_AnalogStick_LY");
static_assert(offsetof(BI_InputFunction_C_AnalogStick_LY, AxisValue) == 0x000000, "Member 'BI_InputFunction_C_AnalogStick_LY::AxisValue' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Button_A
// 0x0008 (0x0008 - 0x0000)
struct BI_InputFunction_C_Button_A final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputType                                    InputType;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_Button_A) == 0x000004, "Wrong alignment on BI_InputFunction_C_Button_A");
static_assert(sizeof(BI_InputFunction_C_Button_A) == 0x000008, "Wrong size on BI_InputFunction_C_Button_A");
static_assert(offsetof(BI_InputFunction_C_Button_A, AxisValue) == 0x000000, "Member 'BI_InputFunction_C_Button_A::AxisValue' has a wrong offset!");
static_assert(offsetof(BI_InputFunction_C_Button_A, InputType) == 0x000004, "Member 'BI_InputFunction_C_Button_A::InputType' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Button_B
// 0x0008 (0x0008 - 0x0000)
struct BI_InputFunction_C_Button_B final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputType                                    InputType;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_Button_B) == 0x000004, "Wrong alignment on BI_InputFunction_C_Button_B");
static_assert(sizeof(BI_InputFunction_C_Button_B) == 0x000008, "Wrong size on BI_InputFunction_C_Button_B");
static_assert(offsetof(BI_InputFunction_C_Button_B, AxisValue) == 0x000000, "Member 'BI_InputFunction_C_Button_B::AxisValue' has a wrong offset!");
static_assert(offsetof(BI_InputFunction_C_Button_B, InputType) == 0x000004, "Member 'BI_InputFunction_C_Button_B::InputType' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Button_X
// 0x0008 (0x0008 - 0x0000)
struct BI_InputFunction_C_Button_X final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputType                                    InputType;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_Button_X) == 0x000004, "Wrong alignment on BI_InputFunction_C_Button_X");
static_assert(sizeof(BI_InputFunction_C_Button_X) == 0x000008, "Wrong size on BI_InputFunction_C_Button_X");
static_assert(offsetof(BI_InputFunction_C_Button_X, AxisValue) == 0x000000, "Member 'BI_InputFunction_C_Button_X::AxisValue' has a wrong offset!");
static_assert(offsetof(BI_InputFunction_C_Button_X, InputType) == 0x000004, "Member 'BI_InputFunction_C_Button_X::InputType' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Button_Y
// 0x0008 (0x0008 - 0x0000)
struct BI_InputFunction_C_Button_Y final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputType                                    InputType;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_Button_Y) == 0x000004, "Wrong alignment on BI_InputFunction_C_Button_Y");
static_assert(sizeof(BI_InputFunction_C_Button_Y) == 0x000008, "Wrong size on BI_InputFunction_C_Button_Y");
static_assert(offsetof(BI_InputFunction_C_Button_Y, AxisValue) == 0x000000, "Member 'BI_InputFunction_C_Button_Y::AxisValue' has a wrong offset!");
static_assert(offsetof(BI_InputFunction_C_Button_Y, InputType) == 0x000004, "Member 'BI_InputFunction_C_Button_Y::InputType' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Left
// 0x0001 (0x0001 - 0x0000)
struct BI_InputFunction_C_Left final
{
public:
	EInputType                                    InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_Left) == 0x000001, "Wrong alignment on BI_InputFunction_C_Left");
static_assert(sizeof(BI_InputFunction_C_Left) == 0x000001, "Wrong size on BI_InputFunction_C_Left");
static_assert(offsetof(BI_InputFunction_C_Left, InputType) == 0x000000, "Member 'BI_InputFunction_C_Left::InputType' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Up
// 0x0001 (0x0001 - 0x0000)
struct BI_InputFunction_C_Up final
{
public:
	EInputType                                    InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_Up) == 0x000001, "Wrong alignment on BI_InputFunction_C_Up");
static_assert(sizeof(BI_InputFunction_C_Up) == 0x000001, "Wrong size on BI_InputFunction_C_Up");
static_assert(offsetof(BI_InputFunction_C_Up, InputType) == 0x000000, "Member 'BI_InputFunction_C_Up::InputType' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Right
// 0x0001 (0x0001 - 0x0000)
struct BI_InputFunction_C_Right final
{
public:
	EInputType                                    InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_Right) == 0x000001, "Wrong alignment on BI_InputFunction_C_Right");
static_assert(sizeof(BI_InputFunction_C_Right) == 0x000001, "Wrong size on BI_InputFunction_C_Right");
static_assert(offsetof(BI_InputFunction_C_Right, InputType) == 0x000000, "Member 'BI_InputFunction_C_Right::InputType' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Down
// 0x0001 (0x0001 - 0x0000)
struct BI_InputFunction_C_Down final
{
public:
	EInputType                                    InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_Down) == 0x000001, "Wrong alignment on BI_InputFunction_C_Down");
static_assert(sizeof(BI_InputFunction_C_Down) == 0x000001, "Wrong size on BI_InputFunction_C_Down");
static_assert(offsetof(BI_InputFunction_C_Down, InputType) == 0x000000, "Member 'BI_InputFunction_C_Down::InputType' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.AnalogStick_RX
// 0x0004 (0x0004 - 0x0000)
struct BI_InputFunction_C_AnalogStick_RX final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_AnalogStick_RX) == 0x000004, "Wrong alignment on BI_InputFunction_C_AnalogStick_RX");
static_assert(sizeof(BI_InputFunction_C_AnalogStick_RX) == 0x000004, "Wrong size on BI_InputFunction_C_AnalogStick_RX");
static_assert(offsetof(BI_InputFunction_C_AnalogStick_RX, AxisValue) == 0x000000, "Member 'BI_InputFunction_C_AnalogStick_RX::AxisValue' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.AnalogStick_RY
// 0x0004 (0x0004 - 0x0000)
struct BI_InputFunction_C_AnalogStick_RY final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_AnalogStick_RY) == 0x000004, "Wrong alignment on BI_InputFunction_C_AnalogStick_RY");
static_assert(sizeof(BI_InputFunction_C_AnalogStick_RY) == 0x000004, "Wrong size on BI_InputFunction_C_AnalogStick_RY");
static_assert(offsetof(BI_InputFunction_C_AnalogStick_RY, AxisValue) == 0x000000, "Member 'BI_InputFunction_C_AnalogStick_RY::AxisValue' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Shoulder_L
// 0x0001 (0x0001 - 0x0000)
struct BI_InputFunction_C_Shoulder_L final
{
public:
	EInputType                                    InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_Shoulder_L) == 0x000001, "Wrong alignment on BI_InputFunction_C_Shoulder_L");
static_assert(sizeof(BI_InputFunction_C_Shoulder_L) == 0x000001, "Wrong size on BI_InputFunction_C_Shoulder_L");
static_assert(offsetof(BI_InputFunction_C_Shoulder_L, InputType) == 0x000000, "Member 'BI_InputFunction_C_Shoulder_L::InputType' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Shoulder_R
// 0x0001 (0x0001 - 0x0000)
struct BI_InputFunction_C_Shoulder_R final
{
public:
	EInputType                                    InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_Shoulder_R) == 0x000001, "Wrong alignment on BI_InputFunction_C_Shoulder_R");
static_assert(sizeof(BI_InputFunction_C_Shoulder_R) == 0x000001, "Wrong size on BI_InputFunction_C_Shoulder_R");
static_assert(offsetof(BI_InputFunction_C_Shoulder_R, InputType) == 0x000000, "Member 'BI_InputFunction_C_Shoulder_R::InputType' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Trigger_L
// 0x0008 (0x0008 - 0x0000)
struct BI_InputFunction_C_Trigger_L final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputType                                    InputType;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_Trigger_L) == 0x000004, "Wrong alignment on BI_InputFunction_C_Trigger_L");
static_assert(sizeof(BI_InputFunction_C_Trigger_L) == 0x000008, "Wrong size on BI_InputFunction_C_Trigger_L");
static_assert(offsetof(BI_InputFunction_C_Trigger_L, AxisValue) == 0x000000, "Member 'BI_InputFunction_C_Trigger_L::AxisValue' has a wrong offset!");
static_assert(offsetof(BI_InputFunction_C_Trigger_L, InputType) == 0x000004, "Member 'BI_InputFunction_C_Trigger_L::InputType' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Trigger_R
// 0x0008 (0x0008 - 0x0000)
struct BI_InputFunction_C_Trigger_R final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputType                                    InputType;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_Trigger_R) == 0x000004, "Wrong alignment on BI_InputFunction_C_Trigger_R");
static_assert(sizeof(BI_InputFunction_C_Trigger_R) == 0x000008, "Wrong size on BI_InputFunction_C_Trigger_R");
static_assert(offsetof(BI_InputFunction_C_Trigger_R, AxisValue) == 0x000000, "Member 'BI_InputFunction_C_Trigger_R::AxisValue' has a wrong offset!");
static_assert(offsetof(BI_InputFunction_C_Trigger_R, InputType) == 0x000004, "Member 'BI_InputFunction_C_Trigger_R::InputType' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Locking
// 0x0001 (0x0001 - 0x0000)
struct BI_InputFunction_C_Locking final
{
public:
	bool                                          Release;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BI_InputFunction_C_Locking) == 0x000001, "Wrong alignment on BI_InputFunction_C_Locking");
static_assert(sizeof(BI_InputFunction_C_Locking) == 0x000001, "Wrong size on BI_InputFunction_C_Locking");
static_assert(offsetof(BI_InputFunction_C_Locking, Release) == 0x000000, "Member 'BI_InputFunction_C_Locking::Release' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Crouching
// 0x0001 (0x0001 - 0x0000)
struct BI_InputFunction_C_Crouching final
{
public:
	bool                                          Release;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BI_InputFunction_C_Crouching) == 0x000001, "Wrong alignment on BI_InputFunction_C_Crouching");
static_assert(sizeof(BI_InputFunction_C_Crouching) == 0x000001, "Wrong size on BI_InputFunction_C_Crouching");
static_assert(offsetof(BI_InputFunction_C_Crouching, Release) == 0x000000, "Member 'BI_InputFunction_C_Crouching::Release' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.Move
// 0x000C (0x000C - 0x0000)
struct BI_InputFunction_C_Move final
{
public:
	struct FVector                                MovementInput;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_InputFunction_C_Move) == 0x000004, "Wrong alignment on BI_InputFunction_C_Move");
static_assert(sizeof(BI_InputFunction_C_Move) == 0x00000C, "Wrong size on BI_InputFunction_C_Move");
static_assert(offsetof(BI_InputFunction_C_Move, MovementInput) == 0x000000, "Member 'BI_InputFunction_C_Move::MovementInput' has a wrong offset!");

// Function BI_InputFunction.BI_InputFunction_C.TakeAction
// 0x000C (0x000C - 0x0000)
struct BI_InputFunction_C_TakeAction final
{
public:
	struct FGameplayTag                           ActionTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          Release;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BI_InputFunction_C_TakeAction) == 0x000004, "Wrong alignment on BI_InputFunction_C_TakeAction");
static_assert(sizeof(BI_InputFunction_C_TakeAction) == 0x00000C, "Wrong size on BI_InputFunction_C_TakeAction");
static_assert(offsetof(BI_InputFunction_C_TakeAction, ActionTag) == 0x000000, "Member 'BI_InputFunction_C_TakeAction::ActionTag' has a wrong offset!");
static_assert(offsetof(BI_InputFunction_C_TakeAction, Release) == 0x000008, "Member 'BI_InputFunction_C_TakeAction::Release' has a wrong offset!");

}

