#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Air_FieldLink

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Air_FieldLink.BP_Air_FieldLink_C.Button_LT
// 0x0001 (0x0001 - 0x0000)
struct BP_Air_FieldLink_C_Button_LT final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Air_FieldLink_C_Button_LT) == 0x000001, "Wrong alignment on BP_Air_FieldLink_C_Button_LT");
static_assert(sizeof(BP_Air_FieldLink_C_Button_LT) == 0x000001, "Wrong size on BP_Air_FieldLink_C_Button_LT");
static_assert(offsetof(BP_Air_FieldLink_C_Button_LT, bRelease) == 0x000000, "Member 'BP_Air_FieldLink_C_Button_LT::bRelease' has a wrong offset!");

// Function BP_Air_FieldLink.BP_Air_FieldLink_C.Button_RT
// 0x0001 (0x0001 - 0x0000)
struct BP_Air_FieldLink_C_Button_RT final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Air_FieldLink_C_Button_RT) == 0x000001, "Wrong alignment on BP_Air_FieldLink_C_Button_RT");
static_assert(sizeof(BP_Air_FieldLink_C_Button_RT) == 0x000001, "Wrong size on BP_Air_FieldLink_C_Button_RT");
static_assert(offsetof(BP_Air_FieldLink_C_Button_RT, bRelease) == 0x000000, "Member 'BP_Air_FieldLink_C_Button_RT::bRelease' has a wrong offset!");

// Function BP_Air_FieldLink.BP_Air_FieldLink_C.ExecuteUbergraph_BP_Air_FieldLink
// 0x0008 (0x0008 - 0x0000)
struct BP_Air_FieldLink_C_ExecuteUbergraph_BP_Air_FieldLink final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bRelease;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease_1;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Air_FieldLink_C_ExecuteUbergraph_BP_Air_FieldLink) == 0x000004, "Wrong alignment on BP_Air_FieldLink_C_ExecuteUbergraph_BP_Air_FieldLink");
static_assert(sizeof(BP_Air_FieldLink_C_ExecuteUbergraph_BP_Air_FieldLink) == 0x000008, "Wrong size on BP_Air_FieldLink_C_ExecuteUbergraph_BP_Air_FieldLink");
static_assert(offsetof(BP_Air_FieldLink_C_ExecuteUbergraph_BP_Air_FieldLink, EntryPoint) == 0x000000, "Member 'BP_Air_FieldLink_C_ExecuteUbergraph_BP_Air_FieldLink::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Air_FieldLink_C_ExecuteUbergraph_BP_Air_FieldLink, K2Node_Event_bRelease) == 0x000004, "Member 'BP_Air_FieldLink_C_ExecuteUbergraph_BP_Air_FieldLink::K2Node_Event_bRelease' has a wrong offset!");
static_assert(offsetof(BP_Air_FieldLink_C_ExecuteUbergraph_BP_Air_FieldLink, K2Node_Event_bRelease_1) == 0x000005, "Member 'BP_Air_FieldLink_C_ExecuteUbergraph_BP_Air_FieldLink::K2Node_Event_bRelease_1' has a wrong offset!");

}

