#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ActionPoint.BP_ActionPoint_C
// 0x0018 (0x0268 - 0x0250)
class ABP_ActionPoint_C final : public AActionPoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UChildActorComponent*                   ChildActor;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ActionPoint(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ActionPoint_C">();
	}
	static class ABP_ActionPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ActionPoint_C>();
	}
};
static_assert(alignof(ABP_ActionPoint_C) == 0x000008, "Wrong alignment on ABP_ActionPoint_C");
static_assert(sizeof(ABP_ActionPoint_C) == 0x000268, "Wrong size on ABP_ActionPoint_C");
static_assert(offsetof(ABP_ActionPoint_C, UberGraphFrame) == 0x000250, "Member 'ABP_ActionPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ActionPoint_C, ChildActor) == 0x000258, "Member 'ABP_ActionPoint_C::ChildActor' has a wrong offset!");
static_assert(offsetof(ABP_ActionPoint_C, Sphere) == 0x000260, "Member 'ABP_ActionPoint_C::Sphere' has a wrong offset!");

}

