#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Air_LookAtJump

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Air_LookAtJump.BP_Air_LookAtJump_C.ExecuteUbergraph_BP_Air_LookAtJump
// 0x0004 (0x0004 - 0x0000)
struct BP_Air_LookAtJump_C_ExecuteUbergraph_BP_Air_LookAtJump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Air_LookAtJump_C_ExecuteUbergraph_BP_Air_LookAtJump) == 0x000004, "Wrong alignment on BP_Air_LookAtJump_C_ExecuteUbergraph_BP_Air_LookAtJump");
static_assert(sizeof(BP_Air_LookAtJump_C_ExecuteUbergraph_BP_Air_LookAtJump) == 0x000004, "Wrong size on BP_Air_LookAtJump_C_ExecuteUbergraph_BP_Air_LookAtJump");
static_assert(offsetof(BP_Air_LookAtJump_C_ExecuteUbergraph_BP_Air_LookAtJump, EntryPoint) == 0x000000, "Member 'BP_Air_LookAtJump_C_ExecuteUbergraph_BP_Air_LookAtJump::EntryPoint' has a wrong offset!");

// Function BP_Air_LookAtJump.BP_Air_LookAtJump_C.CalculateJumpVelocity
// 0x0048 (0x0048 - 0x0000)
struct BP_Air_LookAtJump_C_CalculateJumpVelocity final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMonster*                               CallFunc_GetMonster_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorOnBlackboard_ReturnValue;        // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatOnBlackboard_ReturnValue;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVectorOnBlackboard_ReturnValue_1;      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BlueprintSuggestProjectileVelocity_TossVelocity; // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BlueprintSuggestProjectileVelocity_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Air_LookAtJump_C_CalculateJumpVelocity) == 0x000008, "Wrong alignment on BP_Air_LookAtJump_C_CalculateJumpVelocity");
static_assert(sizeof(BP_Air_LookAtJump_C_CalculateJumpVelocity) == 0x000048, "Wrong size on BP_Air_LookAtJump_C_CalculateJumpVelocity");
static_assert(offsetof(BP_Air_LookAtJump_C_CalculateJumpVelocity, ReturnValue) == 0x000000, "Member 'BP_Air_LookAtJump_C_CalculateJumpVelocity::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Air_LookAtJump_C_CalculateJumpVelocity, CallFunc_GetMonster_ReturnValue) == 0x000010, "Member 'BP_Air_LookAtJump_C_CalculateJumpVelocity::CallFunc_GetMonster_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Air_LookAtJump_C_CalculateJumpVelocity, CallFunc_GetVectorOnBlackboard_ReturnValue) == 0x000018, "Member 'BP_Air_LookAtJump_C_CalculateJumpVelocity::CallFunc_GetVectorOnBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Air_LookAtJump_C_CalculateJumpVelocity, CallFunc_GetFloatOnBlackboard_ReturnValue) == 0x000024, "Member 'BP_Air_LookAtJump_C_CalculateJumpVelocity::CallFunc_GetFloatOnBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Air_LookAtJump_C_CalculateJumpVelocity, CallFunc_GetVectorOnBlackboard_ReturnValue_1) == 0x000028, "Member 'BP_Air_LookAtJump_C_CalculateJumpVelocity::CallFunc_GetVectorOnBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Air_LookAtJump_C_CalculateJumpVelocity, CallFunc_BlueprintSuggestProjectileVelocity_TossVelocity) == 0x000034, "Member 'BP_Air_LookAtJump_C_CalculateJumpVelocity::CallFunc_BlueprintSuggestProjectileVelocity_TossVelocity' has a wrong offset!");
static_assert(offsetof(BP_Air_LookAtJump_C_CalculateJumpVelocity, CallFunc_BlueprintSuggestProjectileVelocity_ReturnValue) == 0x000040, "Member 'BP_Air_LookAtJump_C_CalculateJumpVelocity::CallFunc_BlueprintSuggestProjectileVelocity_ReturnValue' has a wrong offset!");

}

