#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActionPoint

#include "Basic.hpp"

#include "DarwinGame_structs.hpp"


namespace SDK::Params
{

// Function BP_ActionPoint.BP_ActionPoint_C.ExecuteUbergraph_BP_ActionPoint
// 0x0020 (0x0020 - 0x0000)
struct BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetGameFlag_ReturnValue;                  // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActionPointType                              CallFunc_GetType_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActionPointExamine*                    K2Node_DynamicCast_AsAction_Point_Examine;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint) == 0x000008, "Wrong alignment on BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint");
static_assert(sizeof(BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint) == 0x000020, "Wrong size on BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint");
static_assert(offsetof(BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint, EntryPoint) == 0x000000, "Member 'BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint, CallFunc_GetGameFlag_ReturnValue) == 0x000004, "Member 'BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint::CallFunc_GetGameFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint, CallFunc_GetType_ReturnValue) == 0x00000C, "Member 'BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint, K2Node_DynamicCast_AsAction_Point_Examine) == 0x000010, "Member 'BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint::K2Node_DynamicCast_AsAction_Point_Examine' has a wrong offset!");
static_assert(offsetof(BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_ActionPoint_C_ExecuteUbergraph_BP_ActionPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

