#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AppGameInstance

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AppGameInstance.BP_AppGameInstance_C.ExecuteUbergraph_BP_AppGameInstance
// 0x00A8 (0x00A8 - 0x0000)
struct BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)(ConstParm)
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddToPlayerScreen_ReturnValue;            // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerControllerFromID_ReturnValue;    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Temp_name_Variable;                                // 0x0088(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	class UAsyncActionLoadPrimaryAsset*           CallFunc_AsyncLoadPrimaryAsset_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance) == 0x000008, "Wrong alignment on BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance");
static_assert(sizeof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance) == 0x0000A8, "Wrong size on BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, EntryPoint) == 0x000000, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, Temp_object_Variable) == 0x000020, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, Temp_bool_Variable) == 0x000028, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, Temp_text_Variable) == 0x000030, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, Temp_text_Variable_1) == 0x000048, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, K2Node_Select_Default) == 0x000060, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, CallFunc_IsInViewport_ReturnValue) == 0x000079, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::CallFunc_IsInViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, CallFunc_AddToPlayerScreen_ReturnValue) == 0x00007A, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::CallFunc_AddToPlayerScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, CallFunc_IsValid_ReturnValue_2) == 0x00007B, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, CallFunc_GetPlayerControllerFromID_ReturnValue) == 0x000080, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::CallFunc_GetPlayerControllerFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, Temp_name_Variable) == 0x000088, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, CallFunc_AsyncLoadPrimaryAsset_ReturnValue) == 0x000098, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::CallFunc_AsyncLoadPrimaryAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance, CallFunc_IsValid_ReturnValue_3) == 0x0000A0, "Member 'BP_AppGameInstance_C_ExecuteUbergraph_BP_AppGameInstance::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function BP_AppGameInstance.BP_AppGameInstance_C.Completed_8A770A6246DC85F2B04097B67AF7FE39
// 0x0008 (0x0008 - 0x0000)
struct BP_AppGameInstance_C_Completed_8A770A6246DC85F2B04097B67AF7FE39 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AppGameInstance_C_Completed_8A770A6246DC85F2B04097B67AF7FE39) == 0x000008, "Wrong alignment on BP_AppGameInstance_C_Completed_8A770A6246DC85F2B04097B67AF7FE39");
static_assert(sizeof(BP_AppGameInstance_C_Completed_8A770A6246DC85F2B04097B67AF7FE39) == 0x000008, "Wrong size on BP_AppGameInstance_C_Completed_8A770A6246DC85F2B04097B67AF7FE39");
static_assert(offsetof(BP_AppGameInstance_C_Completed_8A770A6246DC85F2B04097B67AF7FE39, Loaded) == 0x000000, "Member 'BP_AppGameInstance_C_Completed_8A770A6246DC85F2B04097B67AF7FE39::Loaded' has a wrong offset!");

// Function BP_AppGameInstance.BP_AppGameInstance_C.CreateDebugWidget
// 0x0010 (0x0010 - 0x0000)
struct BP_AppGameInstance_C_CreateDebugWidget final
{
public:
	class UW_DebugMenu_C*                         CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AppGameInstance_C_CreateDebugWidget) == 0x000008, "Wrong alignment on BP_AppGameInstance_C_CreateDebugWidget");
static_assert(sizeof(BP_AppGameInstance_C_CreateDebugWidget) == 0x000010, "Wrong size on BP_AppGameInstance_C_CreateDebugWidget");
static_assert(offsetof(BP_AppGameInstance_C_CreateDebugWidget, CallFunc_Create_ReturnValue) == 0x000000, "Member 'BP_AppGameInstance_C_CreateDebugWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AppGameInstance_C_CreateDebugWidget, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_AppGameInstance_C_CreateDebugWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_AppGameInstance.BP_AppGameInstance_C.KeepLoadObject
// 0x0008 (0x0008 - 0x0000)
struct BP_AppGameInstance_C_KeepLoadObject final
{
public:
	class UObject*                                NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AppGameInstance_C_KeepLoadObject) == 0x000008, "Wrong alignment on BP_AppGameInstance_C_KeepLoadObject");
static_assert(sizeof(BP_AppGameInstance_C_KeepLoadObject) == 0x000008, "Wrong size on BP_AppGameInstance_C_KeepLoadObject");
static_assert(offsetof(BP_AppGameInstance_C_KeepLoadObject, NewParam) == 0x000000, "Member 'BP_AppGameInstance_C_KeepLoadObject::NewParam' has a wrong offset!");

}

