#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Air_Fall

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Air_Fall.BP_Air_Fall_C.Button_Y
// 0x0001 (0x0001 - 0x0000)
struct BP_Air_Fall_C_Button_Y final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Air_Fall_C_Button_Y) == 0x000001, "Wrong alignment on BP_Air_Fall_C_Button_Y");
static_assert(sizeof(BP_Air_Fall_C_Button_Y) == 0x000001, "Wrong size on BP_Air_Fall_C_Button_Y");
static_assert(offsetof(BP_Air_Fall_C_Button_Y, bRelease) == 0x000000, "Member 'BP_Air_Fall_C_Button_Y::bRelease' has a wrong offset!");

// Function BP_Air_Fall.BP_Air_Fall_C.Update
// 0x0004 (0x0004 - 0x0000)
struct BP_Air_Fall_C_Update final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Air_Fall_C_Update) == 0x000004, "Wrong alignment on BP_Air_Fall_C_Update");
static_assert(sizeof(BP_Air_Fall_C_Update) == 0x000004, "Wrong size on BP_Air_Fall_C_Update");
static_assert(offsetof(BP_Air_Fall_C_Update, DeltaTime) == 0x000000, "Member 'BP_Air_Fall_C_Update::DeltaTime' has a wrong offset!");

// Function BP_Air_Fall.BP_Air_Fall_C.ExecuteUbergraph_BP_Air_Fall
// 0x0130 (0x0130 - 0x0000)
struct BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterStateInterfaceForABP> K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease;                             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_1;        // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_2;        // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLinkMenuOpened_ReturnValue;             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          Temp_object_Variable_1;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USwitchCollisionMovementComponent*      CallFunc_GetDarwinCharacterMovement_ReturnValue;   // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterStateInterfaceForABP> K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP_1; // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USwitchCollisionMovementComponent*      CallFunc_GetDarwinCharacterMovement_ReturnValue_1; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_3;        // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall) == 0x000008, "Wrong alignment on BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall");
static_assert(sizeof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall) == 0x000130, "Wrong size on BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, EntryPoint) == 0x000000, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, Temp_object_Variable) == 0x000008, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_DynamicCast_AsCharacter_Interface) == 0x000010, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP) == 0x000028, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_GetAnimInstance_ReturnValue) == 0x000040, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_Event_bRelease) == 0x000049, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_Event_bRelease' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_DynamicCast_AsCharacter_Interface_1) == 0x000050, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_DynamicCast_AsCharacter_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_DynamicCast_AsCharacter_Interface_2) == 0x000068, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_DynamicCast_AsCharacter_Interface_2' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_DynamicCast_bSuccess_3) == 0x000078, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_IsLinkMenuOpened_ReturnValue) == 0x000079, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_IsLinkMenuOpened_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, Temp_object_Variable_1) == 0x000080, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_GetVelocity_ReturnValue) == 0x000088, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_GetDarwinCharacterMovement_ReturnValue) == 0x000098, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_GetDarwinCharacterMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_BreakVector_X) == 0x0000A0, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_BreakVector_Y) == 0x0000A4, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_BreakVector_Z) == 0x0000A8, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000AC, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000B8, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP_1) == 0x0000C0, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP_1' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_DynamicCast_bSuccess_4) == 0x0000D0, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_IsValid_ReturnValue_1) == 0x0000D1, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_Event_DeltaTime) == 0x0000D4, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_GetVelocity_ReturnValue_1) == 0x0000D8, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_GetDarwinCharacterMovement_ReturnValue_1) == 0x0000E8, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_GetDarwinCharacterMovement_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_BreakVector_X_1) == 0x0000F0, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_BreakVector_Y_1) == 0x0000F4, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_BreakVector_Z_1) == 0x0000F8, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000FC, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000108, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_DynamicCast_AsCharacter_Interface_3) == 0x000110, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_DynamicCast_AsCharacter_Interface_3' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, K2Node_DynamicCast_bSuccess_5) == 0x000120, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000128, "Member 'BP_Air_Fall_C_ExecuteUbergraph_BP_Air_Fall::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");

}

