#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AttackCollisionBox

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AttackCollisionBox.BP_AttackCollisionBox_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_AttackCollisionBox_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AttackCollisionBox_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_AttackCollisionBox_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_AttackCollisionBox_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_AttackCollisionBox_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_AttackCollisionBox_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_AttackCollisionBox_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function BP_AttackCollisionBox.BP_AttackCollisionBox_C.ExecuteUbergraph_BP_AttackCollisionBox
// 0x0010 (0x0010 - 0x0000)
struct BP_AttackCollisionBox_C_ExecuteUbergraph_BP_AttackCollisionBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AttackCollisionBox_C_ExecuteUbergraph_BP_AttackCollisionBox) == 0x000008, "Wrong alignment on BP_AttackCollisionBox_C_ExecuteUbergraph_BP_AttackCollisionBox");
static_assert(sizeof(BP_AttackCollisionBox_C_ExecuteUbergraph_BP_AttackCollisionBox) == 0x000010, "Wrong size on BP_AttackCollisionBox_C_ExecuteUbergraph_BP_AttackCollisionBox");
static_assert(offsetof(BP_AttackCollisionBox_C_ExecuteUbergraph_BP_AttackCollisionBox, EntryPoint) == 0x000000, "Member 'BP_AttackCollisionBox_C_ExecuteUbergraph_BP_AttackCollisionBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AttackCollisionBox_C_ExecuteUbergraph_BP_AttackCollisionBox, K2Node_Event_OtherActor) == 0x000008, "Member 'BP_AttackCollisionBox_C_ExecuteUbergraph_BP_AttackCollisionBox::K2Node_Event_OtherActor' has a wrong offset!");

}

