#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bookshelf_00

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Bookshelf_00.BP_Bookshelf_00_C
// 0x0190 (0x0440 - 0x02B0)
class ABP_Bookshelf_00_C final : public AFieldObjectBase
{
public:
	class UStaticMeshComponent*                   SM_HuC_Book_01a11;                                 // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_01a10;                                 // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_01a9;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_01a8;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_01a7;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_01a6;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_01a5;                                  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_01a4;                                  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_01a3;                                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_01a2;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_01a1;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_01a;                                   // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a35;                                 // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a34;                                 // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a33;                                 // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a32;                                 // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a31;                                 // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a30;                                 // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a29;                                 // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a28;                                 // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a27;                                 // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a26;                                 // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a25;                                 // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Bookshelf_00a;                              // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a23;                                 // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a22;                                 // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a21;                                 // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a20;                                 // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a19;                                 // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a18;                                 // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a17;                                 // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a16;                                 // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a15;                                 // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a14;                                 // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a13;                                 // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a12;                                 // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a11;                                 // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a10;                                 // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a8;                                  // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a7;                                  // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a6;                                  // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a5;                                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a4;                                  // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a3;                                  // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a2;                                  // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a1;                                  // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a;                                   // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HuC_Book_00a24;                                 // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UObjectReactionEventComponent*          ObjectReaction;                                    // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Bookshelf_00_C">();
	}
	static class ABP_Bookshelf_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Bookshelf_00_C>();
	}
};
static_assert(alignof(ABP_Bookshelf_00_C) == 0x000008, "Wrong alignment on ABP_Bookshelf_00_C");
static_assert(sizeof(ABP_Bookshelf_00_C) == 0x000440, "Wrong size on ABP_Bookshelf_00_C");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_01a11) == 0x0002B0, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_01a11' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_01a10) == 0x0002B8, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_01a10' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_01a9) == 0x0002C0, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_01a9' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_01a8) == 0x0002C8, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_01a8' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_01a7) == 0x0002D0, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_01a7' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_01a6) == 0x0002D8, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_01a6' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_01a5) == 0x0002E0, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_01a5' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_01a4) == 0x0002E8, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_01a4' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_01a3) == 0x0002F0, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_01a3' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_01a2) == 0x0002F8, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_01a2' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_01a1) == 0x000300, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_01a1' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_01a) == 0x000308, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_01a' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a35) == 0x000310, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a35' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a34) == 0x000318, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a34' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a33) == 0x000320, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a33' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a32) == 0x000328, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a32' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a31) == 0x000330, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a31' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a30) == 0x000338, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a30' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a29) == 0x000340, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a29' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a28) == 0x000348, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a28' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a27) == 0x000350, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a27' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a26) == 0x000358, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a26' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a25) == 0x000360, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a25' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Bookshelf_00a) == 0x000368, "Member 'ABP_Bookshelf_00_C::SM_HuC_Bookshelf_00a' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a23) == 0x000370, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a23' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a22) == 0x000378, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a22' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a21) == 0x000380, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a21' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a20) == 0x000388, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a20' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a19) == 0x000390, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a19' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a18) == 0x000398, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a18' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a17) == 0x0003A0, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a17' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a16) == 0x0003A8, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a16' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a15) == 0x0003B0, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a15' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a14) == 0x0003B8, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a14' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a13) == 0x0003C0, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a13' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a12) == 0x0003C8, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a12' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a11) == 0x0003D0, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a11' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a10) == 0x0003D8, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a10' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a8) == 0x0003E0, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a8' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a7) == 0x0003E8, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a7' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a6) == 0x0003F0, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a6' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a5) == 0x0003F8, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a5' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a4) == 0x000400, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a4' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a3) == 0x000408, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a3' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a2) == 0x000410, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a2' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a1) == 0x000418, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a1' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a) == 0x000420, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, SM_HuC_Book_00a24) == 0x000428, "Member 'ABP_Bookshelf_00_C::SM_HuC_Book_00a24' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, Scene) == 0x000430, "Member 'ABP_Bookshelf_00_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Bookshelf_00_C, ObjectReaction) == 0x000438, "Member 'ABP_Bookshelf_00_C::ObjectReaction' has a wrong offset!");

}

