#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BossFinishTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BossFinishTimer.BP_BossFinishTimer_C
// 0x0020 (0x0248 - 0x0228)
class ABP_BossFinishTimer_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              EVD_IsTimeOver;                                    // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_BossFinishTimer(int32 EntryPoint);
	void CEV_CloseWaitTime();
	void ReceiveTick(float DeltaSeconds);
	void FC_OnTimeCount();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BossFinishTimer_C">();
	}
	static class ABP_BossFinishTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BossFinishTimer_C>();
	}
};
static_assert(alignof(ABP_BossFinishTimer_C) == 0x000008, "Wrong alignment on ABP_BossFinishTimer_C");
static_assert(sizeof(ABP_BossFinishTimer_C) == 0x000248, "Wrong size on ABP_BossFinishTimer_C");
static_assert(offsetof(ABP_BossFinishTimer_C, UberGraphFrame) == 0x000228, "Member 'ABP_BossFinishTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BossFinishTimer_C, DefaultSceneRoot) == 0x000230, "Member 'ABP_BossFinishTimer_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BossFinishTimer_C, EVD_IsTimeOver) == 0x000238, "Member 'ABP_BossFinishTimer_C::EVD_IsTimeOver' has a wrong offset!");

}

