#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Book_00

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Book_00.BP_Book_00_C
// 0x0018 (0x02C8 - 0x02B0)
class ABP_Book_00_C final : public AFieldObjectBase
{
public:
	class UStaticMeshComponent*                   SM_Pencil_00a;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UObjectReactionEventComponent*          ObjectReactionEvent;                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Book_00a;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Book_00_C">();
	}
	static class ABP_Book_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Book_00_C>();
	}
};
static_assert(alignof(ABP_Book_00_C) == 0x000008, "Wrong alignment on ABP_Book_00_C");
static_assert(sizeof(ABP_Book_00_C) == 0x0002C8, "Wrong size on ABP_Book_00_C");
static_assert(offsetof(ABP_Book_00_C, SM_Pencil_00a) == 0x0002B0, "Member 'ABP_Book_00_C::SM_Pencil_00a' has a wrong offset!");
static_assert(offsetof(ABP_Book_00_C, ObjectReactionEvent) == 0x0002B8, "Member 'ABP_Book_00_C::ObjectReactionEvent' has a wrong offset!");
static_assert(offsetof(ABP_Book_00_C, SM_Book_00a) == 0x0002C0, "Member 'ABP_Book_00_C::SM_Book_00a' has a wrong offset!");

}

