#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DirtyFoodTable_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DirtyFoodTable_01.BP_DirtyFoodTable_01_C
// 0x0118 (0x0340 - 0x0228)
class ABP_DirtyFoodTable_01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent32;                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent31;                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent30;                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent29;                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent28;                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent27;                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent26;                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent25;                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent24;                             // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent23;                             // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent22;                             // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent21;                             // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent20;                             // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent19;                             // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent18;                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent17;                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent16;                             // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent15;                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent14;                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent13;                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent12;                             // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent11;                             // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent10;                             // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent9;                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent8;                              // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent7;                              // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent6;                              // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent5;                              // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent4;                              // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent3;                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent2;                              // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent1;                              // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DirtyFoodTable_01_C">();
	}
	static class ABP_DirtyFoodTable_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DirtyFoodTable_01_C>();
	}
};
static_assert(alignof(ABP_DirtyFoodTable_01_C) == 0x000008, "Wrong alignment on ABP_DirtyFoodTable_01_C");
static_assert(sizeof(ABP_DirtyFoodTable_01_C) == 0x000340, "Wrong size on ABP_DirtyFoodTable_01_C");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent32) == 0x000228, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent32' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent31) == 0x000230, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent31' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent30) == 0x000238, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent30' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent29) == 0x000240, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent29' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent28) == 0x000248, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent28' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent27) == 0x000250, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent27' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent26) == 0x000258, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent26' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent25) == 0x000260, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent25' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent24) == 0x000268, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent24' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent23) == 0x000270, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent23' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent22) == 0x000278, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent22' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent21) == 0x000280, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent21' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent20) == 0x000288, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent20' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent19) == 0x000290, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent19' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent18) == 0x000298, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent18' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent17) == 0x0002A0, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent17' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent16) == 0x0002A8, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent16' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent15) == 0x0002B0, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent15' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent14) == 0x0002B8, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent14' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent13) == 0x0002C0, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent13' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent12) == 0x0002C8, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent12' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent11) == 0x0002D0, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent11' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent10) == 0x0002D8, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent10' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent9) == 0x0002E0, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent9' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent8) == 0x0002E8, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent8' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent7) == 0x0002F0, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent7' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent6) == 0x0002F8, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent6' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent5) == 0x000300, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent5' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent4) == 0x000308, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent4' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent3) == 0x000310, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent2) == 0x000318, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent1) == 0x000320, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, StaticMeshComponent0) == 0x000328, "Member 'ABP_DirtyFoodTable_01_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, SharedRoot) == 0x000330, "Member 'ABP_DirtyFoodTable_01_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(ABP_DirtyFoodTable_01_C, DefaultSceneRoot) == 0x000338, "Member 'ABP_DirtyFoodTable_01_C::DefaultSceneRoot' has a wrong offset!");

}

