#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DugUpArtifact

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DugUpArtifact.BP_DugUpArtifact_C.ExecuteUbergraph_BP_DugUpArtifact
// 0x0290 (0x0290 - 0x0000)
struct BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue;      // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0094(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRightVector_ReturnValue_1;             // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue_1;    // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17B[0x5];                                      // 0x017B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_4;       // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0204(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact) == 0x000008, "Wrong alignment on BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact");
static_assert(sizeof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact) == 0x000290, "Wrong size on BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, EntryPoint) == 0x000000, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000010, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00001C, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_BreakVector_X) == 0x000028, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_BreakVector_Y) == 0x00002C, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_BreakVector_Z) == 0x000030, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000034, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_GetRightVector_ReturnValue) == 0x000040, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_GetForwardVector_ReturnValue) == 0x00004C, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_Add_VectorVector_ReturnValue) == 0x000064, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_Normal_ReturnValue) == 0x000070, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_RotatorFromAxisAndAngle_ReturnValue) == 0x00007C, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_RotatorFromAxisAndAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000088, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000094, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00011C, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_ComposeRotators_ReturnValue) == 0x000120, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_K2_SetActorRotation_ReturnValue) == 0x00012C, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_GetRightVector_ReturnValue_1) == 0x000130, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_GetRightVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_GetForwardVector_ReturnValue_1) == 0x00013C, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000148, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_Normal_ReturnValue_1) == 0x000154, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_RotatorFromAxisAndAngle_ReturnValue_1) == 0x000160, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_RotatorFromAxisAndAngle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_ComposeRotators_ReturnValue_1) == 0x00016C, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x000178, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_IsValid_ReturnValue) == 0x000179, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_IsValid_ReturnValue_1) == 0x00017A, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_GetAttachParentActor_ReturnValue) == 0x000180, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_IsValid_ReturnValue_2) == 0x000188, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_GetActorRightVector_ReturnValue) == 0x00018C, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_GetActorUpVector_ReturnValue) == 0x000198, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x0001A4, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_Multiply_VectorFloat_ReturnValue_3) == 0x0001B0, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_Multiply_VectorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_GetActorForwardVector_ReturnValue) == 0x0001BC, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001C8, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_Multiply_VectorFloat_ReturnValue_4) == 0x0001D4, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_Multiply_VectorFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0001E0, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_Add_VectorVector_ReturnValue_4) == 0x0001EC, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_Add_VectorVector_ReturnValue_5) == 0x0001F8, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_Add_VectorVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x000204, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x00028C, "Member 'BP_DugUpArtifact_C_ExecuteUbergraph_BP_DugUpArtifact::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");

}

