#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DarwinLevelSequenceDirector

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DarwinGame_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.ExecuteUbergraph_BP_DarwinLevelSequenceDirector
// 0x0028 (0x0028 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenWaitUI_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLevelSequencePlayRangeInfo            K2Node_CustomEvent_LoopRange;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_LimitFrame;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_FirstLoopStartFrameOffset;      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DelayAndBlendFrame;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector) == 0x000004, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector) == 0x000028, "Wrong size on BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector, EntryPoint) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector, CallFunc_IsOpenWaitUI_ReturnValue) == 0x000004, "Member 'BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector::CallFunc_IsOpenWaitUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector, K2Node_CustomEvent_LoopRange) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector::K2Node_CustomEvent_LoopRange' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector, K2Node_CustomEvent_LimitFrame) == 0x000010, "Member 'BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector::K2Node_CustomEvent_LimitFrame' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector, K2Node_CustomEvent_FirstLoopStartFrameOffset) == 0x000014, "Member 'BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector::K2Node_CustomEvent_FirstLoopStartFrameOffset' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00001C, "Member 'BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector, K2Node_CustomEvent_DelayAndBlendFrame) == 0x000024, "Member 'BP_DarwinLevelSequenceDirector_C_ExecuteUbergraph_BP_DarwinLevelSequenceDirector::K2Node_CustomEvent_DelayAndBlendFrame' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.PlayRangeLoopingAndLimitTIme
// 0x0010 (0x0010 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_PlayRangeLoopingAndLimitTIme final
{
public:
	struct FLevelSequencePlayRangeInfo            LoopRange;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         LimitFrame;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FirstLoopStartFrameOffset;                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_PlayRangeLoopingAndLimitTIme) == 0x000004, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_PlayRangeLoopingAndLimitTIme");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_PlayRangeLoopingAndLimitTIme) == 0x000010, "Wrong size on BP_DarwinLevelSequenceDirector_C_PlayRangeLoopingAndLimitTIme");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_PlayRangeLoopingAndLimitTIme, LoopRange) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_PlayRangeLoopingAndLimitTIme::LoopRange' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_PlayRangeLoopingAndLimitTIme, LimitFrame) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_PlayRangeLoopingAndLimitTIme::LimitFrame' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_PlayRangeLoopingAndLimitTIme, FirstLoopStartFrameOffset) == 0x00000C, "Member 'BP_DarwinLevelSequenceDirector_C_PlayRangeLoopingAndLimitTIme::FirstLoopStartFrameOffset' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.DelayAndPauseEvent
// 0x0004 (0x0004 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_DelayAndPauseEvent final
{
public:
	float                                         DelayAndBlendFrame;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_DelayAndPauseEvent) == 0x000004, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_DelayAndPauseEvent");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_DelayAndPauseEvent) == 0x000004, "Wrong size on BP_DarwinLevelSequenceDirector_C_DelayAndPauseEvent");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_DelayAndPauseEvent, DelayAndBlendFrame) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_DelayAndPauseEvent::DelayAndBlendFrame' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.Pause
// 0x0001 (0x0001 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_Pause final
{
public:
	bool                                          CallFunc_IsOpenWaitUI_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_Pause) == 0x000001, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_Pause");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_Pause) == 0x000001, "Wrong size on BP_DarwinLevelSequenceDirector_C_Pause");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Pause, CallFunc_IsOpenWaitUI_ReturnValue) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_Pause::CallFunc_IsOpenWaitUI_ReturnValue' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.ResetBindings
// 0x0028 (0x0028 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_ResetBindings final
{
public:
	class ALevelSequenceActor*                    Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFrameDuration_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_ResetBindings) == 0x000008, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_ResetBindings");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_ResetBindings) == 0x000028, "Wrong size on BP_DarwinLevelSequenceDirector_C_ResetBindings");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ResetBindings, Target) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_ResetBindings::Target' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ResetBindings, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_ResetBindings::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ResetBindings, CallFunc_GetSequencePlayer_ReturnValue) == 0x000010, "Member 'BP_DarwinLevelSequenceDirector_C_ResetBindings::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ResetBindings, CallFunc_GetFrameDuration_ReturnValue) == 0x000018, "Member 'BP_DarwinLevelSequenceDirector_C_ResetBindings::CallFunc_GetFrameDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ResetBindings, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000020, "Member 'BP_DarwinLevelSequenceDirector_C_ResetBindings::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.DrawTalkWindow_Old
// 0x0004 (0x0004 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_DrawTalkWindow_Old final
{
public:
	int32                                         MessageStartIndex;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_DrawTalkWindow_Old) == 0x000004, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_DrawTalkWindow_Old");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_DrawTalkWindow_Old) == 0x000004, "Wrong size on BP_DarwinLevelSequenceDirector_C_DrawTalkWindow_Old");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_DrawTalkWindow_Old, MessageStartIndex) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_DrawTalkWindow_Old::MessageStartIndex' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.BindingPlayerCharacter
// 0x0028 (0x0028 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_BindingPlayerCharacter final
{
public:
	class ALevelSequenceActor*                    Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneObjectBindingID             Binding;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_BindingPlayerCharacter) == 0x000008, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_BindingPlayerCharacter");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_BindingPlayerCharacter) == 0x000028, "Wrong size on BP_DarwinLevelSequenceDirector_C_BindingPlayerCharacter");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_BindingPlayerCharacter, Target) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_BindingPlayerCharacter::Target' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_BindingPlayerCharacter, Binding) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_BindingPlayerCharacter::Binding' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_BindingPlayerCharacter, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000020, "Member 'BP_DarwinLevelSequenceDirector_C_BindingPlayerCharacter::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.Stop
// 0x0018 (0x0018 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_Stop final
{
public:
	class ALevelSequenceActor*                    Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFrameDuration_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_Stop) == 0x000008, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_Stop");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_Stop) == 0x000018, "Wrong size on BP_DarwinLevelSequenceDirector_C_Stop");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Stop, Target) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_Stop::Target' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Stop, CallFunc_GetSequencePlayer_ReturnValue) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_Stop::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Stop, CallFunc_GetFrameDuration_ReturnValue) == 0x000010, "Member 'BP_DarwinLevelSequenceDirector_C_Stop::CallFunc_GetFrameDuration_ReturnValue' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.SetPlayRange_old
// 0x0028 (0x0028 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_SetPlayRange_old final
{
public:
	class ULevelSequencePlayer*                   Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayRangeIndex;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   SequencePlayer;                                    // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_SetPlayRange_old) == 0x000008, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_SetPlayRange_old");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_SetPlayRange_old) == 0x000028, "Wrong size on BP_DarwinLevelSequenceDirector_C_SetPlayRange_old");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_SetPlayRange_old, Target) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_SetPlayRange_old::Target' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_SetPlayRange_old, PlayRangeIndex) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_SetPlayRange_old::PlayRangeIndex' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_SetPlayRange_old, SequencePlayer) == 0x000010, "Member 'BP_DarwinLevelSequenceDirector_C_SetPlayRange_old::SequencePlayer' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_SetPlayRange_old, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_DarwinLevelSequenceDirector_C_SetPlayRange_old::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_SetPlayRange_old, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_DarwinLevelSequenceDirector_C_SetPlayRange_old::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_SetPlayRange_old, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'BP_DarwinLevelSequenceDirector_C_SetPlayRange_old::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.PlayRangeLooping_Old
// 0x0020 (0x0020 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_PlayRangeLooping_Old final
{
public:
	class ALevelSequenceActor*                    Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayRangeIndex;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_SetPlayRange_old_SequencePlayer;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_PlayRangeLooping_Old) == 0x000008, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_PlayRangeLooping_Old");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_PlayRangeLooping_Old) == 0x000020, "Wrong size on BP_DarwinLevelSequenceDirector_C_PlayRangeLooping_Old");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_PlayRangeLooping_Old, Target) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_PlayRangeLooping_Old::Target' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_PlayRangeLooping_Old, PlayRangeIndex) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_PlayRangeLooping_Old::PlayRangeIndex' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_PlayRangeLooping_Old, CallFunc_GetSequencePlayer_ReturnValue) == 0x000010, "Member 'BP_DarwinLevelSequenceDirector_C_PlayRangeLooping_Old::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_PlayRangeLooping_Old, CallFunc_SetPlayRange_old_SequencePlayer) == 0x000018, "Member 'BP_DarwinLevelSequenceDirector_C_PlayRangeLooping_Old::CallFunc_SetPlayRange_old_SequencePlayer' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.PlayRangeNormal_Old
// 0x0020 (0x0020 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_PlayRangeNormal_Old final
{
public:
	class ALevelSequenceActor*                    Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayRangeIndex;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_SetPlayRange_old_SequencePlayer;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_PlayRangeNormal_Old) == 0x000008, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_PlayRangeNormal_Old");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_PlayRangeNormal_Old) == 0x000020, "Wrong size on BP_DarwinLevelSequenceDirector_C_PlayRangeNormal_Old");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_PlayRangeNormal_Old, Target) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_PlayRangeNormal_Old::Target' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_PlayRangeNormal_Old, PlayRangeIndex) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_PlayRangeNormal_Old::PlayRangeIndex' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_PlayRangeNormal_Old, CallFunc_GetSequencePlayer_ReturnValue) == 0x000010, "Member 'BP_DarwinLevelSequenceDirector_C_PlayRangeNormal_Old::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_PlayRangeNormal_Old, CallFunc_SetPlayRange_old_SequencePlayer) == 0x000018, "Member 'BP_DarwinLevelSequenceDirector_C_PlayRangeNormal_Old::CallFunc_SetPlayRange_old_SequencePlayer' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.Change Player Camera to Event Camera
// 0x0040 (0x0040 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera final
{
public:
	class ACineCameraActor*                       EventCamera;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlendTime;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EViewTargetBlendFunction                      BlendFunc;                                         // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendExp;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLockOutgoing;                                     // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera) == 0x000008, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera) == 0x000040, "Wrong size on BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera, EventCamera) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera::EventCamera' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera, BlendTime) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera::BlendTime' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera, BlendFunc) == 0x00000C, "Member 'BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera::BlendFunc' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera, BlendExp) == 0x000010, "Member 'BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera::BlendExp' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera, bLockOutgoing) == 0x000014, "Member 'BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera::bLockOutgoing' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera, CallFunc_GetViewTarget_ReturnValue) == 0x000020, "Member 'BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera, CallFunc_GetPlayerController_ReturnValue_1) == 0x000028, "Member 'BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera, CallFunc_GetDisplayName_ReturnValue) == 0x000030, "Member 'BP_DarwinLevelSequenceDirector_C_Change_Player_Camera_to_Event_Camera::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.Play
// 0x0010 (0x0010 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_Play final
{
public:
	class ALevelSequenceActor*                    Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetSequencePlayer_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_Play) == 0x000008, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_Play");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_Play) == 0x000010, "Wrong size on BP_DarwinLevelSequenceDirector_C_Play");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Play, Target) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_Play::Target' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_Play, CallFunc_GetSequencePlayer_ReturnValue) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_Play::CallFunc_GetSequencePlayer_ReturnValue' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.InitMain
// 0x00B0 (0x00B0 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_InitMain final
{
public:
	bool                                          IsGravity_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bNewActorEnableCollision;                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsDrawCSBlackLine;                                // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AllNpcVisibility;                                  // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNPCManager*                            CallFunc_GetNPCManager_NPCManager;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppInputComponent*                     CallFunc_GetAppInputComponent_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float DeltaTime, bool bGamePaused, const struct FKeyInput& InKeyInput, struct FKeyInput* OutKeyInput, struct FEventReply* Output)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UEventSystemManager*                    CallFunc_GetInstance_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEventManager*                          CallFunc_GetEventManager_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCurrentEventId_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkippableEvent_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventSystemManager*                    CallFunc_GetInstance_ReturnValue_1;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQualifiedFrameTime                    CallFunc_GetDuration_ReturnValue;                  // 0x0070(0x0010)(NoDestructor, HasGetValueTypeHash)
	struct FFrameNumber                           CallFunc_BreakQualifiedFrameTime_Frame;            // 0x0080(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FFrameRate                             CallFunc_BreakQualifiedFrameTime_FrameRate;        // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakQualifiedFrameTime_SubFrame;         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawTextInfo                          CallFunc_CreateTextID_ReturnValue;                 // 0x0090(0x0010)()
	class ABP_EvetSystemManagerActor_C*           CallFunc_GetBP_EventSystemManager_BP_Evet_System_Manager_Actor; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LevelSequenceController_C*          CallFunc_GetBPSequencerController_AsBP_Level_Sequence_Controller; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_InitMain) == 0x000008, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_InitMain");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_InitMain) == 0x0000B0, "Wrong size on BP_DarwinLevelSequenceDirector_C_InitMain");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, IsGravity_0) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::IsGravity_0' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, bNewActorEnableCollision) == 0x000001, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::bNewActorEnableCollision' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, bIsDrawCSBlackLine) == 0x000002, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::bIsDrawCSBlackLine' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, AllNpcVisibility) == 0x000003, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::AllNpcVisibility' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_GetNPCManager_NPCManager) == 0x000010, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_GetNPCManager_NPCManager' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000018, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_GetAppInputComponent_ReturnValue) == 0x000028, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_GetAppInputComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_GetInstance_ReturnValue) == 0x000040, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_GetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_GetEventManager_ReturnValue) == 0x000048, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_GetEventManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000050, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_GetCurrentEventId_ReturnValue) == 0x000058, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_GetCurrentEventId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_IsSkippableEvent_ReturnValue) == 0x000060, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_IsSkippableEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_GetInstance_ReturnValue_1) == 0x000068, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_GetInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_GetDuration_ReturnValue) == 0x000070, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_GetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_BreakQualifiedFrameTime_Frame) == 0x000080, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_BreakQualifiedFrameTime_Frame' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_BreakQualifiedFrameTime_FrameRate) == 0x000084, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_BreakQualifiedFrameTime_FrameRate' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_BreakQualifiedFrameTime_SubFrame) == 0x00008C, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_BreakQualifiedFrameTime_SubFrame' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_CreateTextID_ReturnValue) == 0x000090, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_CreateTextID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_GetBP_EventSystemManager_BP_Evet_System_Manager_Actor) == 0x0000A0, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_GetBP_EventSystemManager_BP_Evet_System_Manager_Actor' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitMain, CallFunc_GetBPSequencerController_AsBP_Level_Sequence_Controller) == 0x0000A8, "Member 'BP_DarwinLevelSequenceDirector_C_InitMain::CallFunc_GetBPSequencerController_AsBP_Level_Sequence_Controller' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.FinMain
// 0x0050 (0x0050 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_FinMain final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EViewTargetBlendFunction                      BlendFunc;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendExp;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLockOutgoing;                                     // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CameraKeep;                                        // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NPCHiddenKeep;                                     // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsResetPlayerCamera;                               // 0x000F(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          StopAllLookAt;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RemovePlayerCollision;                             // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNPCManager*                            CallFunc_GetNPCManager_NPCManager;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAppPlayerController*                   K2Node_DynamicCast_AsApp_Player_Controller;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppInputComponent*                     CallFunc_GetAppInputComponent_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_FinMain) == 0x000008, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_FinMain");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_FinMain) == 0x000050, "Wrong size on BP_DarwinLevelSequenceDirector_C_FinMain");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, BlendTime) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::BlendTime' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, BlendFunc) == 0x000004, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::BlendFunc' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, BlendExp) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::BlendExp' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, bLockOutgoing) == 0x00000C, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::bLockOutgoing' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, CameraKeep) == 0x00000D, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::CameraKeep' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, NPCHiddenKeep) == 0x00000E, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::NPCHiddenKeep' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, IsResetPlayerCamera) == 0x00000F, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::IsResetPlayerCamera' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, StopAllLookAt) == 0x000010, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::StopAllLookAt' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, RemovePlayerCollision) == 0x000011, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::RemovePlayerCollision' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, CallFunc_GetNPCManager_NPCManager) == 0x000018, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::CallFunc_GetNPCManager_NPCManager' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000020, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, K2Node_DynamicCast_AsApp_Player_Controller) == 0x000030, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::K2Node_DynamicCast_AsApp_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, CallFunc_GetAppInputComponent_ReturnValue) == 0x000040, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::CallFunc_GetAppInputComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_FinMain, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_DarwinLevelSequenceDirector_C_FinMain::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.ChangeEventCameraToPlayerCamera
// 0x0060 (0x0060 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EViewTargetBlendFunction                      BlendFunc;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendExp;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLockOutgoing;                                     // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ADarwinCamera*                          Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerControllerInterface> K2Node_DynamicCast_AsPlayer_Controller_Interface;  // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADarwinCamera*                          CallFunc_GetControlledCamera_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera) == 0x000008, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera) == 0x000060, "Wrong size on BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera, BlendTime) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera::BlendTime' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera, BlendFunc) == 0x000004, "Member 'BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera::BlendFunc' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera, BlendExp) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera::BlendExp' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera, bLockOutgoing) == 0x00000C, "Member 'BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera::bLockOutgoing' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera, Temp_object_Variable) == 0x000010, "Member 'BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera, CallFunc_GetViewTarget_ReturnValue) == 0x000020, "Member 'BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera, CallFunc_GetDisplayName_ReturnValue) == 0x000028, "Member 'BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera, CallFunc_GetPlayerController_ReturnValue_1) == 0x000038, "Member 'BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera, K2Node_DynamicCast_AsPlayer_Controller_Interface) == 0x000040, "Member 'BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera::K2Node_DynamicCast_AsPlayer_Controller_Interface' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera, CallFunc_GetControlledCamera_ReturnValue) == 0x000058, "Member 'BP_DarwinLevelSequenceDirector_C_ChangeEventCameraToPlayerCamera::CallFunc_GetControlledCamera_ReturnValue' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.InitSub
// 0x0030 (0x0030 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_InitSub final
{
public:
	int32                                         CallFunc_CalcSequenceLength_Length;                // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_EvetSystemManagerActor_C*           CallFunc_GetBP_EventSystemManager_BP_Evet_System_Manager_Actor; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LevelSequenceController_C*          CallFunc_GetBPSequencerController_AsBP_Level_Sequence_Controller; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEventSystemManager*                    CallFunc_GetInstance_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawTextInfo                          CallFunc_CreateTextID_ReturnValue;                 // 0x0020(0x0010)()
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_InitSub) == 0x000008, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_InitSub");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_InitSub) == 0x000030, "Wrong size on BP_DarwinLevelSequenceDirector_C_InitSub");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitSub, CallFunc_CalcSequenceLength_Length) == 0x000000, "Member 'BP_DarwinLevelSequenceDirector_C_InitSub::CallFunc_CalcSequenceLength_Length' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitSub, CallFunc_GetBP_EventSystemManager_BP_Evet_System_Manager_Actor) == 0x000008, "Member 'BP_DarwinLevelSequenceDirector_C_InitSub::CallFunc_GetBP_EventSystemManager_BP_Evet_System_Manager_Actor' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitSub, CallFunc_GetBPSequencerController_AsBP_Level_Sequence_Controller) == 0x000010, "Member 'BP_DarwinLevelSequenceDirector_C_InitSub::CallFunc_GetBPSequencerController_AsBP_Level_Sequence_Controller' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitSub, CallFunc_GetInstance_ReturnValue) == 0x000018, "Member 'BP_DarwinLevelSequenceDirector_C_InitSub::CallFunc_GetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarwinLevelSequenceDirector_C_InitSub, CallFunc_CreateTextID_ReturnValue) == 0x000020, "Member 'BP_DarwinLevelSequenceDirector_C_InitSub::CallFunc_CreateTextID_ReturnValue' has a wrong offset!");

// Function BP_DarwinLevelSequenceDirector.BP_DarwinLevelSequenceDirector_C.CallPlaySubSequence
// 0x0048 (0x0048 - 0x0000)
struct BP_DarwinLevelSequenceDirector_C_CallPlaySubSequence final
{
public:
	class ALevelSequenceActor*                    SubLevelSequence;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BreakSoftObjectPath_PathString;           // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULevelSequence*                         CallFunc_GetSequence_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarwinLevelSequenceDirector_C_CallPlaySubSequence) == 0x000008, "Wrong alignment on BP_DarwinLevelSequenceDirector_C_CallPlaySubSequence");
static_assert(sizeof(BP_DarwinLevelSequenceDirector_C_CallPlaySubSequence) == 0x000048, "Wrong size on BP_DarwinLevelSequenceDirector_C_CallPlaySubSequence");
