#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EF_Monster_1630

#include "Basic.hpp"

#include "BP_EffectBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EF_Monster_1630.BP_EF_Monster_1630_C
// 0x0020 (0x0300 - 0x02E0)
class ABP_EF_Monster_1630_C final : public ABP_EffectBase_C
{
public:
	class UExtendParticleComponent*               Lp1;                                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExtendParticleComponent*               Ed;                                                // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExtendParticleComponent*               Lp;                                                // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExtendParticleComponent*               St;                                                // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EF_Monster_1630_C">();
	}
	static class ABP_EF_Monster_1630_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EF_Monster_1630_C>();
	}
};
static_assert(alignof(ABP_EF_Monster_1630_C) == 0x000008, "Wrong alignment on ABP_EF_Monster_1630_C");
static_assert(sizeof(ABP_EF_Monster_1630_C) == 0x000300, "Wrong size on ABP_EF_Monster_1630_C");
static_assert(offsetof(ABP_EF_Monster_1630_C, Lp1) == 0x0002E0, "Member 'ABP_EF_Monster_1630_C::Lp1' has a wrong offset!");
static_assert(offsetof(ABP_EF_Monster_1630_C, Ed) == 0x0002E8, "Member 'ABP_EF_Monster_1630_C::Ed' has a wrong offset!");
static_assert(offsetof(ABP_EF_Monster_1630_C, Lp) == 0x0002F0, "Member 'ABP_EF_Monster_1630_C::Lp' has a wrong offset!");
static_assert(offsetof(ABP_EF_Monster_1630_C, St) == 0x0002F8, "Member 'ABP_EF_Monster_1630_C::St' has a wrong offset!");

}

