#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EventSystemManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_EventSystemManager.BP_EventSystemManager_C.GetEventManagerActor
// 0x0020 (0x0020 - 0x0000)
struct BP_EventSystemManager_C_GetEventManagerActor final
{
public:
	class ABP_EvetSystemManagerActor_C*           EvetSystemManagerActor;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEventSystemManagerActor*               CallFunc_GetEventSystemManagerActor_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EvetSystemManagerActor_C*           K2Node_DynamicCast_AsBP_Evet_System_Manager_Actor; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EventSystemManager_C_GetEventManagerActor) == 0x000008, "Wrong alignment on BP_EventSystemManager_C_GetEventManagerActor");
static_assert(sizeof(BP_EventSystemManager_C_GetEventManagerActor) == 0x000020, "Wrong size on BP_EventSystemManager_C_GetEventManagerActor");
static_assert(offsetof(BP_EventSystemManager_C_GetEventManagerActor, EvetSystemManagerActor) == 0x000000, "Member 'BP_EventSystemManager_C_GetEventManagerActor::EvetSystemManagerActor' has a wrong offset!");
static_assert(offsetof(BP_EventSystemManager_C_GetEventManagerActor, CallFunc_GetEventSystemManagerActor_ReturnValue) == 0x000008, "Member 'BP_EventSystemManager_C_GetEventManagerActor::CallFunc_GetEventSystemManagerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EventSystemManager_C_GetEventManagerActor, K2Node_DynamicCast_AsBP_Evet_System_Manager_Actor) == 0x000010, "Member 'BP_EventSystemManager_C_GetEventManagerActor::K2Node_DynamicCast_AsBP_Evet_System_Manager_Actor' has a wrong offset!");
static_assert(offsetof(BP_EventSystemManager_C_GetEventManagerActor, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_EventSystemManager_C_GetEventManagerActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

