#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EF_Monster_4970

#include "Basic.hpp"

#include "BP_EffectBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EF_Monster_4970.BP_EF_Monster_4970_C
// 0x0018 (0x02F8 - 0x02E0)
class ABP_EF_Monster_4970_C final : public ABP_EffectBase_C
{
public:
	class UExtendParticleComponent*               Hit;                                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExtendParticleComponent*               Loop;                                              // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExtendParticleComponent*               Start;                                             // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EF_Monster_4970_C">();
	}
	static class ABP_EF_Monster_4970_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EF_Monster_4970_C>();
	}
};
static_assert(alignof(ABP_EF_Monster_4970_C) == 0x000008, "Wrong alignment on ABP_EF_Monster_4970_C");
static_assert(sizeof(ABP_EF_Monster_4970_C) == 0x0002F8, "Wrong size on ABP_EF_Monster_4970_C");
static_assert(offsetof(ABP_EF_Monster_4970_C, Hit) == 0x0002E0, "Member 'ABP_EF_Monster_4970_C::Hit' has a wrong offset!");
static_assert(offsetof(ABP_EF_Monster_4970_C, Loop) == 0x0002E8, "Member 'ABP_EF_Monster_4970_C::Loop' has a wrong offset!");
static_assert(offsetof(ABP_EF_Monster_4970_C, Start) == 0x0002F0, "Member 'ABP_EF_Monster_4970_C::Start' has a wrong offset!");

}

