#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EF_Monster_1712_EX

#include "Basic.hpp"

#include "BP_EffectBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EF_Monster_1712_EX.BP_EF_Monster_1712_EX_C
// 0x0038 (0x0318 - 0x02E0)
class ABP_EF_Monster_1712_EX_C final : public ABP_EffectBase_C
{
public:
	class UExtendParticleComponent*               Loop6;                                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExtendParticleComponent*               Loop5;                                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExtendParticleComponent*               Loop4;                                             // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExtendParticleComponent*               Loop3;                                             // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExtendParticleComponent*               Loop2;                                             // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExtendParticleComponent*               Loop1;                                             // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExtendParticleComponent*               Loop;                                              // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EF_Monster_1712_EX_C">();
	}
	static class ABP_EF_Monster_1712_EX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EF_Monster_1712_EX_C>();
	}
};
static_assert(alignof(ABP_EF_Monster_1712_EX_C) == 0x000008, "Wrong alignment on ABP_EF_Monster_1712_EX_C");
static_assert(sizeof(ABP_EF_Monster_1712_EX_C) == 0x000318, "Wrong size on ABP_EF_Monster_1712_EX_C");
static_assert(offsetof(ABP_EF_Monster_1712_EX_C, Loop6) == 0x0002E0, "Member 'ABP_EF_Monster_1712_EX_C::Loop6' has a wrong offset!");
static_assert(offsetof(ABP_EF_Monster_1712_EX_C, Loop5) == 0x0002E8, "Member 'ABP_EF_Monster_1712_EX_C::Loop5' has a wrong offset!");
static_assert(offsetof(ABP_EF_Monster_1712_EX_C, Loop4) == 0x0002F0, "Member 'ABP_EF_Monster_1712_EX_C::Loop4' has a wrong offset!");
static_assert(offsetof(ABP_EF_Monster_1712_EX_C, Loop3) == 0x0002F8, "Member 'ABP_EF_Monster_1712_EX_C::Loop3' has a wrong offset!");
static_assert(offsetof(ABP_EF_Monster_1712_EX_C, Loop2) == 0x000300, "Member 'ABP_EF_Monster_1712_EX_C::Loop2' has a wrong offset!");
static_assert(offsetof(ABP_EF_Monster_1712_EX_C, Loop1) == 0x000308, "Member 'ABP_EF_Monster_1712_EX_C::Loop1' has a wrong offset!");
static_assert(offsetof(ABP_EF_Monster_1712_EX_C, Loop) == 0x000310, "Member 'ABP_EF_Monster_1712_EX_C::Loop' has a wrong offset!");

}

