#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EvetSystemManagerActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_EvetSystemManagerActor.BP_EvetSystemManagerActor_C.ExecuteUbergraph_BP_EvetSystemManagerActor
// 0x0040 (0x0040 - 0x0000)
struct BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_LevelSequenceController_C*          CallFunc_GetBPSequencerController_AsBP_Level_Sequence_Controller; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_EventID;                              // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EventExecter_C*                     CallFunc_GetBPEventExecuter_AsBP_Event_Execter;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EventManager_C*                     CallFunc_GetBPEventManager_AsBP_Event_Manager;     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EventManager_C*                     CallFunc_GetBPEventManager_AsBP_Event_Manager_1;   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_EventTrigger_C>    CallFunc_SendEvent_self_CastInput;                 // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor) == 0x000008, "Wrong alignment on BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor");
static_assert(sizeof(BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor) == 0x000040, "Wrong size on BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor");
static_assert(offsetof(BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor, EntryPoint) == 0x000000, "Member 'BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor, CallFunc_GetBPSequencerController_AsBP_Level_Sequence_Controller) == 0x000008, "Member 'BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor::CallFunc_GetBPSequencerController_AsBP_Level_Sequence_Controller' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor, K2Node_Event_EventID) == 0x000010, "Member 'BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor::K2Node_Event_EventID' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor, CallFunc_GetBPEventExecuter_AsBP_Event_Execter) == 0x000018, "Member 'BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor::CallFunc_GetBPEventExecuter_AsBP_Event_Execter' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor, CallFunc_GetBPEventManager_AsBP_Event_Manager) == 0x000020, "Member 'BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor::CallFunc_GetBPEventManager_AsBP_Event_Manager' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor, CallFunc_GetBPEventManager_AsBP_Event_Manager_1) == 0x000028, "Member 'BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor::CallFunc_GetBPEventManager_AsBP_Event_Manager_1' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor, CallFunc_SendEvent_self_CastInput) == 0x000030, "Member 'BP_EvetSystemManagerActor_C_ExecuteUbergraph_BP_EvetSystemManagerActor::CallFunc_SendEvent_self_CastInput' has a wrong offset!");

// Function BP_EvetSystemManagerActor.BP_EvetSystemManagerActor_C.StartDebugEvent
// 0x0008 (0x0008 - 0x0000)
struct BP_EvetSystemManagerActor_C_StartDebugEvent final
{
public:
	class FName                                   EventID;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EvetSystemManagerActor_C_StartDebugEvent) == 0x000004, "Wrong alignment on BP_EvetSystemManagerActor_C_StartDebugEvent");
static_assert(sizeof(BP_EvetSystemManagerActor_C_StartDebugEvent) == 0x000008, "Wrong size on BP_EvetSystemManagerActor_C_StartDebugEvent");
static_assert(offsetof(BP_EvetSystemManagerActor_C_StartDebugEvent, EventID) == 0x000000, "Member 'BP_EvetSystemManagerActor_C_StartDebugEvent::EventID' has a wrong offset!");

// Function BP_EvetSystemManagerActor.BP_EvetSystemManagerActor_C.GetBPEventExecuter
// 0x0020 (0x0020 - 0x0000)
struct BP_EvetSystemManagerActor_C_GetBPEventExecuter final
{
public:
	class UBP_EventExecter_C*                     AsBP_Event_Execter;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEventExecuter*                         CallFunc_GetEventExecuter_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EventExecter_C*                     K2Node_DynamicCast_AsBP_Event_Execter;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EvetSystemManagerActor_C_GetBPEventExecuter) == 0x000008, "Wrong alignment on BP_EvetSystemManagerActor_C_GetBPEventExecuter");
static_assert(sizeof(BP_EvetSystemManagerActor_C_GetBPEventExecuter) == 0x000020, "Wrong size on BP_EvetSystemManagerActor_C_GetBPEventExecuter");
static_assert(offsetof(BP_EvetSystemManagerActor_C_GetBPEventExecuter, AsBP_Event_Execter) == 0x000000, "Member 'BP_EvetSystemManagerActor_C_GetBPEventExecuter::AsBP_Event_Execter' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_GetBPEventExecuter, CallFunc_GetEventExecuter_ReturnValue) == 0x000008, "Member 'BP_EvetSystemManagerActor_C_GetBPEventExecuter::CallFunc_GetEventExecuter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_GetBPEventExecuter, K2Node_DynamicCast_AsBP_Event_Execter) == 0x000010, "Member 'BP_EvetSystemManagerActor_C_GetBPEventExecuter::K2Node_DynamicCast_AsBP_Event_Execter' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_GetBPEventExecuter, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_EvetSystemManagerActor_C_GetBPEventExecuter::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_EvetSystemManagerActor.BP_EvetSystemManagerActor_C.GetBPEventManager
// 0x0020 (0x0020 - 0x0000)
struct BP_EvetSystemManagerActor_C_GetBPEventManager final
{
public:
	class UBP_EventManager_C*                     AsBP_Event_Manager;                                // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEventManager*                          CallFunc_GetEventManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EventManager_C*                     K2Node_DynamicCast_AsBP_Event_Manager;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EvetSystemManagerActor_C_GetBPEventManager) == 0x000008, "Wrong alignment on BP_EvetSystemManagerActor_C_GetBPEventManager");
static_assert(sizeof(BP_EvetSystemManagerActor_C_GetBPEventManager) == 0x000020, "Wrong size on BP_EvetSystemManagerActor_C_GetBPEventManager");
static_assert(offsetof(BP_EvetSystemManagerActor_C_GetBPEventManager, AsBP_Event_Manager) == 0x000000, "Member 'BP_EvetSystemManagerActor_C_GetBPEventManager::AsBP_Event_Manager' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_GetBPEventManager, CallFunc_GetEventManager_ReturnValue) == 0x000008, "Member 'BP_EvetSystemManagerActor_C_GetBPEventManager::CallFunc_GetEventManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_GetBPEventManager, K2Node_DynamicCast_AsBP_Event_Manager) == 0x000010, "Member 'BP_EvetSystemManagerActor_C_GetBPEventManager::K2Node_DynamicCast_AsBP_Event_Manager' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_GetBPEventManager, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_EvetSystemManagerActor_C_GetBPEventManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_EvetSystemManagerActor.BP_EvetSystemManagerActor_C.GetBPSequencerController
// 0x0020 (0x0020 - 0x0000)
struct BP_EvetSystemManagerActor_C_GetBPSequencerController final
{
public:
	class UBP_LevelSequenceController_C*          AsBP_Level_Sequence_Controller;                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USequencerController*                   CallFunc_GetSequencerContorller_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_LevelSequenceController_C*          K2Node_DynamicCast_AsBP_Level_Sequence_Controller; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EvetSystemManagerActor_C_GetBPSequencerController) == 0x000008, "Wrong alignment on BP_EvetSystemManagerActor_C_GetBPSequencerController");
static_assert(sizeof(BP_EvetSystemManagerActor_C_GetBPSequencerController) == 0x000020, "Wrong size on BP_EvetSystemManagerActor_C_GetBPSequencerController");
static_assert(offsetof(BP_EvetSystemManagerActor_C_GetBPSequencerController, AsBP_Level_Sequence_Controller) == 0x000000, "Member 'BP_EvetSystemManagerActor_C_GetBPSequencerController::AsBP_Level_Sequence_Controller' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_GetBPSequencerController, CallFunc_GetSequencerContorller_ReturnValue) == 0x000008, "Member 'BP_EvetSystemManagerActor_C_GetBPSequencerController::CallFunc_GetSequencerContorller_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_GetBPSequencerController, K2Node_DynamicCast_AsBP_Level_Sequence_Controller) == 0x000010, "Member 'BP_EvetSystemManagerActor_C_GetBPSequencerController::K2Node_DynamicCast_AsBP_Level_Sequence_Controller' has a wrong offset!");
static_assert(offsetof(BP_EvetSystemManagerActor_C_GetBPSequencerController, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_EvetSystemManagerActor_C_GetBPSequencerController::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

