#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Event_Talk

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Event_Talk.BP_Event_Talk_C.ExecuteUbergraph_BP_Event_Talk
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterStateInterfaceForABP> K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterStateInterfaceForABP> K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP_1; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterStateInterfaceForABP> K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP_2; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         K2Node_DynamicCast_AsGame_Character_1;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_1;        // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk) == 0x000008, "Wrong alignment on BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk");
static_assert(sizeof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk) == 0x0000D0, "Wrong size on BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, EntryPoint) == 0x000000, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, Temp_object_Variable) == 0x000008, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP) == 0x000010, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, Temp_object_Variable_1) == 0x000030, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_AsCharacter_Interface) == 0x000038, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, CallFunc_GetAnimInstance_ReturnValue) == 0x000050, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP_1) == 0x000058, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP_1' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP_2) == 0x000070, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_AsCharacter_State_Interface_for_ABP_2' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_AsGame_Character) == 0x000088, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_AsGame_Character' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_bSuccess_4) == 0x000090, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, CallFunc_GetOwner_ReturnValue_1) == 0x000098, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_AsGame_Character_1) == 0x0000A0, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_AsGame_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_bSuccess_5) == 0x0000A8, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_AsCharacter_Interface_1) == 0x0000B0, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_AsCharacter_Interface_1' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, K2Node_DynamicCast_bSuccess_6) == 0x0000C0, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk, CallFunc_GetAnimInstance_ReturnValue_1) == 0x0000C8, "Member 'BP_Event_Talk_C_ExecuteUbergraph_BP_Event_Talk::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");

}

