#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EffectManagerLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_EffectManagerLibrary.BP_EffectManagerLibrary_C.GetEffectManager
// 0x0028 (0x0028 - 0x0000)
struct BP_EffectManagerLibrary_C_GetEffectManager final
{
public:
	class UObject*                                m_WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EffectManager_C*                    EffectManager;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEffectManager*                         CallFunc_GetInstance_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_EffectManager_C*                    K2Node_DynamicCast_AsBP_Effect_Manager;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EffectManagerLibrary_C_GetEffectManager) == 0x000008, "Wrong alignment on BP_EffectManagerLibrary_C_GetEffectManager");
static_assert(sizeof(BP_EffectManagerLibrary_C_GetEffectManager) == 0x000028, "Wrong size on BP_EffectManagerLibrary_C_GetEffectManager");
static_assert(offsetof(BP_EffectManagerLibrary_C_GetEffectManager, m_WorldContext) == 0x000000, "Member 'BP_EffectManagerLibrary_C_GetEffectManager::m_WorldContext' has a wrong offset!");
static_assert(offsetof(BP_EffectManagerLibrary_C_GetEffectManager, EffectManager) == 0x000008, "Member 'BP_EffectManagerLibrary_C_GetEffectManager::EffectManager' has a wrong offset!");
static_assert(offsetof(BP_EffectManagerLibrary_C_GetEffectManager, CallFunc_GetInstance_ReturnValue) == 0x000010, "Member 'BP_EffectManagerLibrary_C_GetEffectManager::CallFunc_GetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EffectManagerLibrary_C_GetEffectManager, K2Node_DynamicCast_AsBP_Effect_Manager) == 0x000018, "Member 'BP_EffectManagerLibrary_C_GetEffectManager::K2Node_DynamicCast_AsBP_Effect_Manager' has a wrong offset!");
static_assert(offsetof(BP_EffectManagerLibrary_C_GetEffectManager, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_EffectManagerLibrary_C_GetEffectManager::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

