#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FoodTable_12

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FoodTable_12.BP_FoodTable_12_C
// 0x00A8 (0x02E0 - 0x0238)
class ABP_FoodTable_12_C final : public AFieldObjectBasicBase
{
public:
	class UStaticMeshComponent*                   ShrimpScaleS_00a;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneRoot;                                         // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SoupdishScaleS_00a;                                // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TableDirtScaleS_001;                               // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StewBowlScaleS_00a;                                // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TableDirtScaleS_01a;                               // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TableDirtScaleS_000;                               // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StewBowlScaleS_01a;                                // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MugScaleS_00a;                                     // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BottleScaleS_01a;                                  // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PlateScaleS_00a;                                   // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CuttingBoardScaleS_00a;                            // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StewBowlScaleS_02a;                                // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MugScaleS_00a1;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   TableDirtScaleS_01a1;                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BreadScaleS_05a;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cheese_00a;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GrilledFishScaleS_03a;                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeatScaleS_03a;                                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StewScaleS_05a;                                    // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StewScaleS_02a;                                    // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FoodTable_12_C">();
	}
	static class ABP_FoodTable_12_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FoodTable_12_C>();
	}
};
static_assert(alignof(ABP_FoodTable_12_C) == 0x000008, "Wrong alignment on ABP_FoodTable_12_C");
static_assert(sizeof(ABP_FoodTable_12_C) == 0x0002E0, "Wrong size on ABP_FoodTable_12_C");
static_assert(offsetof(ABP_FoodTable_12_C, ShrimpScaleS_00a) == 0x000238, "Member 'ABP_FoodTable_12_C::ShrimpScaleS_00a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, SceneRoot) == 0x000240, "Member 'ABP_FoodTable_12_C::SceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, SoupdishScaleS_00a) == 0x000248, "Member 'ABP_FoodTable_12_C::SoupdishScaleS_00a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, TableDirtScaleS_001) == 0x000250, "Member 'ABP_FoodTable_12_C::TableDirtScaleS_001' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, StewBowlScaleS_00a) == 0x000258, "Member 'ABP_FoodTable_12_C::StewBowlScaleS_00a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, TableDirtScaleS_01a) == 0x000260, "Member 'ABP_FoodTable_12_C::TableDirtScaleS_01a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, TableDirtScaleS_000) == 0x000268, "Member 'ABP_FoodTable_12_C::TableDirtScaleS_000' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, StewBowlScaleS_01a) == 0x000270, "Member 'ABP_FoodTable_12_C::StewBowlScaleS_01a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, MugScaleS_00a) == 0x000278, "Member 'ABP_FoodTable_12_C::MugScaleS_00a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, BottleScaleS_01a) == 0x000280, "Member 'ABP_FoodTable_12_C::BottleScaleS_01a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, PlateScaleS_00a) == 0x000288, "Member 'ABP_FoodTable_12_C::PlateScaleS_00a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, CuttingBoardScaleS_00a) == 0x000290, "Member 'ABP_FoodTable_12_C::CuttingBoardScaleS_00a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, StewBowlScaleS_02a) == 0x000298, "Member 'ABP_FoodTable_12_C::StewBowlScaleS_02a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, MugScaleS_00a1) == 0x0002A0, "Member 'ABP_FoodTable_12_C::MugScaleS_00a1' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, TableDirtScaleS_01a1) == 0x0002A8, "Member 'ABP_FoodTable_12_C::TableDirtScaleS_01a1' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, BreadScaleS_05a) == 0x0002B0, "Member 'ABP_FoodTable_12_C::BreadScaleS_05a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, Cheese_00a) == 0x0002B8, "Member 'ABP_FoodTable_12_C::Cheese_00a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, GrilledFishScaleS_03a) == 0x0002C0, "Member 'ABP_FoodTable_12_C::GrilledFishScaleS_03a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, MeatScaleS_03a) == 0x0002C8, "Member 'ABP_FoodTable_12_C::MeatScaleS_03a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, StewScaleS_05a) == 0x0002D0, "Member 'ABP_FoodTable_12_C::StewScaleS_05a' has a wrong offset!");
static_assert(offsetof(ABP_FoodTable_12_C, StewScaleS_02a) == 0x0002D8, "Member 'ABP_FoodTable_12_C::StewScaleS_02a' has a wrong offset!");

}

