#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FastTravelComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "DarwinGame_structs.hpp"


namespace SDK::Params
{

// Function BP_FastTravelComponent.BP_FastTravelComponent_C.ExecuteUbergraph_BP_FastTravelComponent
// 0x0430 (0x0430 - 0x0000)
struct BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFastTravelInfo                        K2Node_CustomEvent_Info;                           // 0x0008(0x0040)()
	struct FFastTravelInfo                        K2Node_CustomEvent_FastTravelInfo_1;               // 0x0048(0x0040)(ConstParm)
	class AGPACharacter*                          K2Node_CustomEvent_PlayerActor;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_CameraActor;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFootActor_ReturnValue;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetFootActor_Out_Hit_Hit_Actor;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelNameWithActor_isGet;              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetLevelNameWithActor_ReturnValue;        // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        CallFunc_GetStreamingLevel_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelVisible_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFootActor_ReturnValue_1;               // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetFootActor_Out_Hit_Hit_Actor_1;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLevelNameWithActor_isGet_1;            // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetLevelNameWithActor_ReturnValue_1;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0160(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult_1;    // 0x01EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue_1;       // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsFastTravel_ReturnValue;              // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_276[0x2];                                      // 0x0276(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetFastTravelLocation_ReturnValue;        // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFastTravelInfo                        K2Node_MakeStruct_FastTravelInfo;                  // 0x0288(0x0040)()
	class AGPACharacter*                          K2Node_CustomEvent_Character;                      // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFastTravelInfo                        K2Node_CustomEvent_FastTravelInfo;                 // 0x02D0(0x0040)()
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x0310(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_322[0x2];                                      // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_id;                                   // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFastTravelInfo                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0368(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFastTravelId_ReturnValue;              // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x03B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Fade_C*                              CallFunc_GetFade_OutWidget;                        // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_FieldManager_C*                     CallFunc_GetFieldManager_FieldManager;             // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCollectionPointManager*                CallFunc_GetCollectionPointManager_ReturnValue;    // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorIsPlayer_ReturnValue;                // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Fade_C*                              CallFunc_GetFade_OutWidget_1;                      // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent) == 0x000010, "Wrong alignment on BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent");
static_assert(sizeof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent) == 0x000430, "Wrong size on BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, EntryPoint) == 0x000000, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_CustomEvent_Info) == 0x000008, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_CustomEvent_Info' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_CustomEvent_FastTravelInfo_1) == 0x000048, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_CustomEvent_FastTravelInfo_1' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_CustomEvent_PlayerActor) == 0x000088, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_CustomEvent_PlayerActor' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_CustomEvent_CameraActor) == 0x000090, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_CustomEvent_CameraActor' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetFootActor_ReturnValue) == 0x000099, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetFootActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetFootActor_Out_Hit_Hit_Actor) == 0x0000A0, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetFootActor_Out_Hit_Hit_Actor' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetLevelNameWithActor_isGet) == 0x0000A8, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetLevelNameWithActor_isGet' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetLevelNameWithActor_ReturnValue) == 0x0000AC, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetLevelNameWithActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetStreamingLevel_ReturnValue) == 0x0000B8, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetStreamingLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_IsLevelVisible_ReturnValue) == 0x0000C0, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_IsLevelVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_IsValid_ReturnValue_1) == 0x0000C1, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_Not_PreBool_ReturnValue) == 0x0000C2, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetActorBounds_Origin) == 0x0000C4, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetActorBounds_BoxExtent) == 0x0000D0, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetFootActor_ReturnValue_1) == 0x0000DC, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetFootActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetFootActor_Out_Hit_Hit_Actor_1) == 0x0000E0, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetFootActor_Out_Hit_Hit_Actor_1' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_BreakVector_X) == 0x0000E8, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_BreakVector_Y) == 0x0000EC, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_BreakVector_Z) == 0x0000F0, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetLevelNameWithActor_isGet_1) == 0x0000F4, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetLevelNameWithActor_isGet_1' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetLevelNameWithActor_ReturnValue_1) == 0x0000F8, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetLevelNameWithActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_Add_FloatFloat_ReturnValue) == 0x000100, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000104, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_MakeVector_ReturnValue) == 0x000108, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_BooleanOR_ReturnValue) == 0x000114, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_Add_VectorVector_ReturnValue) == 0x000118, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_Event_DeltaSeconds) == 0x000124, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_MakeTransform_ReturnValue) == 0x000130, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000160, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0001E8, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_K2_SetActorTransform_SweepHitResult_1) == 0x0001EC, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_K2_SetActorTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_K2_SetActorTransform_ReturnValue_1) == 0x000274, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_K2_SetActorTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetIsFastTravel_ReturnValue) == 0x000275, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetIsFastTravel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetFastTravelLocation_ReturnValue) == 0x000278, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetFastTravelLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000284, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_MakeStruct_FastTravelInfo) == 0x000288, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_MakeStruct_FastTravelInfo' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_CustomEvent_Character) == 0x0002C8, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_CustomEvent_FastTravelInfo) == 0x0002D0, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_CustomEvent_FastTravelInfo' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_DynamicCast_AsCharacter_Interface) == 0x000310, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_DynamicCast_bSuccess) == 0x000320, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000321, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000324, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_BreakRotator_Roll) == 0x000330, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_BreakRotator_Pitch) == 0x000334, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_BreakRotator_Yaw) == 0x000338, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_MakeRotator_ReturnValue) == 0x00033C, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000348, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_Event_id) == 0x00034C, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_Event_id' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_Conv_IntToString_ReturnValue) == 0x000350, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_Conv_StringToName_ReturnValue) == 0x000360, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetDataTableRowFromName_OutRow) == 0x000368, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0003A8, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetFastTravelId_ReturnValue) == 0x0003AC, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetFastTravelId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_NotEqual_IntInt_ReturnValue) == 0x0003B0, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_CreateDelegate_OutputDelegate) == 0x0003B4, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetFade_OutWidget) == 0x0003C8, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetFade_OutWidget' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0003D0, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetFieldManager_FieldManager) == 0x0003D8, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetFieldManager_FieldManager' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetCollectionPointManager_ReturnValue) == 0x0003E0, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetCollectionPointManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetOwner_ReturnValue) == 0x0003E8, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_ActorIsPlayer_ReturnValue) == 0x0003F0, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_ActorIsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetFade_OutWidget_1) == 0x0003F8, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetFade_OutWidget_1' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000400, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_DynamicCast_AsPlayer_Character) == 0x000408, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_DynamicCast_AsPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, K2Node_DynamicCast_bSuccess_1) == 0x000410, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetController_ReturnValue) == 0x000418, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent, CallFunc_GetViewTarget_ReturnValue) == 0x000420, "Member 'BP_FastTravelComponent_C_ExecuteUbergraph_BP_FastTravelComponent::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");

// Function BP_FastTravelComponent.BP_FastTravelComponent_C.OnMoveCore
// 0x0040 (0x0040 - 0x0000)
struct BP_FastTravelComponent_C_OnMoveCore final
{
public:
	struct FFastTravelInfo                        Info;                                              // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_FastTravelComponent_C_OnMoveCore) == 0x000008, "Wrong alignment on BP_FastTravelComponent_C_OnMoveCore");
static_assert(sizeof(BP_FastTravelComponent_C_OnMoveCore) == 0x000040, "Wrong size on BP_FastTravelComponent_C_OnMoveCore");
static_assert(offsetof(BP_FastTravelComponent_C_OnMoveCore, Info) == 0x000000, "Member 'BP_FastTravelComponent_C_OnMoveCore::Info' has a wrong offset!");

// Function BP_FastTravelComponent.BP_FastTravelComponent_C.OnMove
// 0x0004 (0x0004 - 0x0000)
struct BP_FastTravelComponent_C_OnMove final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FastTravelComponent_C_OnMove) == 0x000004, "Wrong alignment on BP_FastTravelComponent_C_OnMove");
static_assert(sizeof(BP_FastTravelComponent_C_OnMove) == 0x000004, "Wrong size on BP_FastTravelComponent_C_OnMove");
static_assert(offsetof(BP_FastTravelComponent_C_OnMove, ID) == 0x000000, "Member 'BP_FastTravelComponent_C_OnMove::ID' has a wrong offset!");

// Function BP_FastTravelComponent.BP_FastTravelComponent_C.FinishFastTravel
// 0x0048 (0x0048 - 0x0000)
struct BP_FastTravelComponent_C_FinishFastTravel final
{
public:
	class AGPACharacter*                          Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFastTravelInfo                        FastTravelInfo;                                    // 0x0008(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_FastTravelComponent_C_FinishFastTravel) == 0x000008, "Wrong alignment on BP_FastTravelComponent_C_FinishFastTravel");
static_assert(sizeof(BP_FastTravelComponent_C_FinishFastTravel) == 0x000048, "Wrong size on BP_FastTravelComponent_C_FinishFastTravel");
static_assert(offsetof(BP_FastTravelComponent_C_FinishFastTravel, Character) == 0x000000, "Member 'BP_FastTravelComponent_C_FinishFastTravel::Character' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_FinishFastTravel, FastTravelInfo) == 0x000008, "Member 'BP_FastTravelComponent_C_FinishFastTravel::FastTravelInfo' has a wrong offset!");

// Function BP_FastTravelComponent.BP_FastTravelComponent_C.MoveToPlayer
// 0x0050 (0x0050 - 0x0000)
struct BP_FastTravelComponent_C_MoveToPlayer final
{
public:
	struct FFastTravelInfo                        FastTravelInfo;                                    // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AGPACharacter*                          PlayerActor;                                       // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CameraActor;                                       // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FastTravelComponent_C_MoveToPlayer) == 0x000008, "Wrong alignment on BP_FastTravelComponent_C_MoveToPlayer");
static_assert(sizeof(BP_FastTravelComponent_C_MoveToPlayer) == 0x000050, "Wrong size on BP_FastTravelComponent_C_MoveToPlayer");
static_assert(offsetof(BP_FastTravelComponent_C_MoveToPlayer, FastTravelInfo) == 0x000000, "Member 'BP_FastTravelComponent_C_MoveToPlayer::FastTravelInfo' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_MoveToPlayer, PlayerActor) == 0x000040, "Member 'BP_FastTravelComponent_C_MoveToPlayer::PlayerActor' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_MoveToPlayer, CameraActor) == 0x000048, "Member 'BP_FastTravelComponent_C_MoveToPlayer::CameraActor' has a wrong offset!");

// Function BP_FastTravelComponent.BP_FastTravelComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FastTravelComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FastTravelComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FastTravelComponent_C_ReceiveTick");
static_assert(sizeof(BP_FastTravelComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_FastTravelComponent_C_ReceiveTick");
static_assert(offsetof(BP_FastTravelComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FastTravelComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FastTravelComponent.BP_FastTravelComponent_C.GetFootActor
// 0x0158 (0x0158 - 0x0000)
struct BP_FastTravelComponent_C_GetFootActor final
{
public:
	class AActor*                                 InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Out_Hit_Hit_Actor;                                 // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0050(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FastTravelComponent_C_GetFootActor) == 0x000008, "Wrong alignment on BP_FastTravelComponent_C_GetFootActor");
static_assert(sizeof(BP_FastTravelComponent_C_GetFootActor) == 0x000158, "Wrong size on BP_FastTravelComponent_C_GetFootActor");
static_assert(offsetof(BP_FastTravelComponent_C_GetFootActor, InputPin) == 0x000000, "Member 'BP_FastTravelComponent_C_GetFootActor::InputPin' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_GetFootActor, ReturnValue) == 0x000008, "Member 'BP_FastTravelComponent_C_GetFootActor::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FastTravelComponent_C_GetFootActor, Out_Hit_Hit_Actor) == 0x000010, "Member 'BP_FastTravelComponent_C_GetFootActor::Out_Hit_Hit_Actor' has a wrong offset!");
