#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameInstanceLibrary

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GameInstanceLibrary.BP_GameInstanceLibrary_C.GetAppGameInstance
// 0x0028 (0x0028 - 0x0000)
struct BP_GameInstanceLibrary_C_GetAppGameInstance final
{
public:
	class UObject*                                m_WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AppGameInstance_C*                  AppGameInstance;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAppGameInstance*                       CallFunc_GetAppGameInstance_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AppGameInstance_C*                  K2Node_DynamicCast_AsBP_App_Game_Instance;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameInstanceLibrary_C_GetAppGameInstance) == 0x000008, "Wrong alignment on BP_GameInstanceLibrary_C_GetAppGameInstance");
static_assert(sizeof(BP_GameInstanceLibrary_C_GetAppGameInstance) == 0x000028, "Wrong size on BP_GameInstanceLibrary_C_GetAppGameInstance");
static_assert(offsetof(BP_GameInstanceLibrary_C_GetAppGameInstance, m_WorldContext) == 0x000000, "Member 'BP_GameInstanceLibrary_C_GetAppGameInstance::m_WorldContext' has a wrong offset!");
static_assert(offsetof(BP_GameInstanceLibrary_C_GetAppGameInstance, AppGameInstance) == 0x000008, "Member 'BP_GameInstanceLibrary_C_GetAppGameInstance::AppGameInstance' has a wrong offset!");
static_assert(offsetof(BP_GameInstanceLibrary_C_GetAppGameInstance, CallFunc_GetAppGameInstance_ReturnValue) == 0x000010, "Member 'BP_GameInstanceLibrary_C_GetAppGameInstance::CallFunc_GetAppGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameInstanceLibrary_C_GetAppGameInstance, K2Node_DynamicCast_AsBP_App_Game_Instance) == 0x000018, "Member 'BP_GameInstanceLibrary_C_GetAppGameInstance::K2Node_DynamicCast_AsBP_App_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_GameInstanceLibrary_C_GetAppGameInstance, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_GameInstanceLibrary_C_GetAppGameInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

