#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MQ_010_CS_010_SEV

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MQ_010_CS_010_SEV.BP_MQ_010_CS_010_SEV_C
// 0x0018 (0x02C0 - 0x02A8)
class ABP_MQ_010_CS_010_SEV_C final : public AScriptEventBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   PLAYER_NOTHAVE_DRAGON_SWORD;                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MQ_010_CS_010_SEV(int32 EntryPoint);
	void ReceiveSelectResult();
	void ExecuteEvent();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MQ_010_CS_010_SEV_C">();
	}
	static class ABP_MQ_010_CS_010_SEV_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MQ_010_CS_010_SEV_C>();
	}
};
static_assert(alignof(ABP_MQ_010_CS_010_SEV_C) == 0x000008, "Wrong alignment on ABP_MQ_010_CS_010_SEV_C");
static_assert(sizeof(ABP_MQ_010_CS_010_SEV_C) == 0x0002C0, "Wrong size on ABP_MQ_010_CS_010_SEV_C");
static_assert(offsetof(ABP_MQ_010_CS_010_SEV_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_MQ_010_CS_010_SEV_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MQ_010_CS_010_SEV_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_MQ_010_CS_010_SEV_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_MQ_010_CS_010_SEV_C, PLAYER_NOTHAVE_DRAGON_SWORD) == 0x0002B8, "Member 'ABP_MQ_010_CS_010_SEV_C::PLAYER_NOTHAVE_DRAGON_SWORD' has a wrong offset!");

}

