#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ShelfSetScaleM_02

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ShelfSetScaleM_02.BP_ShelfSetScaleM_02_C
// 0x00B8 (0x02F0 - 0x0238)
class ABP_ShelfSetScaleM_02_C final : public AFieldObjectBasicBase
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent1;                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneRoot;                                         // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hempbag_02a1;                                   // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hempbag_02a;                                    // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent20;                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent19;                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent18;                             // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent17;                             // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent16;                             // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent15;                             // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent14;                             // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent13;                             // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent12;                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent9;                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent8;                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent7;                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent6;                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent5;                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent4;                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent3;                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent11;                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent10;                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ShelfSetScaleM_02_C">();
	}
	static class ABP_ShelfSetScaleM_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ShelfSetScaleM_02_C>();
	}
};
static_assert(alignof(ABP_ShelfSetScaleM_02_C) == 0x000008, "Wrong alignment on ABP_ShelfSetScaleM_02_C");
static_assert(sizeof(ABP_ShelfSetScaleM_02_C) == 0x0002F0, "Wrong size on ABP_ShelfSetScaleM_02_C");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent1) == 0x000238, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, SceneRoot) == 0x000240, "Member 'ABP_ShelfSetScaleM_02_C::SceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, SM_Hempbag_02a1) == 0x000248, "Member 'ABP_ShelfSetScaleM_02_C::SM_Hempbag_02a1' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, SM_Hempbag_02a) == 0x000250, "Member 'ABP_ShelfSetScaleM_02_C::SM_Hempbag_02a' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent20) == 0x000258, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent20' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent19) == 0x000260, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent19' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent18) == 0x000268, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent18' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent17) == 0x000270, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent17' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent16) == 0x000278, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent16' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent15) == 0x000280, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent15' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent14) == 0x000288, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent14' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent13) == 0x000290, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent13' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent12) == 0x000298, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent12' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent0) == 0x0002A0, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent9) == 0x0002A8, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent9' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent8) == 0x0002B0, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent8' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent7) == 0x0002B8, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent7' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent6) == 0x0002C0, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent6' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent5) == 0x0002C8, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent5' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent4) == 0x0002D0, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent4' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent3) == 0x0002D8, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent11) == 0x0002E0, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent11' has a wrong offset!");
static_assert(offsetof(ABP_ShelfSetScaleM_02_C, StaticMeshComponent10) == 0x0002E8, "Member 'ABP_ShelfSetScaleM_02_C::StaticMeshComponent10' has a wrong offset!");

}

