#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrainRail_00

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TrainRail_00.BP_TrainRail_00_C
// 0x0020 (0x02D0 - 0x02B0)
class ABP_TrainRail_00_C final : public AFieldObjectBase
{
public:
	class UChildActorComponent*                   BP_EF_Field_2540_Back;                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_EF_Field_2540_Front;                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Liftline_00a;                                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TrainRail_00_C">();
	}
	static class ABP_TrainRail_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TrainRail_00_C>();
	}
};
static_assert(alignof(ABP_TrainRail_00_C) == 0x000008, "Wrong alignment on ABP_TrainRail_00_C");
static_assert(sizeof(ABP_TrainRail_00_C) == 0x0002D0, "Wrong size on ABP_TrainRail_00_C");
static_assert(offsetof(ABP_TrainRail_00_C, BP_EF_Field_2540_Back) == 0x0002B0, "Member 'ABP_TrainRail_00_C::BP_EF_Field_2540_Back' has a wrong offset!");
static_assert(offsetof(ABP_TrainRail_00_C, BP_EF_Field_2540_Front) == 0x0002B8, "Member 'ABP_TrainRail_00_C::BP_EF_Field_2540_Front' has a wrong offset!");
static_assert(offsetof(ABP_TrainRail_00_C, SM_Liftline_00a) == 0x0002C0, "Member 'ABP_TrainRail_00_C::SM_Liftline_00a' has a wrong offset!");
static_assert(offsetof(ABP_TrainRail_00_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_TrainRail_00_C::DefaultSceneRoot' has a wrong offset!");

}

