#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VolcanoGimmicks

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_VolcanoGimmicks.BP_VolcanoGimmicks_C.HitCheckGimmick
// 0x0058 (0x0058 - 0x0000)
struct BP_VolcanoGimmicks_C_HitCheckGimmick final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InRadius;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InLocation;                                        // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VolcanoPillarSet_C*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HitCheckGimmick_IsBreking;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VolcanoGimmicks_C_HitCheckGimmick) == 0x000008, "Wrong alignment on BP_VolcanoGimmicks_C_HitCheckGimmick");
static_assert(sizeof(BP_VolcanoGimmicks_C_HitCheckGimmick) == 0x000058, "Wrong size on BP_VolcanoGimmicks_C_HitCheckGimmick");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, Location) == 0x000000, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::Location' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, Radius) == 0x00000C, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::Radius' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, InRadius) == 0x000010, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::InRadius' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, InLocation) == 0x000014, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::InLocation' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, Temp_int_Variable) == 0x000030, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00003C, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckGimmick, CallFunc_HitCheckGimmick_IsBreking) == 0x000051, "Member 'BP_VolcanoGimmicks_C_HitCheckGimmick::CallFunc_HitCheckGimmick_IsBreking' has a wrong offset!");

// Function BP_VolcanoGimmicks.BP_VolcanoGimmicks_C.HitCheckPillar
// 0x0058 (0x0058 - 0x0000)
struct BP_VolcanoGimmicks_C_HitCheckPillar final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InRadius;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InLocation;                                        // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VolcanoPillarSet_C*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HitCheckPillar_IsBreaking;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VolcanoGimmicks_C_HitCheckPillar) == 0x000008, "Wrong alignment on BP_VolcanoGimmicks_C_HitCheckPillar");
static_assert(sizeof(BP_VolcanoGimmicks_C_HitCheckPillar) == 0x000058, "Wrong size on BP_VolcanoGimmicks_C_HitCheckPillar");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, Location) == 0x000000, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::Location' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, Radius) == 0x00000C, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::Radius' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, InRadius) == 0x000010, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::InRadius' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, InLocation) == 0x000014, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::InLocation' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, Temp_int_Variable) == 0x000030, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000038, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, CallFunc_Array_Length_ReturnValue_1) == 0x000040, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckPillar, CallFunc_HitCheckPillar_IsBreaking) == 0x000051, "Member 'BP_VolcanoGimmicks_C_HitCheckPillar::CallFunc_HitCheckPillar_IsBreaking' has a wrong offset!");

// Function BP_VolcanoGimmicks.BP_VolcanoGimmicks_C.AddFixedPos
// 0x0028 (0x0028 - 0x0000)
struct BP_VolcanoGimmicks_C_AddFixedPos final
{
public:
	class UActorComponent*                        fixedpos_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       K2Node_DynamicCast_AsSphere_Collision;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VolcanoGimmicks_C_AddFixedPos) == 0x000008, "Wrong alignment on BP_VolcanoGimmicks_C_AddFixedPos");
static_assert(sizeof(BP_VolcanoGimmicks_C_AddFixedPos) == 0x000028, "Wrong size on BP_VolcanoGimmicks_C_AddFixedPos");
static_assert(offsetof(BP_VolcanoGimmicks_C_AddFixedPos, fixedpos_0) == 0x000000, "Member 'BP_VolcanoGimmicks_C_AddFixedPos::fixedpos_0' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_AddFixedPos, K2Node_DynamicCast_AsSphere_Collision) == 0x000008, "Member 'BP_VolcanoGimmicks_C_AddFixedPos::K2Node_DynamicCast_AsSphere_Collision' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_AddFixedPos, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_VolcanoGimmicks_C_AddFixedPos::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_AddFixedPos, CallFunc_ComponentHasTag_ReturnValue) == 0x000011, "Member 'BP_VolcanoGimmicks_C_AddFixedPos::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_AddFixedPos, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000014, "Member 'BP_VolcanoGimmicks_C_AddFixedPos::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_AddFixedPos, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'BP_VolcanoGimmicks_C_AddFixedPos::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_VolcanoGimmicks.BP_VolcanoGimmicks_C.HitCheckStepStones
// 0x0020 (0x0020 - 0x0000)
struct BP_VolcanoGimmicks_C_HitCheckStepStones final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InRadius;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InLocation;                                        // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VolcanoGimmicks_C_HitCheckStepStones) == 0x000004, "Wrong alignment on BP_VolcanoGimmicks_C_HitCheckStepStones");
static_assert(sizeof(BP_VolcanoGimmicks_C_HitCheckStepStones) == 0x000020, "Wrong size on BP_VolcanoGimmicks_C_HitCheckStepStones");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckStepStones, Location) == 0x000000, "Member 'BP_VolcanoGimmicks_C_HitCheckStepStones::Location' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckStepStones, Radius) == 0x00000C, "Member 'BP_VolcanoGimmicks_C_HitCheckStepStones::Radius' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckStepStones, InRadius) == 0x000010, "Member 'BP_VolcanoGimmicks_C_HitCheckStepStones::InRadius' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitCheckStepStones, InLocation) == 0x000014, "Member 'BP_VolcanoGimmicks_C_HitCheckStepStones::InLocation' has a wrong offset!");

// Function BP_VolcanoGimmicks.BP_VolcanoGimmicks_C.AddPillar
// 0x0018 (0x0018 - 0x0000)
struct BP_VolcanoGimmicks_C_AddPillar final
{
public:
	class UChildActorComponent*                   self2;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VolcanoPillarSet_C*                 K2Node_DynamicCast_AsBP_Volcano_Pillar_Set;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VolcanoGimmicks_C_AddPillar) == 0x000008, "Wrong alignment on BP_VolcanoGimmicks_C_AddPillar");
static_assert(sizeof(BP_VolcanoGimmicks_C_AddPillar) == 0x000018, "Wrong size on BP_VolcanoGimmicks_C_AddPillar");
static_assert(offsetof(BP_VolcanoGimmicks_C_AddPillar, self2) == 0x000000, "Member 'BP_VolcanoGimmicks_C_AddPillar::self2' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_AddPillar, K2Node_DynamicCast_AsBP_Volcano_Pillar_Set) == 0x000008, "Member 'BP_VolcanoGimmicks_C_AddPillar::K2Node_DynamicCast_AsBP_Volcano_Pillar_Set' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_AddPillar, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_VolcanoGimmicks_C_AddPillar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_AddPillar, CallFunc_Array_Add_ReturnValue) == 0x000014, "Member 'BP_VolcanoGimmicks_C_AddPillar::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_VolcanoGimmicks.BP_VolcanoGimmicks_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_VolcanoGimmicks_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VolcanoGimmicks_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_VolcanoGimmicks_C_ReceiveTick");
static_assert(sizeof(BP_VolcanoGimmicks_C_ReceiveTick) == 0x000004, "Wrong size on BP_VolcanoGimmicks_C_ReceiveTick");
static_assert(offsetof(BP_VolcanoGimmicks_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_VolcanoGimmicks_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_VolcanoGimmicks.BP_VolcanoGimmicks_C.HitGimmickCheck
// 0x0010 (0x0010 - 0x0000)
struct BP_VolcanoGimmicks_C_HitGimmickCheck final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VolcanoGimmicks_C_HitGimmickCheck) == 0x000004, "Wrong alignment on BP_VolcanoGimmicks_C_HitGimmickCheck");
static_assert(sizeof(BP_VolcanoGimmicks_C_HitGimmickCheck) == 0x000010, "Wrong size on BP_VolcanoGimmicks_C_HitGimmickCheck");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitGimmickCheck, Location) == 0x000000, "Member 'BP_VolcanoGimmicks_C_HitGimmickCheck::Location' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_HitGimmickCheck, Radius) == 0x00000C, "Member 'BP_VolcanoGimmicks_C_HitGimmickCheck::Radius' has a wrong offset!");

// Function BP_VolcanoGimmicks.BP_VolcanoGimmicks_C.ExecuteUbergraph_BP_VolcanoGimmicks
// 0x0100 (0x0100 - 0x0000)
struct BP_VolcanoGimmicks_C_ExecuteUbergraph_BP_VolcanoGimmicks final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_Location;                             // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Radius;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_MonsterManager_C*                   CallFunc_GetMonsterManager_MonsterManager;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AMonsterBase*>                   CallFunc_GetMonsters_ReturnValue;                  // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class AMonsterBase*                           CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMonsterBoss*                           K2Node_DynamicCast_AsMonster_Boss;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsBoss_ReturnValue;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetBossGimmickBreak_ReturnValue;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBossStage_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_VolcanoPillarSet_C*                 CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_VolcanoPillarSet_C*                 CallFunc_Array_Get_Item_2;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item_3;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   K2Node_DynamicCast_AsChild_Actor_Component;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledSphereRadius_ReturnValue;        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VolcanoGimmicks_C_ExecuteUbergraph_BP_VolcanoGimmicks) == 0x000008, "Wrong alignment on BP_VolcanoGimmicks_C_ExecuteUbergraph_BP_VolcanoGimmicks");
static_assert(sizeof(BP_VolcanoGimmicks_C_ExecuteUbergraph_BP_VolcanoGimmicks) == 0x000100, "Wrong size on BP_VolcanoGimmicks_C_ExecuteUbergraph_BP_VolcanoGimmicks");
static_assert(offsetof(BP_VolcanoGimmicks_C_ExecuteUbergraph_BP_VolcanoGimmicks, EntryPoint) == 0x000000, "Member 'BP_VolcanoGimmicks_C_ExecuteUbergraph_BP_VolcanoGimmicks::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VolcanoGimmicks_C_ExecuteUbergraph_BP_VolcanoGimmicks, K2Node_Event_Location) == 0x000004, "Member 'BP_VolcanoGimmicks_C_ExecuteUbergraph_BP_VolcanoGimmicks::K2Node_Event_Location' has a wrong offset!");
