#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_SlingShot

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Weapon_SlingShot.BP_Weapon_SlingShot_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Weapon_SlingShot_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_SlingShot_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Weapon_SlingShot_C_ReceiveTick");
static_assert(sizeof(BP_Weapon_SlingShot_C_ReceiveTick) == 0x000004, "Wrong size on BP_Weapon_SlingShot_C_ReceiveTick");
static_assert(offsetof(BP_Weapon_SlingShot_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Weapon_SlingShot_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Weapon_SlingShot.BP_Weapon_SlingShot_C.Grab
// 0x0004 (0x0004 - 0x0000)
struct BP_Weapon_SlingShot_C_Grab final
{
public:
	float                                         Alpha;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_SlingShot_C_Grab) == 0x000004, "Wrong alignment on BP_Weapon_SlingShot_C_Grab");
static_assert(sizeof(BP_Weapon_SlingShot_C_Grab) == 0x000004, "Wrong size on BP_Weapon_SlingShot_C_Grab");
static_assert(offsetof(BP_Weapon_SlingShot_C_Grab, Alpha) == 0x000000, "Member 'BP_Weapon_SlingShot_C_Grab::Alpha' has a wrong offset!");

// Function BP_Weapon_SlingShot.BP_Weapon_SlingShot_C.ExecuteUbergraph_BP_Weapon_SlingShot
// 0x0060 (0x0060 - 0x0000)
struct BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMesh_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_SlingShot_C*                       K2Node_DynamicCast_AsABP_Sling_Shot;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Alpha;                                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMesh_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_SlingShot_C*                       K2Node_DynamicCast_AsABP_Sling_Shot_1;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot) == 0x000008, "Wrong alignment on BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot");
static_assert(sizeof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot) == 0x000060, "Wrong size on BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot");
static_assert(offsetof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot, EntryPoint) == 0x000000, "Member 'BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot, CallFunc_GetSkeletalMesh_ReturnValue) == 0x000008, "Member 'BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot::CallFunc_GetSkeletalMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot, K2Node_DynamicCast_AsABP_Sling_Shot) == 0x000020, "Member 'BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot::K2Node_DynamicCast_AsABP_Sling_Shot' has a wrong offset!");
static_assert(offsetof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot, K2Node_Event_DeltaSeconds) == 0x00002C, "Member 'BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot, K2Node_Event_Alpha) == 0x000030, "Member 'BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot::K2Node_Event_Alpha' has a wrong offset!");
static_assert(offsetof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot, CallFunc_GetSkeletalMesh_ReturnValue_1) == 0x000038, "Member 'BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot::CallFunc_GetSkeletalMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000040, "Member 'BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot, K2Node_DynamicCast_AsABP_Sling_Shot_1) == 0x000050, "Member 'BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot::K2Node_DynamicCast_AsABP_Sling_Shot_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_Weapon_SlingShot_C_ExecuteUbergraph_BP_Weapon_SlingShot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

