#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WoodBoxSet_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WoodBoxSet_01.BP_WoodBoxSet_01_C
// 0x0068 (0x02A0 - 0x0238)
class ABP_WoodBoxSet_01_C final : public AFieldObjectBasicBase
{
public:
	class UStaticMeshComponent*                   SM_Rope_00a1;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Rope_00a;                                       // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hempbag_02a2;                                   // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hempbag_02a1;                                   // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hempbag_01a2;                                   // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hempbag_01a1;                                   // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hempbag_01a;                                    // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hempbag_02a;                                    // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Woodbox_02a;                                    // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hempbag_03a2;                                   // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hempbag_03a1;                                   // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Hempbag_03a;                                    // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WoodBoxSet_01_C">();
	}
	static class ABP_WoodBoxSet_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WoodBoxSet_01_C>();
	}
};
static_assert(alignof(ABP_WoodBoxSet_01_C) == 0x000008, "Wrong alignment on ABP_WoodBoxSet_01_C");
static_assert(sizeof(ABP_WoodBoxSet_01_C) == 0x0002A0, "Wrong size on ABP_WoodBoxSet_01_C");
static_assert(offsetof(ABP_WoodBoxSet_01_C, SM_Rope_00a1) == 0x000238, "Member 'ABP_WoodBoxSet_01_C::SM_Rope_00a1' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSet_01_C, SM_Rope_00a) == 0x000240, "Member 'ABP_WoodBoxSet_01_C::SM_Rope_00a' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSet_01_C, SM_Hempbag_02a2) == 0x000248, "Member 'ABP_WoodBoxSet_01_C::SM_Hempbag_02a2' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSet_01_C, SM_Hempbag_02a1) == 0x000250, "Member 'ABP_WoodBoxSet_01_C::SM_Hempbag_02a1' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSet_01_C, SM_Hempbag_01a2) == 0x000258, "Member 'ABP_WoodBoxSet_01_C::SM_Hempbag_01a2' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSet_01_C, SM_Hempbag_01a1) == 0x000260, "Member 'ABP_WoodBoxSet_01_C::SM_Hempbag_01a1' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSet_01_C, SM_Hempbag_01a) == 0x000268, "Member 'ABP_WoodBoxSet_01_C::SM_Hempbag_01a' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSet_01_C, SM_Hempbag_02a) == 0x000270, "Member 'ABP_WoodBoxSet_01_C::SM_Hempbag_02a' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSet_01_C, SM_Woodbox_02a) == 0x000278, "Member 'ABP_WoodBoxSet_01_C::SM_Woodbox_02a' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSet_01_C, SM_Hempbag_03a2) == 0x000280, "Member 'ABP_WoodBoxSet_01_C::SM_Hempbag_03a2' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSet_01_C, SM_Hempbag_03a1) == 0x000288, "Member 'ABP_WoodBoxSet_01_C::SM_Hempbag_03a1' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSet_01_C, SM_Hempbag_03a) == 0x000290, "Member 'ABP_WoodBoxSet_01_C::SM_Hempbag_03a' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSet_01_C, DefaultSceneRoot) == 0x000298, "Member 'ABP_WoodBoxSet_01_C::DefaultSceneRoot' has a wrong offset!");

}

