#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponSet_02

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponSet_02.BP_WeaponSet_02_C
// 0x0058 (0x0290 - 0x0238)
class ABP_WeaponSet_02_C final : public AFieldObjectBasicBase
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent8;                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent7;                              // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent6;                              // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent5;                              // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent9;                              // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent3;                              // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent2;                              // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent1;                              // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent4;                              // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneRoot;                                         // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WeaponSet_02_C">();
	}
	static class ABP_WeaponSet_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponSet_02_C>();
	}
};
static_assert(alignof(ABP_WeaponSet_02_C) == 0x000008, "Wrong alignment on ABP_WeaponSet_02_C");
static_assert(sizeof(ABP_WeaponSet_02_C) == 0x000290, "Wrong size on ABP_WeaponSet_02_C");
static_assert(offsetof(ABP_WeaponSet_02_C, StaticMeshComponent8) == 0x000238, "Member 'ABP_WeaponSet_02_C::StaticMeshComponent8' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_02_C, StaticMeshComponent7) == 0x000240, "Member 'ABP_WeaponSet_02_C::StaticMeshComponent7' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_02_C, StaticMeshComponent6) == 0x000248, "Member 'ABP_WeaponSet_02_C::StaticMeshComponent6' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_02_C, StaticMeshComponent5) == 0x000250, "Member 'ABP_WeaponSet_02_C::StaticMeshComponent5' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_02_C, StaticMeshComponent9) == 0x000258, "Member 'ABP_WeaponSet_02_C::StaticMeshComponent9' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_02_C, StaticMeshComponent3) == 0x000260, "Member 'ABP_WeaponSet_02_C::StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_02_C, StaticMeshComponent2) == 0x000268, "Member 'ABP_WeaponSet_02_C::StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_02_C, StaticMeshComponent1) == 0x000270, "Member 'ABP_WeaponSet_02_C::StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_02_C, StaticMeshComponent0) == 0x000278, "Member 'ABP_WeaponSet_02_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_02_C, StaticMeshComponent4) == 0x000280, "Member 'ABP_WeaponSet_02_C::StaticMeshComponent4' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_02_C, SceneRoot) == 0x000288, "Member 'ABP_WeaponSet_02_C::SceneRoot' has a wrong offset!");

}

