#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WoodBoxSetScaleS_00a

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WoodBoxSetScaleS_00a.BP_WoodBoxSetScaleS_00a_C
// 0x0070 (0x02A8 - 0x0238)
class ABP_WoodBoxSetScaleS_00a_C final : public AFieldObjectBasicBase
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent2;                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneRoot;                                         // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent4;                              // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent5;                              // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BottleScaleS_04a;                                  // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BottleScaleS_02a;                                  // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BottleScaleS_03a;                                  // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HempbagScaleS_00a1;                                // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HempbagScaleS_03a;                                 // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent6;                              // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent1;                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HempbagScaleS_00a;                                 // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   NecklaceScaleS_01a;                                // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WoodBoxSetScaleS_00a_C">();
	}
	static class ABP_WoodBoxSetScaleS_00a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WoodBoxSetScaleS_00a_C>();
	}
};
static_assert(alignof(ABP_WoodBoxSetScaleS_00a_C) == 0x000008, "Wrong alignment on ABP_WoodBoxSetScaleS_00a_C");
static_assert(sizeof(ABP_WoodBoxSetScaleS_00a_C) == 0x0002A8, "Wrong size on ABP_WoodBoxSetScaleS_00a_C");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, StaticMeshComponent2) == 0x000238, "Member 'ABP_WoodBoxSetScaleS_00a_C::StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, SceneRoot) == 0x000240, "Member 'ABP_WoodBoxSetScaleS_00a_C::SceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, StaticMeshComponent4) == 0x000248, "Member 'ABP_WoodBoxSetScaleS_00a_C::StaticMeshComponent4' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, StaticMeshComponent5) == 0x000250, "Member 'ABP_WoodBoxSetScaleS_00a_C::StaticMeshComponent5' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, BottleScaleS_04a) == 0x000258, "Member 'ABP_WoodBoxSetScaleS_00a_C::BottleScaleS_04a' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, BottleScaleS_02a) == 0x000260, "Member 'ABP_WoodBoxSetScaleS_00a_C::BottleScaleS_02a' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, BottleScaleS_03a) == 0x000268, "Member 'ABP_WoodBoxSetScaleS_00a_C::BottleScaleS_03a' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, HempbagScaleS_00a1) == 0x000270, "Member 'ABP_WoodBoxSetScaleS_00a_C::HempbagScaleS_00a1' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, HempbagScaleS_03a) == 0x000278, "Member 'ABP_WoodBoxSetScaleS_00a_C::HempbagScaleS_03a' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, StaticMeshComponent6) == 0x000280, "Member 'ABP_WoodBoxSetScaleS_00a_C::StaticMeshComponent6' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, StaticMeshComponent0) == 0x000288, "Member 'ABP_WoodBoxSetScaleS_00a_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, StaticMeshComponent1) == 0x000290, "Member 'ABP_WoodBoxSetScaleS_00a_C::StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, HempbagScaleS_00a) == 0x000298, "Member 'ABP_WoodBoxSetScaleS_00a_C::HempbagScaleS_00a' has a wrong offset!");
static_assert(offsetof(ABP_WoodBoxSetScaleS_00a_C, NecklaceScaleS_01a) == 0x0002A0, "Member 'ABP_WoodBoxSetScaleS_00a_C::NecklaceScaleS_01a' has a wrong offset!");

}

