#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeaponSet_03

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeaponSet_03.BP_WeaponSet_03_C
// 0x0090 (0x02C8 - 0x0238)
class ABP_WeaponSet_03_C final : public AFieldObjectBasicBase
{
public:
	class USceneComponent*                        DefaultSceneRoot1;                                 // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent9;                              // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent12;                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent11;                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent10;                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot2;                                 // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneRoot;                                         // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent8;                              // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent7;                              // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent6;                              // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent5;                              // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent4;                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot2;                                       // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent3;                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent2;                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent1;                              // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot1;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WeaponSet_03_C">();
	}
	static class ABP_WeaponSet_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeaponSet_03_C>();
	}
};
static_assert(alignof(ABP_WeaponSet_03_C) == 0x000008, "Wrong alignment on ABP_WeaponSet_03_C");
static_assert(sizeof(ABP_WeaponSet_03_C) == 0x0002C8, "Wrong size on ABP_WeaponSet_03_C");
static_assert(offsetof(ABP_WeaponSet_03_C, DefaultSceneRoot1) == 0x000238, "Member 'ABP_WeaponSet_03_C::DefaultSceneRoot1' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, StaticMeshComponent9) == 0x000240, "Member 'ABP_WeaponSet_03_C::StaticMeshComponent9' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, StaticMeshComponent12) == 0x000248, "Member 'ABP_WeaponSet_03_C::StaticMeshComponent12' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, StaticMeshComponent11) == 0x000250, "Member 'ABP_WeaponSet_03_C::StaticMeshComponent11' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, StaticMeshComponent10) == 0x000258, "Member 'ABP_WeaponSet_03_C::StaticMeshComponent10' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, DefaultSceneRoot2) == 0x000260, "Member 'ABP_WeaponSet_03_C::DefaultSceneRoot2' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, SceneRoot) == 0x000268, "Member 'ABP_WeaponSet_03_C::SceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, StaticMeshComponent8) == 0x000270, "Member 'ABP_WeaponSet_03_C::StaticMeshComponent8' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, StaticMeshComponent7) == 0x000278, "Member 'ABP_WeaponSet_03_C::StaticMeshComponent7' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, StaticMeshComponent6) == 0x000280, "Member 'ABP_WeaponSet_03_C::StaticMeshComponent6' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, StaticMeshComponent5) == 0x000288, "Member 'ABP_WeaponSet_03_C::StaticMeshComponent5' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, StaticMeshComponent4) == 0x000290, "Member 'ABP_WeaponSet_03_C::StaticMeshComponent4' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, SharedRoot2) == 0x000298, "Member 'ABP_WeaponSet_03_C::SharedRoot2' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, StaticMeshComponent0) == 0x0002A0, "Member 'ABP_WeaponSet_03_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, StaticMeshComponent3) == 0x0002A8, "Member 'ABP_WeaponSet_03_C::StaticMeshComponent3' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, StaticMeshComponent2) == 0x0002B0, "Member 'ABP_WeaponSet_03_C::StaticMeshComponent2' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, StaticMeshComponent1) == 0x0002B8, "Member 'ABP_WeaponSet_03_C::StaticMeshComponent1' has a wrong offset!");
static_assert(offsetof(ABP_WeaponSet_03_C, SharedRoot1) == 0x0002C0, "Member 'ABP_WeaponSet_03_C::SharedRoot1' has a wrong offset!");

}

