#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_IsDropArtifact

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTD_IsDropArtifact.BTD_IsDropArtifact_C.PerformConditionCheckAI
// 0x0068 (0x0068 - 0x0000)
struct BTD_IsDropArtifact_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_FieldManager_C*                     CallFunc_GetFieldManager_FieldManager;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMonsterBase*                           K2Node_DynamicCast_AsMonster_Base;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMonster*                               K2Node_DynamicCast_AsMonster;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStealArtifactID_ReturnValue;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFieldObjectManager*                    CallFunc_GetFieldObjectManager_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AArtifactObjectBase*>            CallFunc_GetSpawnArtifactList_ReturnValue;         // 0x0050(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTD_IsDropArtifact_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_IsDropArtifact_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_IsDropArtifact_C_PerformConditionCheckAI) == 0x000068, "Wrong size on BTD_IsDropArtifact_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, CallFunc_GetFieldManager_FieldManager) == 0x000018, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::CallFunc_GetFieldManager_FieldManager' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, K2Node_DynamicCast_AsMonster_Base) == 0x000020, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::K2Node_DynamicCast_AsMonster_Base' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, K2Node_DynamicCast_AsMonster) == 0x000030, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::K2Node_DynamicCast_AsMonster' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, CallFunc_GetStealArtifactID_ReturnValue) == 0x00003C, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::CallFunc_GetStealArtifactID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, CallFunc_GetFieldObjectManager_ReturnValue) == 0x000040, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::CallFunc_GetFieldObjectManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000048, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, CallFunc_GetSpawnArtifactList_ReturnValue) == 0x000050, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::CallFunc_GetSpawnArtifactList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, CallFunc_Greater_IntInt_ReturnValue) == 0x000064, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_IsDropArtifact_C_PerformConditionCheckAI, CallFunc_BooleanOR_ReturnValue) == 0x000065, "Member 'BTD_IsDropArtifact_C_PerformConditionCheckAI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

