#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_SetTraceTarget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTS_SetTraceTarget.BTS_SetTraceTarget_C.ExecuteUbergraph_BTS_SetTraceTarget
// 0x0030 (0x0030 - 0x0000)
struct BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMonster*                               K2Node_DynamicCast_AsMonster;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPartyIndex_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGPACharacter*                          CallFunc_GetTraceTarget_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget) == 0x000008, "Wrong alignment on BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget");
static_assert(sizeof(BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget) == 0x000030, "Wrong size on BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget");
static_assert(offsetof(BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget, EntryPoint) == 0x000000, "Member 'BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget, K2Node_Event_OwnerController) == 0x000008, "Member 'BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget, K2Node_DynamicCast_AsMonster) == 0x000018, "Member 'BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget::K2Node_DynamicCast_AsMonster' has a wrong offset!");
static_assert(offsetof(BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget, CallFunc_GetPartyIndex_ReturnValue) == 0x000024, "Member 'BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget::CallFunc_GetPartyIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget, CallFunc_GetTraceTarget_ReturnValue) == 0x000028, "Member 'BTS_SetTraceTarget_C_ExecuteUbergraph_BTS_SetTraceTarget::CallFunc_GetTraceTarget_ReturnValue' has a wrong offset!");

// Function BTS_SetTraceTarget.BTS_SetTraceTarget_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_SetTraceTarget_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_SetTraceTarget_C_ReceiveActivationAI) == 0x000008, "Wrong alignment on BTS_SetTraceTarget_C_ReceiveActivationAI");
static_assert(sizeof(BTS_SetTraceTarget_C_ReceiveActivationAI) == 0x000010, "Wrong size on BTS_SetTraceTarget_C_ReceiveActivationAI");
static_assert(offsetof(BTS_SetTraceTarget_C_ReceiveActivationAI, OwnerController) == 0x000000, "Member 'BTS_SetTraceTarget_C_ReceiveActivationAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTS_SetTraceTarget_C_ReceiveActivationAI, ControlledPawn) == 0x000008, "Member 'BTS_SetTraceTarget_C_ReceiveActivationAI::ControlledPawn' has a wrong offset!");

}

