#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_NPCRundomPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BTTask_Base_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_NPCRundomPoint.BTTask_NPCRundomPoint_C
// 0x0028 (0x0138 - 0x0110)
class UBTTask_NPCRundomPoint_C final : public UBTTask_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BTTask_NPCRundomPoint_C;            // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                TargetLocation;                                    // 0x0118(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomIndex;                                       // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPCBase*                               NPCBase;                                           // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_NPCRundomPoint(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void IsTurnRightRotation(class ANPCBase* NPC, const struct FVector& nextpoint, bool* IsRight);
	void SetValidTurn(class ANPCBase* NPC);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTTask_NPCRundomPoint_C">();
	}
	static class UBTTask_NPCRundomPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_NPCRundomPoint_C>();
	}
};
static_assert(alignof(UBTTask_NPCRundomPoint_C) == 0x000008, "Wrong alignment on UBTTask_NPCRundomPoint_C");
static_assert(sizeof(UBTTask_NPCRundomPoint_C) == 0x000138, "Wrong size on UBTTask_NPCRundomPoint_C");
static_assert(offsetof(UBTTask_NPCRundomPoint_C, UberGraphFrame_BTTask_NPCRundomPoint_C) == 0x000110, "Member 'UBTTask_NPCRundomPoint_C::UberGraphFrame_BTTask_NPCRundomPoint_C' has a wrong offset!");
static_assert(offsetof(UBTTask_NPCRundomPoint_C, TargetLocation) == 0x000118, "Member 'UBTTask_NPCRundomPoint_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(UBTTask_NPCRundomPoint_C, RandomIndex) == 0x000124, "Member 'UBTTask_NPCRundomPoint_C::RandomIndex' has a wrong offset!");
static_assert(offsetof(UBTTask_NPCRundomPoint_C, Result) == 0x000128, "Member 'UBTTask_NPCRundomPoint_C::Result' has a wrong offset!");
static_assert(offsetof(UBTTask_NPCRundomPoint_C, Count) == 0x00012C, "Member 'UBTTask_NPCRundomPoint_C::Count' has a wrong offset!");
static_assert(offsetof(UBTTask_NPCRundomPoint_C, NPCBase) == 0x000130, "Member 'UBTTask_NPCRundomPoint_C::NPCBase' has a wrong offset!");

}

