#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_SetupActionLocation

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BTTask_SetupActionLocation.BTTask_SetupActionLocation_C.ExecuteUbergraph_BTTask_SetupActionLocation
// 0x0078 (0x0078 - 0x0000)
struct BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      K2Node_CustomEvent_QueryInstance;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               K2Node_CustomEvent_QueryStatus;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatOnBlackboard_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatOnBlackboard_ReturnValue_1;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatOnBlackboard_ReturnValue_2;       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnvQueryInstanceBlueprintWrapper*      CallFunc_RunEQSQuery_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckRemakeAttackLocationData_ReturnValue; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMonsterBase*                           K2Node_DynamicCast_AsMonster_Base;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGPACharacter*                          CallFunc_GetTargetOnBlackboard_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMonsterBattleAIBase*                   CallFunc_GetBattleAIBase_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation) == 0x000008, "Wrong alignment on BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation");
static_assert(sizeof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation) == 0x000078, "Wrong size on BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, EntryPoint) == 0x000000, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, K2Node_CustomEvent_QueryInstance) == 0x000008, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::K2Node_CustomEvent_QueryInstance' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, K2Node_CustomEvent_QueryStatus) == 0x000010, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::K2Node_CustomEvent_QueryStatus' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, CallFunc_GetFloatOnBlackboard_ReturnValue) == 0x000014, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::CallFunc_GetFloatOnBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, CallFunc_GetFloatOnBlackboard_ReturnValue_1) == 0x000018, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::CallFunc_GetFloatOnBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, CallFunc_GetFloatOnBlackboard_ReturnValue_2) == 0x00001C, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::CallFunc_GetFloatOnBlackboard_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, K2Node_Event_OwnerController) == 0x000030, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, K2Node_Event_ControlledPawn) == 0x000038, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, CallFunc_RunEQSQuery_ReturnValue) == 0x000040, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::CallFunc_RunEQSQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, CallFunc_CheckRemakeAttackLocationData_ReturnValue) == 0x000048, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::CallFunc_CheckRemakeAttackLocationData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, K2Node_DynamicCast_AsMonster_Base) == 0x000050, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::K2Node_DynamicCast_AsMonster_Base' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, CallFunc_GetTargetOnBlackboard_ReturnValue) == 0x000060, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::CallFunc_GetTargetOnBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, CallFunc_GetBattleAIBase_ReturnValue) == 0x000068, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::CallFunc_GetBattleAIBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BTTask_SetupActionLocation_C_ExecuteUbergraph_BTTask_SetupActionLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BTTask_SetupActionLocation.BTTask_SetupActionLocation_C.QueryFinish
// 0x0010 (0x0010 - 0x0000)
struct BTTask_SetupActionLocation_C_QueryFinish final
{
public:
	class UEnvQueryInstanceBlueprintWrapper*      QueryInstance;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               QueryStatus;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_SetupActionLocation_C_QueryFinish) == 0x000008, "Wrong alignment on BTTask_SetupActionLocation_C_QueryFinish");
static_assert(sizeof(BTTask_SetupActionLocation_C_QueryFinish) == 0x000010, "Wrong size on BTTask_SetupActionLocation_C_QueryFinish");
static_assert(offsetof(BTTask_SetupActionLocation_C_QueryFinish, QueryInstance) == 0x000000, "Member 'BTTask_SetupActionLocation_C_QueryFinish::QueryInstance' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_QueryFinish, QueryStatus) == 0x000008, "Member 'BTTask_SetupActionLocation_C_QueryFinish::QueryStatus' has a wrong offset!");

// Function BTTask_SetupActionLocation.BTTask_SetupActionLocation_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_SetupActionLocation_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_SetupActionLocation_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_SetupActionLocation_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_SetupActionLocation_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_SetupActionLocation_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_SetupActionLocation_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_SetupActionLocation_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_SetupActionLocation_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_SetupActionLocation_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

