#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_MakeAvoidTargetPoint

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTTask_MakeAvoidTargetPoint.BTTask_MakeAvoidTargetPoint_C.ExecuteUbergraph_BTTask_MakeAvoidTargetPoint
// 0x0090 (0x0090 - 0x0000)
struct BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      CallFunc_RunEQSQuery_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEnvQueryInstanceBlueprintWrapper*      K2Node_CustomEvent_QueryInstance;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               K2Node_CustomEvent_QueryStatus;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMonsterBase*                           K2Node_DynamicCast_AsMonster_Base;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_GetQueryResultsAsLocations_ResultLocations; // 0x0050(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_GetQueryResultsAsLocations_ReturnValue;   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatOnBlackboard_ReturnValue;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatOnBlackboard_ReturnValue_1;       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatOnBlackboard_ReturnValue_2;       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint) == 0x000008, "Wrong alignment on BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint");
static_assert(sizeof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint) == 0x000090, "Wrong size on BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, EntryPoint) == 0x000000, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, CallFunc_RunEQSQuery_ReturnValue) == 0x000008, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::CallFunc_RunEQSQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, K2Node_Event_OwnerController) == 0x000020, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, K2Node_Event_ControlledPawn) == 0x000028, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, K2Node_CustomEvent_QueryInstance) == 0x000030, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::K2Node_CustomEvent_QueryInstance' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, K2Node_CustomEvent_QueryStatus) == 0x000038, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::K2Node_CustomEvent_QueryStatus' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, K2Node_DynamicCast_AsMonster_Base) == 0x000040, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::K2Node_DynamicCast_AsMonster_Base' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, CallFunc_GetQueryResultsAsLocations_ResultLocations) == 0x000050, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::CallFunc_GetQueryResultsAsLocations_ResultLocations' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, CallFunc_GetQueryResultsAsLocations_ReturnValue) == 0x000060, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::CallFunc_GetQueryResultsAsLocations_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000064, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x000070, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, CallFunc_GetFloatOnBlackboard_ReturnValue) == 0x000074, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::CallFunc_GetFloatOnBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, CallFunc_GetFloatOnBlackboard_ReturnValue_1) == 0x000084, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::CallFunc_GetFloatOnBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint, CallFunc_GetFloatOnBlackboard_ReturnValue_2) == 0x000088, "Member 'BTTask_MakeAvoidTargetPoint_C_ExecuteUbergraph_BTTask_MakeAvoidTargetPoint::CallFunc_GetFloatOnBlackboard_ReturnValue_2' has a wrong offset!");

// Function BTTask_MakeAvoidTargetPoint.BTTask_MakeAvoidTargetPoint_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_MakeAvoidTargetPoint_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_MakeAvoidTargetPoint_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_MakeAvoidTargetPoint_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_MakeAvoidTargetPoint_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_MakeAvoidTargetPoint_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_MakeAvoidTargetPoint_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_MakeAvoidTargetPoint_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTTask_MakeAvoidTargetPoint.BTTask_MakeAvoidTargetPoint_C.QueryFinished
// 0x0010 (0x0010 - 0x0000)
struct BTTask_MakeAvoidTargetPoint_C_QueryFinished final
{
public:
	class UEnvQueryInstanceBlueprintWrapper*      QueryInstance;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               QueryStatus;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_MakeAvoidTargetPoint_C_QueryFinished) == 0x000008, "Wrong alignment on BTTask_MakeAvoidTargetPoint_C_QueryFinished");
static_assert(sizeof(BTTask_MakeAvoidTargetPoint_C_QueryFinished) == 0x000010, "Wrong size on BTTask_MakeAvoidTargetPoint_C_QueryFinished");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_QueryFinished, QueryInstance) == 0x000000, "Member 'BTTask_MakeAvoidTargetPoint_C_QueryFinished::QueryInstance' has a wrong offset!");
static_assert(offsetof(BTTask_MakeAvoidTargetPoint_C_QueryFinished, QueryStatus) == 0x000008, "Member 'BTTask_MakeAvoidTargetPoint_C_QueryFinished::QueryStatus' has a wrong offset!");

}

