#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_MakeAvoidTargetPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BTTask_Base_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_MakeAvoidTargetPoint.BTTask_MakeAvoidTargetPoint_C
// 0x0020 (0x0130 - 0x0110)
class UBTTask_MakeAvoidTargetPoint_C final : public UBTTask_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BTTask_MakeAvoidTargetPoint_C;      // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                TargetLocation;                                    // 0x0118(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomIndex;                                       // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMonsterBase*                           MonsterBase;                                       // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_MakeAvoidTargetPoint(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void QueryFinished(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTTask_MakeAvoidTargetPoint_C">();
	}
	static class UBTTask_MakeAvoidTargetPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_MakeAvoidTargetPoint_C>();
	}
};
static_assert(alignof(UBTTask_MakeAvoidTargetPoint_C) == 0x000008, "Wrong alignment on UBTTask_MakeAvoidTargetPoint_C");
static_assert(sizeof(UBTTask_MakeAvoidTargetPoint_C) == 0x000130, "Wrong size on UBTTask_MakeAvoidTargetPoint_C");
static_assert(offsetof(UBTTask_MakeAvoidTargetPoint_C, UberGraphFrame_BTTask_MakeAvoidTargetPoint_C) == 0x000110, "Member 'UBTTask_MakeAvoidTargetPoint_C::UberGraphFrame_BTTask_MakeAvoidTargetPoint_C' has a wrong offset!");
static_assert(offsetof(UBTTask_MakeAvoidTargetPoint_C, TargetLocation) == 0x000118, "Member 'UBTTask_MakeAvoidTargetPoint_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(UBTTask_MakeAvoidTargetPoint_C, RandomIndex) == 0x000124, "Member 'UBTTask_MakeAvoidTargetPoint_C::RandomIndex' has a wrong offset!");
static_assert(offsetof(UBTTask_MakeAvoidTargetPoint_C, MonsterBase) == 0x000128, "Member 'UBTTask_MakeAvoidTargetPoint_C::MonsterBase' has a wrong offset!");

}

