#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_NPCHideWork

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BTTask_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_NPCHideWork.BTTask_NPCHideWork_C
// 0x0020 (0x0130 - 0x0110)
class UBTTask_NPCHideWork_C final : public UBTTask_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BTTask_NPCHideWork_C;               // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         DistancetoPlayer;                                  // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPCBase*                               NPCBase;                                           // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         step;                                              // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_NPCHideWork(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTTask_NPCHideWork_C">();
	}
	static class UBTTask_NPCHideWork_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_NPCHideWork_C>();
	}
};
static_assert(alignof(UBTTask_NPCHideWork_C) == 0x000008, "Wrong alignment on UBTTask_NPCHideWork_C");
static_assert(sizeof(UBTTask_NPCHideWork_C) == 0x000130, "Wrong size on UBTTask_NPCHideWork_C");
static_assert(offsetof(UBTTask_NPCHideWork_C, UberGraphFrame_BTTask_NPCHideWork_C) == 0x000110, "Member 'UBTTask_NPCHideWork_C::UberGraphFrame_BTTask_NPCHideWork_C' has a wrong offset!");
static_assert(offsetof(UBTTask_NPCHideWork_C, DistancetoPlayer) == 0x000118, "Member 'UBTTask_NPCHideWork_C::DistancetoPlayer' has a wrong offset!");
static_assert(offsetof(UBTTask_NPCHideWork_C, NPCBase) == 0x000120, "Member 'UBTTask_NPCHideWork_C::NPCBase' has a wrong offset!");
static_assert(offsetof(UBTTask_NPCHideWork_C, step) == 0x000128, "Member 'UBTTask_NPCHideWork_C::step' has a wrong offset!");

}

