#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_TurnToLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTTask_TurnToLocation.BTTask_TurnToLocation_C.ExecuteUbergraph_BTTask_TurnToLocation
// 0x00D8 (0x00D8 - 0x0000)
struct BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMonsterBase*                           K2Node_DynamicCast_AsMonster_Base;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMonsterBase*                           K2Node_DynamicCast_AsMonster_Base_1;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatOnBlackboard_ReturnValue;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTurn_ReturnValue;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVectorOnBlackboard_ReturnValue;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_REase_ReturnValue;                        // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation) == 0x000008, "Wrong alignment on BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation");
static_assert(sizeof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation) == 0x0000D8, "Wrong size on BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, EntryPoint) == 0x000000, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000014, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, K2Node_Event_OwnerController) == 0x000018, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, K2Node_Event_ControlledPawn) == 0x000020, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, K2Node_Event_OwnerController_1) == 0x000028, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, K2Node_Event_ControlledPawn_1) == 0x000030, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, K2Node_DynamicCast_AsMonster_Base) == 0x000040, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::K2Node_DynamicCast_AsMonster_Base' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, K2Node_DynamicCast_AsMonster_Base_1) == 0x000050, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::K2Node_DynamicCast_AsMonster_Base_1' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_GetFloatOnBlackboard_ReturnValue) == 0x00005C, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_GetFloatOnBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_IsTurn_ReturnValue) == 0x000060, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_IsTurn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_BreakVector_X) == 0x000070, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_BreakVector_Y) == 0x000074, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_BreakVector_Z) == 0x000078, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00007C, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_FClamp_ReturnValue) == 0x000088, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00008C, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_GetVectorOnBlackboard_ReturnValue) == 0x000090, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_GetVectorOnBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_BreakVector_X_1) == 0x00009C, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_BreakVector_Y_1) == 0x0000A0, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_BreakVector_Z_1) == 0x0000A4, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_MakeVector_ReturnValue) == 0x0000A8, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000B4, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000C0, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_REase_ReturnValue) == 0x0000C4, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_REase_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation, CallFunc_K2_SetActorRotation_ReturnValue_1) == 0x0000D0, "Member 'BTTask_TurnToLocation_C_ExecuteUbergraph_BTTask_TurnToLocation::CallFunc_K2_SetActorRotation_ReturnValue_1' has a wrong offset!");

// Function BTTask_TurnToLocation.BTTask_TurnToLocation_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_TurnToLocation_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_TurnToLocation_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_TurnToLocation_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_TurnToLocation_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_TurnToLocation_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_TurnToLocation_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_TurnToLocation_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_TurnToLocation_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTTask_TurnToLocation.BTTask_TurnToLocation_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTTask_TurnToLocation_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_TurnToLocation_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTTask_TurnToLocation_C_ReceiveTickAI");
static_assert(sizeof(BTTask_TurnToLocation_C_ReceiveTickAI) == 0x000018, "Wrong size on BTTask_TurnToLocation_C_ReceiveTickAI");
static_assert(offsetof(BTTask_TurnToLocation_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTTask_TurnToLocation_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTTask_TurnToLocation_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_TurnToLocation_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTTask_TurnToLocation_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

}

