#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_NPCMoveTo

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "BTTask_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_NPCMoveTo.BTTask_NPCMoveTo_C
// 0x0040 (0x0150 - 0x0110)
class UBTTask_NPCMoveTo_C final : public UBTTask_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BTTask_NPCMoveTo_C;                 // 0x0110(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ANPCBase*                               NPCBase;                                           // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         prev_z;                                            // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 TargetLocation;                                    // 0x0128(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTTask_NPCMoveTo(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void OnSuccess_2ECBD2D846B1883797C14CB28BE6CBDF(EPathFollowingResult MovementResult);
	void OnFail_2ECBD2D846B1883797C14CB28BE6CBDF(EPathFollowingResult MovementResult);
	void StopMove();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTTask_NPCMoveTo_C">();
	}
	static class UBTTask_NPCMoveTo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_NPCMoveTo_C>();
	}
};
static_assert(alignof(UBTTask_NPCMoveTo_C) == 0x000008, "Wrong alignment on UBTTask_NPCMoveTo_C");
static_assert(sizeof(UBTTask_NPCMoveTo_C) == 0x000150, "Wrong size on UBTTask_NPCMoveTo_C");
static_assert(offsetof(UBTTask_NPCMoveTo_C, UberGraphFrame_BTTask_NPCMoveTo_C) == 0x000110, "Member 'UBTTask_NPCMoveTo_C::UberGraphFrame_BTTask_NPCMoveTo_C' has a wrong offset!");
static_assert(offsetof(UBTTask_NPCMoveTo_C, NPCBase) == 0x000118, "Member 'UBTTask_NPCMoveTo_C::NPCBase' has a wrong offset!");
static_assert(offsetof(UBTTask_NPCMoveTo_C, prev_z) == 0x000120, "Member 'UBTTask_NPCMoveTo_C::prev_z' has a wrong offset!");
static_assert(offsetof(UBTTask_NPCMoveTo_C, TargetLocation) == 0x000128, "Member 'UBTTask_NPCMoveTo_C::TargetLocation' has a wrong offset!");

}

