#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DarwinGame

#include "Basic.hpp"

#include "DarwinGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "UMG_structs.hpp"
#include "CriWareRuntime_structs.hpp"


namespace SDK::Params
{

// Function DarwinGame.DarwinUserWidget.AddInputEventFunc
// 0x0018 (0x0018 - 0x0000)
struct DarwinUserWidget_AddInputEventFunc final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPriority;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DarwinUserWidget_AddInputEventFunc) == 0x000008, "Wrong alignment on DarwinUserWidget_AddInputEventFunc");
static_assert(sizeof(DarwinUserWidget_AddInputEventFunc) == 0x000018, "Wrong size on DarwinUserWidget_AddInputEventFunc");
static_assert(offsetof(DarwinUserWidget_AddInputEventFunc, EventName) == 0x000000, "Member 'DarwinUserWidget_AddInputEventFunc::EventName' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_AddInputEventFunc, InPriority) == 0x000010, "Member 'DarwinUserWidget_AddInputEventFunc::InPriority' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Button_Down
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Button_Down final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Button_Down) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Button_Down");
static_assert(sizeof(DarwinUserWidget_Input_Button_Down) == 0x000001, "Wrong size on DarwinUserWidget_Input_Button_Down");
static_assert(offsetof(DarwinUserWidget_Input_Button_Down, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Button_Down::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Button_Left
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Button_Left final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Button_Left) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Button_Left");
static_assert(sizeof(DarwinUserWidget_Input_Button_Left) == 0x000001, "Wrong size on DarwinUserWidget_Input_Button_Left");
static_assert(offsetof(DarwinUserWidget_Input_Button_Left, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Button_Left::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Button_Right
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Button_Right final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Button_Right) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Button_Right");
static_assert(sizeof(DarwinUserWidget_Input_Button_Right) == 0x000001, "Wrong size on DarwinUserWidget_Input_Button_Right");
static_assert(offsetof(DarwinUserWidget_Input_Button_Right, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Button_Right::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Button_Up
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Button_Up final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Button_Up) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Button_Up");
static_assert(sizeof(DarwinUserWidget_Input_Button_Up) == 0x000001, "Wrong size on DarwinUserWidget_Input_Button_Up");
static_assert(offsetof(DarwinUserWidget_Input_Button_Up, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Button_Up::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Cancel
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Cancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Cancel) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Cancel");
static_assert(sizeof(DarwinUserWidget_Input_Cancel) == 0x000001, "Wrong size on DarwinUserWidget_Input_Cancel");
static_assert(offsetof(DarwinUserWidget_Input_Cancel, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Cancel::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Decide
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Decide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Decide) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Decide");
static_assert(sizeof(DarwinUserWidget_Input_Decide) == 0x000001, "Wrong size on DarwinUserWidget_Input_Decide");
static_assert(offsetof(DarwinUserWidget_Input_Decide, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Decide::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Down
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Down final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Down) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Down");
static_assert(sizeof(DarwinUserWidget_Input_Down) == 0x000001, "Wrong size on DarwinUserWidget_Input_Down");
static_assert(offsetof(DarwinUserWidget_Input_Down, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Down::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_L
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_L final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_L) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_L");
static_assert(sizeof(DarwinUserWidget_Input_L) == 0x000001, "Wrong size on DarwinUserWidget_Input_L");
static_assert(offsetof(DarwinUserWidget_Input_L, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_L::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Left
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Left final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Left) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Left");
static_assert(sizeof(DarwinUserWidget_Input_Left) == 0x000001, "Wrong size on DarwinUserWidget_Input_Left");
static_assert(offsetof(DarwinUserWidget_Input_Left, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Left::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Left_Analog_Down
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Left_Analog_Down final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Left_Analog_Down) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Left_Analog_Down");
static_assert(sizeof(DarwinUserWidget_Input_Left_Analog_Down) == 0x000001, "Wrong size on DarwinUserWidget_Input_Left_Analog_Down");
static_assert(offsetof(DarwinUserWidget_Input_Left_Analog_Down, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Left_Analog_Down::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Left_Analog_Left
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Left_Analog_Left final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Left_Analog_Left) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Left_Analog_Left");
static_assert(sizeof(DarwinUserWidget_Input_Left_Analog_Left) == 0x000001, "Wrong size on DarwinUserWidget_Input_Left_Analog_Left");
static_assert(offsetof(DarwinUserWidget_Input_Left_Analog_Left, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Left_Analog_Left::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Left_Analog_Right
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Left_Analog_Right final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Left_Analog_Right) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Left_Analog_Right");
static_assert(sizeof(DarwinUserWidget_Input_Left_Analog_Right) == 0x000001, "Wrong size on DarwinUserWidget_Input_Left_Analog_Right");
static_assert(offsetof(DarwinUserWidget_Input_Left_Analog_Right, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Left_Analog_Right::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Left_Analog_Up
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Left_Analog_Up final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Left_Analog_Up) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Left_Analog_Up");
static_assert(sizeof(DarwinUserWidget_Input_Left_Analog_Up) == 0x000001, "Wrong size on DarwinUserWidget_Input_Left_Analog_Up");
static_assert(offsetof(DarwinUserWidget_Input_Left_Analog_Up, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Left_Analog_Up::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Minus
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Minus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Minus) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Minus");
static_assert(sizeof(DarwinUserWidget_Input_Minus) == 0x000001, "Wrong size on DarwinUserWidget_Input_Minus");
static_assert(offsetof(DarwinUserWidget_Input_Minus, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Minus::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Mouse_Wheel_Down
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Mouse_Wheel_Down final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Mouse_Wheel_Down) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Mouse_Wheel_Down");
static_assert(sizeof(DarwinUserWidget_Input_Mouse_Wheel_Down) == 0x000001, "Wrong size on DarwinUserWidget_Input_Mouse_Wheel_Down");
static_assert(offsetof(DarwinUserWidget_Input_Mouse_Wheel_Down, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Mouse_Wheel_Down::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Mouse_Wheel_Up
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Mouse_Wheel_Up final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Mouse_Wheel_Up) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Mouse_Wheel_Up");
static_assert(sizeof(DarwinUserWidget_Input_Mouse_Wheel_Up) == 0x000001, "Wrong size on DarwinUserWidget_Input_Mouse_Wheel_Up");
static_assert(offsetof(DarwinUserWidget_Input_Mouse_Wheel_Up, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Mouse_Wheel_Up::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_PC_R
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_PC_R final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_PC_R) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_PC_R");
static_assert(sizeof(DarwinUserWidget_Input_PC_R) == 0x000001, "Wrong size on DarwinUserWidget_Input_PC_R");
static_assert(offsetof(DarwinUserWidget_Input_PC_R, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_PC_R::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_PC_T
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_PC_T final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_PC_T) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_PC_T");
static_assert(sizeof(DarwinUserWidget_Input_PC_T) == 0x000001, "Wrong size on DarwinUserWidget_Input_PC_T");
static_assert(offsetof(DarwinUserWidget_Input_PC_T, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_PC_T::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Plus
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Plus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Plus) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Plus");
static_assert(sizeof(DarwinUserWidget_Input_Plus) == 0x000001, "Wrong size on DarwinUserWidget_Input_Plus");
static_assert(offsetof(DarwinUserWidget_Input_Plus, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Plus::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_R
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_R final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_R) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_R");
static_assert(sizeof(DarwinUserWidget_Input_R) == 0x000001, "Wrong size on DarwinUserWidget_Input_R");
static_assert(offsetof(DarwinUserWidget_Input_R, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_R::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Right
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Right final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Right) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Right");
static_assert(sizeof(DarwinUserWidget_Input_Right) == 0x000001, "Wrong size on DarwinUserWidget_Input_Right");
static_assert(offsetof(DarwinUserWidget_Input_Right, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Right::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Right_Analog_Down
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Right_Analog_Down final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Right_Analog_Down) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Right_Analog_Down");
static_assert(sizeof(DarwinUserWidget_Input_Right_Analog_Down) == 0x000001, "Wrong size on DarwinUserWidget_Input_Right_Analog_Down");
static_assert(offsetof(DarwinUserWidget_Input_Right_Analog_Down, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Right_Analog_Down::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Right_Analog_Left
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Right_Analog_Left final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Right_Analog_Left) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Right_Analog_Left");
static_assert(sizeof(DarwinUserWidget_Input_Right_Analog_Left) == 0x000001, "Wrong size on DarwinUserWidget_Input_Right_Analog_Left");
static_assert(offsetof(DarwinUserWidget_Input_Right_Analog_Left, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Right_Analog_Left::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Right_Analog_Right
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Right_Analog_Right final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Right_Analog_Right) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Right_Analog_Right");
static_assert(sizeof(DarwinUserWidget_Input_Right_Analog_Right) == 0x000001, "Wrong size on DarwinUserWidget_Input_Right_Analog_Right");
static_assert(offsetof(DarwinUserWidget_Input_Right_Analog_Right, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Right_Analog_Right::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Right_Analog_Up
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Right_Analog_Up final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Right_Analog_Up) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Right_Analog_Up");
static_assert(sizeof(DarwinUserWidget_Input_Right_Analog_Up) == 0x000001, "Wrong size on DarwinUserWidget_Input_Right_Analog_Up");
static_assert(offsetof(DarwinUserWidget_Input_Right_Analog_Up, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Right_Analog_Up::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_RMB
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_RMB final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_RMB) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_RMB");
static_assert(sizeof(DarwinUserWidget_Input_RMB) == 0x000001, "Wrong size on DarwinUserWidget_Input_RMB");
static_assert(offsetof(DarwinUserWidget_Input_RMB, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_RMB::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Tab
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Tab final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Tab) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Tab");
static_assert(sizeof(DarwinUserWidget_Input_Tab) == 0x000001, "Wrong size on DarwinUserWidget_Input_Tab");
static_assert(offsetof(DarwinUserWidget_Input_Tab, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Tab::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Up
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Up final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Up) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Up");
static_assert(sizeof(DarwinUserWidget_Input_Up) == 0x000001, "Wrong size on DarwinUserWidget_Input_Up");
static_assert(offsetof(DarwinUserWidget_Input_Up, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Up::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_X
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_X final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_X) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_X");
static_assert(sizeof(DarwinUserWidget_Input_X) == 0x000001, "Wrong size on DarwinUserWidget_Input_X");
static_assert(offsetof(DarwinUserWidget_Input_X, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_X::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_Y
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_Y final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_Y) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_Y");
static_assert(sizeof(DarwinUserWidget_Input_Y) == 0x000001, "Wrong size on DarwinUserWidget_Input_Y");
static_assert(offsetof(DarwinUserWidget_Input_Y, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_Y::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_ZL
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_ZL final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_ZL) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_ZL");
static_assert(sizeof(DarwinUserWidget_Input_ZL) == 0x000001, "Wrong size on DarwinUserWidget_Input_ZL");
static_assert(offsetof(DarwinUserWidget_Input_ZL, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_ZL::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Input_ZR
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_Input_ZR final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Input_ZR) == 0x000001, "Wrong alignment on DarwinUserWidget_Input_ZR");
static_assert(sizeof(DarwinUserWidget_Input_ZR) == 0x000001, "Wrong size on DarwinUserWidget_Input_ZR");
static_assert(offsetof(DarwinUserWidget_Input_ZR, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_Input_ZR::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.InputEventFunc
// 0x00E0 (0x00E0 - 0x0000)
struct DarwinUserWidget_InputEventFunc final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          GamePaused;                                        // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyInput                              KeyInput;                                          // 0x0008(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FKeyInput                              OutKeyInput;                                       // 0x0018(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FEventReply                            Reply;                                             // 0x0028(0x00B8)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_InputEventFunc) == 0x000008, "Wrong alignment on DarwinUserWidget_InputEventFunc");
static_assert(sizeof(DarwinUserWidget_InputEventFunc) == 0x0000E0, "Wrong size on DarwinUserWidget_InputEventFunc");
static_assert(offsetof(DarwinUserWidget_InputEventFunc, DeltaTime) == 0x000000, "Member 'DarwinUserWidget_InputEventFunc::DeltaTime' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_InputEventFunc, GamePaused) == 0x000004, "Member 'DarwinUserWidget_InputEventFunc::GamePaused' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_InputEventFunc, KeyInput) == 0x000008, "Member 'DarwinUserWidget_InputEventFunc::KeyInput' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_InputEventFunc, OutKeyInput) == 0x000018, "Member 'DarwinUserWidget_InputEventFunc::OutKeyInput' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_InputEventFunc, Reply) == 0x000028, "Member 'DarwinUserWidget_InputEventFunc::Reply' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.InputName
// 0x0020 (0x0020 - 0x0000)
struct DarwinUserWidget_InputName final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class FName EnteredName)>      EnteredNameEvent;                                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_InputName) == 0x000004, "Wrong alignment on DarwinUserWidget_InputName");
static_assert(sizeof(DarwinUserWidget_InputName) == 0x000020, "Wrong size on DarwinUserWidget_InputName");
static_assert(offsetof(DarwinUserWidget_InputName, ID) == 0x000000, "Member 'DarwinUserWidget_InputName::ID' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_InputName, Name_0) == 0x000008, "Member 'DarwinUserWidget_InputName::Name_0' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_InputName, EnteredNameEvent) == 0x000010, "Member 'DarwinUserWidget_InputName::EnteredNameEvent' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.IsRepeatPressedWIthSetting
// 0x0018 (0x0018 - 0x0000)
struct DarwinUserWidget_IsRepeatPressedWIthSetting final
{
public:
	struct FKeyInput                              KeyInput;                                          // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	EAxisMappingType                              Type;                                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DarwinUserWidget_IsRepeatPressedWIthSetting) == 0x000008, "Wrong alignment on DarwinUserWidget_IsRepeatPressedWIthSetting");
static_assert(sizeof(DarwinUserWidget_IsRepeatPressedWIthSetting) == 0x000018, "Wrong size on DarwinUserWidget_IsRepeatPressedWIthSetting");
static_assert(offsetof(DarwinUserWidget_IsRepeatPressedWIthSetting, KeyInput) == 0x000000, "Member 'DarwinUserWidget_IsRepeatPressedWIthSetting::KeyInput' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_IsRepeatPressedWIthSetting, Type) == 0x000010, "Member 'DarwinUserWidget_IsRepeatPressedWIthSetting::Type' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_IsRepeatPressedWIthSetting, ReturnValue) == 0x000011, "Member 'DarwinUserWidget_IsRepeatPressedWIthSetting::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.IsUse
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_IsUse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_IsUse) == 0x000001, "Wrong alignment on DarwinUserWidget_IsUse");
static_assert(sizeof(DarwinUserWidget_IsUse) == 0x000001, "Wrong size on DarwinUserWidget_IsUse");
static_assert(offsetof(DarwinUserWidget_IsUse, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_IsUse::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.PlayOneShot
// 0x0004 (0x0004 - 0x0000)
struct DarwinUserWidget_PlayOneShot final
{
public:
	float                                         WaitTime;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_PlayOneShot) == 0x000004, "Wrong alignment on DarwinUserWidget_PlayOneShot");
static_assert(sizeof(DarwinUserWidget_PlayOneShot) == 0x000004, "Wrong size on DarwinUserWidget_PlayOneShot");
static_assert(offsetof(DarwinUserWidget_PlayOneShot, WaitTime) == 0x000000, "Member 'DarwinUserWidget_PlayOneShot::WaitTime' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.SetBrushFromButtonTexture
// 0x0010 (0x0010 - 0x0000)
struct DarwinUserWidget_SetBrushFromButtonTexture final
{
public:
	class UImage*                                 TargetImage;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAxisMappingType                              Button;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DarwinUserWidget_SetBrushFromButtonTexture) == 0x000008, "Wrong alignment on DarwinUserWidget_SetBrushFromButtonTexture");
static_assert(sizeof(DarwinUserWidget_SetBrushFromButtonTexture) == 0x000010, "Wrong size on DarwinUserWidget_SetBrushFromButtonTexture");
static_assert(offsetof(DarwinUserWidget_SetBrushFromButtonTexture, TargetImage) == 0x000000, "Member 'DarwinUserWidget_SetBrushFromButtonTexture::TargetImage' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_SetBrushFromButtonTexture, Button) == 0x000008, "Member 'DarwinUserWidget_SetBrushFromButtonTexture::Button' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.SetHandlingInput
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_SetHandlingInput final
{
public:
	bool                                          InIsHandlingInput;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_SetHandlingInput) == 0x000001, "Wrong alignment on DarwinUserWidget_SetHandlingInput");
static_assert(sizeof(DarwinUserWidget_SetHandlingInput) == 0x000001, "Wrong size on DarwinUserWidget_SetHandlingInput");
static_assert(offsetof(DarwinUserWidget_SetHandlingInput, InIsHandlingInput) == 0x000000, "Member 'DarwinUserWidget_SetHandlingInput::InIsHandlingInput' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.SetHideCount
// 0x0004 (0x0004 - 0x0000)
struct DarwinUserWidget_SetHideCount final
{
public:
	float                                         Count;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_SetHideCount) == 0x000004, "Wrong alignment on DarwinUserWidget_SetHideCount");
static_assert(sizeof(DarwinUserWidget_SetHideCount) == 0x000004, "Wrong size on DarwinUserWidget_SetHideCount");
static_assert(offsetof(DarwinUserWidget_SetHideCount, Count) == 0x000000, "Member 'DarwinUserWidget_SetHideCount::Count' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.SetProgressBar
// 0x0010 (0x0010 - 0x0000)
struct DarwinUserWidget_SetProgressBar final
{
public:
	class UProgressBar*                           Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Numerator;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Denominator;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_SetProgressBar) == 0x000008, "Wrong alignment on DarwinUserWidget_SetProgressBar");
static_assert(sizeof(DarwinUserWidget_SetProgressBar) == 0x000010, "Wrong size on DarwinUserWidget_SetProgressBar");
static_assert(offsetof(DarwinUserWidget_SetProgressBar, Target) == 0x000000, "Member 'DarwinUserWidget_SetProgressBar::Target' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_SetProgressBar, Numerator) == 0x000008, "Member 'DarwinUserWidget_SetProgressBar::Numerator' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_SetProgressBar, Denominator) == 0x00000C, "Member 'DarwinUserWidget_SetProgressBar::Denominator' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.Update
// 0x0004 (0x0004 - 0x0000)
struct DarwinUserWidget_Update final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_Update) == 0x000004, "Wrong alignment on DarwinUserWidget_Update");
static_assert(sizeof(DarwinUserWidget_Update) == 0x000004, "Wrong size on DarwinUserWidget_Update");
static_assert(offsetof(DarwinUserWidget_Update, DeltaTime) == 0x000000, "Member 'DarwinUserWidget_Update::DeltaTime' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.UpdateAtPostUpdateWork
// 0x0004 (0x0004 - 0x0000)
struct DarwinUserWidget_UpdateAtPostUpdateWork final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_UpdateAtPostUpdateWork) == 0x000004, "Wrong alignment on DarwinUserWidget_UpdateAtPostUpdateWork");
static_assert(sizeof(DarwinUserWidget_UpdateAtPostUpdateWork) == 0x000004, "Wrong size on DarwinUserWidget_UpdateAtPostUpdateWork");
static_assert(offsetof(DarwinUserWidget_UpdateAtPostUpdateWork, DeltaTime) == 0x000000, "Member 'DarwinUserWidget_UpdateAtPostUpdateWork::DeltaTime' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.CanAction
// 0x0002 (0x0002 - 0x0000)
struct DarwinUserWidget_CanAction final
{
public:
	EWidgetAction                                 Action;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_CanAction) == 0x000001, "Wrong alignment on DarwinUserWidget_CanAction");
static_assert(sizeof(DarwinUserWidget_CanAction) == 0x000002, "Wrong size on DarwinUserWidget_CanAction");
static_assert(offsetof(DarwinUserWidget_CanAction, Action) == 0x000000, "Member 'DarwinUserWidget_CanAction::Action' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_CanAction, ReturnValue) == 0x000001, "Member 'DarwinUserWidget_CanAction::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.GetDarwinUserWidgetFromName
// 0x0010 (0x0010 - 0x0000)
struct DarwinUserWidget_GetDarwinUserWidgetFromName final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDarwinUserWidget*                      ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_GetDarwinUserWidgetFromName) == 0x000008, "Wrong alignment on DarwinUserWidget_GetDarwinUserWidgetFromName");
static_assert(sizeof(DarwinUserWidget_GetDarwinUserWidgetFromName) == 0x000010, "Wrong size on DarwinUserWidget_GetDarwinUserWidgetFromName");
static_assert(offsetof(DarwinUserWidget_GetDarwinUserWidgetFromName, InName) == 0x000000, "Member 'DarwinUserWidget_GetDarwinUserWidgetFromName::InName' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_GetDarwinUserWidgetFromName, ReturnValue) == 0x000008, "Member 'DarwinUserWidget_GetDarwinUserWidgetFromName::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.GetImageFromName
// 0x0010 (0x0010 - 0x0000)
struct DarwinUserWidget_GetImageFromName final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImage*                                 ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_GetImageFromName) == 0x000008, "Wrong alignment on DarwinUserWidget_GetImageFromName");
static_assert(sizeof(DarwinUserWidget_GetImageFromName) == 0x000010, "Wrong size on DarwinUserWidget_GetImageFromName");
static_assert(offsetof(DarwinUserWidget_GetImageFromName, InName) == 0x000000, "Member 'DarwinUserWidget_GetImageFromName::InName' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_GetImageFromName, ReturnValue) == 0x000008, "Member 'DarwinUserWidget_GetImageFromName::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.GetOpenState
// 0x0001 (0x0001 - 0x0000)
struct DarwinUserWidget_GetOpenState final
{
public:
	EOpenState                                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_GetOpenState) == 0x000001, "Wrong alignment on DarwinUserWidget_GetOpenState");
static_assert(sizeof(DarwinUserWidget_GetOpenState) == 0x000001, "Wrong size on DarwinUserWidget_GetOpenState");
static_assert(offsetof(DarwinUserWidget_GetOpenState, ReturnValue) == 0x000000, "Member 'DarwinUserWidget_GetOpenState::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.GetTextBlockFromName
// 0x0010 (0x0010 - 0x0000)
struct DarwinUserWidget_GetTextBlockFromName final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                             ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_GetTextBlockFromName) == 0x000008, "Wrong alignment on DarwinUserWidget_GetTextBlockFromName");
static_assert(sizeof(DarwinUserWidget_GetTextBlockFromName) == 0x000010, "Wrong size on DarwinUserWidget_GetTextBlockFromName");
static_assert(offsetof(DarwinUserWidget_GetTextBlockFromName, InName) == 0x000000, "Member 'DarwinUserWidget_GetTextBlockFromName::InName' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_GetTextBlockFromName, ReturnValue) == 0x000008, "Member 'DarwinUserWidget_GetTextBlockFromName::ReturnValue' has a wrong offset!");

// Function DarwinGame.DarwinUserWidget.IsJustPressedWithLeftAnalog
// 0x0002 (0x0002 - 0x0000)
struct DarwinUserWidget_IsJustPressedWithLeftAnalog final
{
public:
	EAxisMappingType                              Key;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DarwinUserWidget_IsJustPressedWithLeftAnalog) == 0x000001, "Wrong alignment on DarwinUserWidget_IsJustPressedWithLeftAnalog");
static_assert(sizeof(DarwinUserWidget_IsJustPressedWithLeftAnalog) == 0x000002, "Wrong size on DarwinUserWidget_IsJustPressedWithLeftAnalog");
static_assert(offsetof(DarwinUserWidget_IsJustPressedWithLeftAnalog, Key) == 0x000000, "Member 'DarwinUserWidget_IsJustPressedWithLeftAnalog::Key' has a wrong offset!");
static_assert(offsetof(DarwinUserWidget_IsJustPressedWithLeftAnalog, ReturnValue) == 0x000001, "Member 'DarwinUserWidget_IsJustPressedWithLeftAnalog::ReturnValue' has a wrong offset!");

// Function DarwinGame.UI3DBase.SetAttachSocketName
// 0x0008 (0x0008 - 0x0000)
struct UI3DBase_SetAttachSocketName final
{
public:
	class FName                                   SocketName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UI3DBase_SetAttachSocketName) == 0x000004, "Wrong alignment on UI3DBase_SetAttachSocketName");
static_assert(sizeof(UI3DBase_SetAttachSocketName) == 0x000008, "Wrong size on UI3DBase_SetAttachSocketName");
static_assert(offsetof(UI3DBase_SetAttachSocketName, SocketName) == 0x000000, "Member 'UI3DBase_SetAttachSocketName::SocketName' has a wrong offset!");

// Function DarwinGame.UI3DBase.SetLocation
// 0x000C (0x000C - 0x0000)
struct UI3DBase_SetLocation final
{
public:
	struct FVector                                InLocaion;                                         // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UI3DBase_SetLocation) == 0x000004, "Wrong alignment on UI3DBase_SetLocation");
static_assert(sizeof(UI3DBase_SetLocation) == 0x00000C, "Wrong size on UI3DBase_SetLocation");
static_assert(offsetof(UI3DBase_SetLocation, InLocaion) == 0x000000, "Member 'UI3DBase_SetLocation::InLocaion' has a wrong offset!");

// Function DarwinGame.UI3DBase.SetTargetActor
// 0x0008 (0x0008 - 0x0000)
struct UI3DBase_SetTargetActor final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UI3DBase_SetTargetActor) == 0x000008, "Wrong alignment on UI3DBase_SetTargetActor");
static_assert(sizeof(UI3DBase_SetTargetActor) == 0x000008, "Wrong size on UI3DBase_SetTargetActor");
static_assert(offsetof(UI3DBase_SetTargetActor, InActor) == 0x000000, "Member 'UI3DBase_SetTargetActor::InActor' has a wrong offset!");

// Function DarwinGame.UIField_SkillChain_Word.SetChainData
// 0x0004 (0x0004 - 0x0000)
struct UIField_SkillChain_Word_SetChainData final
{
public:
	int32                                         DamageNum;                                         // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIField_SkillChain_Word_SetChainData) == 0x000004, "Wrong alignment on UIField_SkillChain_Word_SetChainData");
static_assert(sizeof(UIField_SkillChain_Word_SetChainData) == 0x000004, "Wrong size on UIField_SkillChain_Word_SetChainData");
static_assert(offsetof(UIField_SkillChain_Word_SetChainData, DamageNum) == 0x000000, "Member 'UIField_SkillChain_Word_SetChainData::DamageNum' has a wrong offset!");

// Function DarwinGame.UIMenuBase.AddItemList
// 0x0008 (0x0008 - 0x0000)
struct UIMenuBase_AddItemList final
{
public:
	class UUIMenuItemBase*                        Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIMenuBase_AddItemList) == 0x000008, "Wrong alignment on UIMenuBase_AddItemList");
static_assert(sizeof(UIMenuBase_AddItemList) == 0x000008, "Wrong size on UIMenuBase_AddItemList");
static_assert(offsetof(UIMenuBase_AddItemList, Item) == 0x000000, "Member 'UIMenuBase_AddItemList::Item' has a wrong offset!");

// Function DarwinGame.UIMenuBase.ChangeFocusWithNavigation
// 0x0003 (0x0003 - 0x0000)
struct UIMenuBase_ChangeFocusWithNavigation final
{
public:
	EAxisMappingType                              Key;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CheckSelfKeyInput;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIMenuBase_ChangeFocusWithNavigation) == 0x000001, "Wrong alignment on UIMenuBase_ChangeFocusWithNavigation");
static_assert(sizeof(UIMenuBase_ChangeFocusWithNavigation) == 0x000003, "Wrong size on UIMenuBase_ChangeFocusWithNavigation");
static_assert(offsetof(UIMenuBase_ChangeFocusWithNavigation, Key) == 0x000000, "Member 'UIMenuBase_ChangeFocusWithNavigation::Key' has a wrong offset!");
static_assert(offsetof(UIMenuBase_ChangeFocusWithNavigation, CheckSelfKeyInput) == 0x000001, "Member 'UIMenuBase_ChangeFocusWithNavigation::CheckSelfKeyInput' has a wrong offset!");
static_assert(offsetof(UIMenuBase_ChangeFocusWithNavigation, ReturnValue) == 0x000002, "Member 'UIMenuBase_ChangeFocusWithNavigation::ReturnValue' has a wrong offset!");

// Function DarwinGame.UIMenuBase.CheckSelectableFromKeyInput
// 0x0018 (0x0018 - 0x0000)
struct UIMenuBase_CheckSelectableFromKeyInput final
{
public:
	EAxisMappingType                              Key;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIMenuBase*                            Menu;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIMenuBase_CheckSelectableFromKeyInput) == 0x000008, "Wrong alignment on UIMenuBase_CheckSelectableFromKeyInput");
static_assert(sizeof(UIMenuBase_CheckSelectableFromKeyInput) == 0x000018, "Wrong size on UIMenuBase_CheckSelectableFromKeyInput");
static_assert(offsetof(UIMenuBase_CheckSelectableFromKeyInput, Key) == 0x000000, "Member 'UIMenuBase_CheckSelectableFromKeyInput::Key' has a wrong offset!");
static_assert(offsetof(UIMenuBase_CheckSelectableFromKeyInput, Menu) == 0x000008, "Member 'UIMenuBase_CheckSelectableFromKeyInput::Menu' has a wrong offset!");
static_assert(offsetof(UIMenuBase_CheckSelectableFromKeyInput, ReturnValue) == 0x000010, "Member 'UIMenuBase_CheckSelectableFromKeyInput::ReturnValue' has a wrong offset!");

// Function DarwinGame.UIMenuBase.GetItemList
// 0x0010 (0x0010 - 0x0000)
struct UIMenuBase_GetItemList final
{
public:
	TArray<class UUIMenuItemBase*>                ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIMenuBase_GetItemList) == 0x000008, "Wrong alignment on UIMenuBase_GetItemList");
static_assert(sizeof(UIMenuBase_GetItemList) == 0x000010, "Wrong size on UIMenuBase_GetItemList");
static_assert(offsetof(UIMenuBase_GetItemList, ReturnValue) == 0x000000, "Member 'UIMenuBase_GetItemList::ReturnValue' has a wrong offset!");

// Function DarwinGame.UIMenuBase.OnTriedToMoveBeyondTheEdgeFunc
// 0x0001 (0x0001 - 0x0000)
struct UIMenuBase_OnTriedToMoveBeyondTheEdgeFunc final
{
public:
	EAxisMappingType                              Key;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIMenuBase_OnTriedToMoveBeyondTheEdgeFunc) == 0x000001, "Wrong alignment on UIMenuBase_OnTriedToMoveBeyondTheEdgeFunc");
static_assert(sizeof(UIMenuBase_OnTriedToMoveBeyondTheEdgeFunc) == 0x000001, "Wrong size on UIMenuBase_OnTriedToMoveBeyondTheEdgeFunc");
static_assert(offsetof(UIMenuBase_OnTriedToMoveBeyondTheEdgeFunc, Key) == 0x000000, "Member 'UIMenuBase_OnTriedToMoveBeyondTheEdgeFunc::Key' has a wrong offset!");

// Function DarwinGame.UIMenuBase.RemoveIndexItemList
// 0x0004 (0x0004 - 0x0000)
struct UIMenuBase_RemoveIndexItemList final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIMenuBase_RemoveIndexItemList) == 0x000004, "Wrong alignment on UIMenuBase_RemoveIndexItemList");
static_assert(sizeof(UIMenuBase_RemoveIndexItemList) == 0x000004, "Wrong size on UIMenuBase_RemoveIndexItemList");
static_assert(offsetof(UIMenuBase_RemoveIndexItemList, Index_0) == 0x000000, "Member 'UIMenuBase_RemoveIndexItemList::Index_0' has a wrong offset!");

// Function DarwinGame.UIMenuBase.SetFocusItem
// 0x0008 (0x0008 - 0x0000)
struct UIMenuBase_SetFocusItem final
{
public:
	class UUIMenuItemBase*                        Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIMenuBase_SetFocusItem) == 0x000008, "Wrong alignment on UIMenuBase_SetFocusItem");
static_assert(sizeof(UIMenuBase_SetFocusItem) == 0x000008, "Wrong size on UIMenuBase_SetFocusItem");
static_assert(offsetof(UIMenuBase_SetFocusItem, Item) == 0x000000, "Member 'UIMenuBase_SetFocusItem::Item' has a wrong offset!");

// Function DarwinGame.UIMenuBase.SetFocusItemFromIndex
// 0x0004 (0x0004 - 0x0000)
struct UIMenuBase_SetFocusItemFromIndex final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIMenuBase_SetFocusItemFromIndex) == 0x000004, "Wrong alignment on UIMenuBase_SetFocusItemFromIndex");
static_assert(sizeof(UIMenuBase_SetFocusItemFromIndex) == 0x000004, "Wrong size on UIMenuBase_SetFocusItemFromIndex");
static_assert(offsetof(UIMenuBase_SetFocusItemFromIndex, ItemIndex) == 0x000000, "Member 'UIMenuBase_SetFocusItemFromIndex::ItemIndex' has a wrong offset!");

// Function DarwinGame.UIMenuBase.SetItemList
// 0x0010 (0x0010 - 0x0000)
struct UIMenuBase_SetItemList final
{
public:
	TArray<class UUIMenuItemBase*>                NewParam;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIMenuBase_SetItemList) == 0x000008, "Wrong alignment on UIMenuBase_SetItemList");
static_assert(sizeof(UIMenuBase_SetItemList) == 0x000010, "Wrong size on UIMenuBase_SetItemList");
static_assert(offsetof(UIMenuBase_SetItemList, NewParam) == 0x000000, "Member 'UIMenuBase_SetItemList::NewParam' has a wrong offset!");

// Function DarwinGame.UIMenuBase.SetNavigationLinear
// 0x0018 (0x0018 - 0x0000)
struct UIMenuBase_SetNavigationLinear final
{
public:
	TArray<class UUIMenuItemBase*>                NewParam;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Loop;                                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAxisMappingType                              PrevKey;                                           // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAxisMappingType                              NextKey;                                           // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UIMenuBase_SetNavigationLinear) == 0x000008, "Wrong alignment on UIMenuBase_SetNavigationLinear");
static_assert(sizeof(UIMenuBase_SetNavigationLinear) == 0x000018, "Wrong size on UIMenuBase_SetNavigationLinear");
static_assert(offsetof(UIMenuBase_SetNavigationLinear, NewParam) == 0x000000, "Member 'UIMenuBase_SetNavigationLinear::NewParam' has a wrong offset!");
static_assert(offsetof(UIMenuBase_SetNavigationLinear, Loop) == 0x000010, "Member 'UIMenuBase_SetNavigationLinear::Loop' has a wrong offset!");
