#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DarwinGame

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "DarwinGame_structs.hpp"
#include "LevelSequence_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Foliage_classes.hpp"
#include "Slate_structs.hpp"
#include "CriWareRuntime_structs.hpp"


namespace SDK
{

// Class DarwinGame.DarwinUserWidget
// 0x0258 (0x0490 - 0x0238)
class UDarwinUserWidget : public UUserWidget
{
public:
	uint8                                         Pad_238[0x88];                                     // 0x0238(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	EOpenState                                    OpenState;                                         // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EWidgetDefaultAnimation, class FName>    DefaultAnimationNames;                             // 0x02C8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected)
	int32                                         DefaultZOrder;                                     // 0x0318(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   DefaultZOrderID;                                   // 0x031C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsHandlingInput;                                  // 0x0324(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsUI3D;                                           // 0x0325(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsUse3DComponent;                                 // 0x0326(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_327[0x1];                                      // 0x0327(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalZOrder;                                       // 0x0328(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         HideCount;                                         // 0x032C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         KeyRepeatIntervalFirst;                            // 0x0330(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         KeyRepeatIntervalAfterSecond;                      // 0x0334(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_338[0x158];                                    // 0x0338(0x0158)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddInputEventFunc(const class FString& EventName, int32 InPriority);
	void BeginUse();
	void Close();
	void CloseAnimationEnd();
	void CloseIfNotWillClose();
	void CloseImmediate();
	void EndUse();
	bool Input_Button_Down();
	bool Input_Button_Left();
	bool Input_Button_Right();
	bool Input_Button_Up();
	bool Input_Cancel();
	bool Input_Decide();
	bool Input_Down();
	bool Input_L();
	bool Input_Left();
	bool Input_Left_Analog_Down();
	bool Input_Left_Analog_Left();
	bool Input_Left_Analog_Right();
	bool Input_Left_Analog_Up();
	bool Input_Minus();
	bool Input_Mouse_Wheel_Down();
	bool Input_Mouse_Wheel_Up();
	bool Input_PC_R();
	bool Input_PC_T();
	bool Input_Plus();
	bool Input_R();
	bool Input_Right();
	bool Input_Right_Analog_Down();
	bool Input_Right_Analog_Left();
	bool Input_Right_Analog_Right();
	bool Input_Right_Analog_Up();
	bool Input_RMB();
	bool Input_Tab();
	bool Input_Up();
	bool Input_X();
	bool Input_Y();
	bool Input_ZL();
	bool Input_ZR();
	void InputEventFunc(float DeltaTime, bool GamePaused, const struct FKeyInput& KeyInput, struct FKeyInput* OutKeyInput, struct FEventReply* Reply);
	void InputName(class FName ID, class FName Name_0, const TDelegate<void(class FName EnteredName)>& EnteredNameEvent);
	bool IsRepeatPressedWIthSetting(const struct FKeyInput& KeyInput, EAxisMappingType Type);
	bool IsUse();
	void OnCloseAnimationEnd();
	void OnOpenAnimationEnd();
	void open();
	void OpenAnimationEnd();
	void OpenIfNotWillOpen();
	void OpenImmediate();
	void PlayOneShot(float WaitTime);
	void PlayOneShotAnimation();
	void RemoveRegisteredInputEvent();
	void Resume();
	void ResumeAnimationEnd();
	void ResumeImmediate();
	void SetBrushFromButtonTexture(class UImage* TargetImage, EAxisMappingType Button);
	void SetHandlingInput(bool InIsHandlingInput);
	void SetHideCount(float Count);
	void SetProgressBar(class UProgressBar* Target, int32 Numerator, int32 Denominator);
	void Suspend();
	void SuspendAnimationEnd();
	void SuspendImmediate();
	void Update(float DeltaTime);
	void UpdateAtPostUpdateWork(float DeltaTime);

	bool CanAction(EWidgetAction Action) const;
	class UDarwinUserWidget* GetDarwinUserWidgetFromName(class FName InName) const;
	class UImage* GetImageFromName(class FName InName) const;
	EOpenState GetOpenState() const;
	class UTextBlock* GetTextBlockFromName(class FName InName) const;
	bool IsJustPressedWithLeftAnalog(EAxisMappingType Key) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DarwinUserWidget">();
	}
	static class UDarwinUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDarwinUserWidget>();
	}
};
static_assert(alignof(UDarwinUserWidget) == 0x000008, "Wrong alignment on UDarwinUserWidget");
static_assert(sizeof(UDarwinUserWidget) == 0x000490, "Wrong size on UDarwinUserWidget");
static_assert(offsetof(UDarwinUserWidget, OpenState) == 0x0002C0, "Member 'UDarwinUserWidget::OpenState' has a wrong offset!");
static_assert(offsetof(UDarwinUserWidget, DefaultAnimationNames) == 0x0002C8, "Member 'UDarwinUserWidget::DefaultAnimationNames' has a wrong offset!");
static_assert(offsetof(UDarwinUserWidget, DefaultZOrder) == 0x000318, "Member 'UDarwinUserWidget::DefaultZOrder' has a wrong offset!");
static_assert(offsetof(UDarwinUserWidget, DefaultZOrderID) == 0x00031C, "Member 'UDarwinUserWidget::DefaultZOrderID' has a wrong offset!");
static_assert(offsetof(UDarwinUserWidget, bIsHandlingInput) == 0x000324, "Member 'UDarwinUserWidget::bIsHandlingInput' has a wrong offset!");
static_assert(offsetof(UDarwinUserWidget, bIsUI3D) == 0x000325, "Member 'UDarwinUserWidget::bIsUI3D' has a wrong offset!");
static_assert(offsetof(UDarwinUserWidget, bIsUse3DComponent) == 0x000326, "Member 'UDarwinUserWidget::bIsUse3DComponent' has a wrong offset!");
static_assert(offsetof(UDarwinUserWidget, LocalZOrder) == 0x000328, "Member 'UDarwinUserWidget::LocalZOrder' has a wrong offset!");
static_assert(offsetof(UDarwinUserWidget, HideCount) == 0x00032C, "Member 'UDarwinUserWidget::HideCount' has a wrong offset!");
static_assert(offsetof(UDarwinUserWidget, KeyRepeatIntervalFirst) == 0x000330, "Member 'UDarwinUserWidget::KeyRepeatIntervalFirst' has a wrong offset!");
static_assert(offsetof(UDarwinUserWidget, KeyRepeatIntervalAfterSecond) == 0x000334, "Member 'UDarwinUserWidget::KeyRepeatIntervalAfterSecond' has a wrong offset!");

// Class DarwinGame.UI3DBase
// 0x0120 (0x05B0 - 0x0490)
#pragma pack(push, 0x1)
class alignas(0x10) UUI3DBase : public UDarwinUserWidget
{
public:
	struct FVector                                DefaultOffsetPosition;                             // 0x0490(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsUseHideByObject;                                 // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETraceTypeQuery                               HideByTraceType;                                   // 0x04A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4AA[0x2];                                      // 0x04AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ViewPortPos;                                       // 0x04AC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachSocketName;                                  // 0x04B4(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DistanceOfInvisible;                               // 0x04BC(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsInScreenTop;                                    // 0x04C0(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultScreenTopPos;                               // 0x04C4(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsUpdateAnimIfOutWindow;                          // 0x04C8(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C9[0x3];                                      // 0x04C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DistanceOfMinSmall;                                // 0x04CC(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DistanceOfStartSmall;                              // 0x04D0(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxSmallScale;                                     // 0x04D4(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MinSmallScale;                                     // 0x04D8(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4DC[0xCC];                                     // 0x04DC(0x00CC)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAttachSocketName(class FName SocketName);
	void SetLocation(const struct FVector& InLocaion);
	void SetTargetActor(class AActor* InActor);
	void Update3DTransform();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UI3DBase">();
	}
	static class UUI3DBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI3DBase>();
	}
};
#pragma pack(pop)
static_assert(alignof(UUI3DBase) == 0x000010, "Wrong alignment on UUI3DBase");
static_assert(sizeof(UUI3DBase) == 0x0005B0, "Wrong size on UUI3DBase");
static_assert(offsetof(UUI3DBase, DefaultOffsetPosition) == 0x000490, "Member 'UUI3DBase::DefaultOffsetPosition' has a wrong offset!");
static_assert(offsetof(UUI3DBase, TargetActor) == 0x0004A0, "Member 'UUI3DBase::TargetActor' has a wrong offset!");
static_assert(offsetof(UUI3DBase, IsUseHideByObject) == 0x0004A8, "Member 'UUI3DBase::IsUseHideByObject' has a wrong offset!");
static_assert(offsetof(UUI3DBase, HideByTraceType) == 0x0004A9, "Member 'UUI3DBase::HideByTraceType' has a wrong offset!");
static_assert(offsetof(UUI3DBase, ViewPortPos) == 0x0004AC, "Member 'UUI3DBase::ViewPortPos' has a wrong offset!");
static_assert(offsetof(UUI3DBase, AttachSocketName) == 0x0004B4, "Member 'UUI3DBase::AttachSocketName' has a wrong offset!");
static_assert(offsetof(UUI3DBase, DistanceOfInvisible) == 0x0004BC, "Member 'UUI3DBase::DistanceOfInvisible' has a wrong offset!");
static_assert(offsetof(UUI3DBase, bIsInScreenTop) == 0x0004C0, "Member 'UUI3DBase::bIsInScreenTop' has a wrong offset!");
static_assert(offsetof(UUI3DBase, DefaultScreenTopPos) == 0x0004C4, "Member 'UUI3DBase::DefaultScreenTopPos' has a wrong offset!");
static_assert(offsetof(UUI3DBase, bIsUpdateAnimIfOutWindow) == 0x0004C8, "Member 'UUI3DBase::bIsUpdateAnimIfOutWindow' has a wrong offset!");
static_assert(offsetof(UUI3DBase, DistanceOfMinSmall) == 0x0004CC, "Member 'UUI3DBase::DistanceOfMinSmall' has a wrong offset!");
static_assert(offsetof(UUI3DBase, DistanceOfStartSmall) == 0x0004D0, "Member 'UUI3DBase::DistanceOfStartSmall' has a wrong offset!");
static_assert(offsetof(UUI3DBase, MaxSmallScale) == 0x0004D4, "Member 'UUI3DBase::MaxSmallScale' has a wrong offset!");
static_assert(offsetof(UUI3DBase, MinSmallScale) == 0x0004D8, "Member 'UUI3DBase::MinSmallScale' has a wrong offset!");

// Class DarwinGame.UIField_SkillChain_Word
// 0x0010 (0x05C0 - 0x05B0)
class UUIField_SkillChain_Word : public UUI3DBase
{
public:
	class UUISkillPop_00*                         DamagePop;                                         // 0x05A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5B0[0x10];                                     // 0x05B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetChainData(const int32& DamageNum);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIField_SkillChain_Word">();
	}
	static class UUIField_SkillChain_Word* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIField_SkillChain_Word>();
	}
};
static_assert(alignof(UUIField_SkillChain_Word) == 0x000010, "Wrong alignment on UUIField_SkillChain_Word");
static_assert(sizeof(UUIField_SkillChain_Word) == 0x0005C0, "Wrong size on UUIField_SkillChain_Word");
static_assert(offsetof(UUIField_SkillChain_Word, DamagePop) == 0x0005A8, "Member 'UUIField_SkillChain_Word::DamagePop' has a wrong offset!");

// Class DarwinGame.SaveGameBase
// 0x0000 (0x0030 - 0x0030)
class USaveGameBase : public USaveGame
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SaveGameBase">();
	}
	static class USaveGameBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveGameBase>();
	}
};
static_assert(alignof(USaveGameBase) == 0x000008, "Wrong alignment on USaveGameBase");
static_assert(sizeof(USaveGameBase) == 0x000030, "Wrong size on USaveGameBase");

// Class DarwinGame.AnimNotify_Visualization
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_Visualization final : public UAnimNotify
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_Visualization">();
	}
	static class UAnimNotify_Visualization* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_Visualization>();
	}
};
static_assert(alignof(UAnimNotify_Visualization) == 0x000008, "Wrong alignment on UAnimNotify_Visualization");
static_assert(sizeof(UAnimNotify_Visualization) == 0x000040, "Wrong size on UAnimNotify_Visualization");

// Class DarwinGame.AtomCueSheetManager
// 0x0040 (0x0070 - 0x0030)
class UAtomCueSheetManager : public UObject
{
public:
	class UDataTable*                             CueSheetList;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             BaseEnvCueSheetList;                               // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             VoiceJaCueSheetList;                               // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             VoiceEnCueSheetList;                               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             DebugCueSheetList;                                 // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDataTable*                             SheetNameListEnvSound;                             // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAtomCueSheet*                     BaseEnvCueSheet;                                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AtomCueSheetManager">();
	}
	static class UAtomCueSheetManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAtomCueSheetManager>();
	}
};
static_assert(alignof(UAtomCueSheetManager) == 0x000008, "Wrong alignment on UAtomCueSheetManager");
static_assert(sizeof(UAtomCueSheetManager) == 0x000070, "Wrong size on UAtomCueSheetManager");
static_assert(offsetof(UAtomCueSheetManager, CueSheetList) == 0x000030, "Member 'UAtomCueSheetManager::CueSheetList' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetManager, BaseEnvCueSheetList) == 0x000038, "Member 'UAtomCueSheetManager::BaseEnvCueSheetList' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetManager, VoiceJaCueSheetList) == 0x000040, "Member 'UAtomCueSheetManager::VoiceJaCueSheetList' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetManager, VoiceEnCueSheetList) == 0x000048, "Member 'UAtomCueSheetManager::VoiceEnCueSheetList' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetManager, DebugCueSheetList) == 0x000050, "Member 'UAtomCueSheetManager::DebugCueSheetList' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetManager, SheetNameListEnvSound) == 0x000058, "Member 'UAtomCueSheetManager::SheetNameListEnvSound' has a wrong offset!");
static_assert(offsetof(UAtomCueSheetManager, BaseEnvCueSheet) == 0x000068, "Member 'UAtomCueSheetManager::BaseEnvCueSheet' has a wrong offset!");

// Class DarwinGame.AnimNotifyState_MonsterControllCamera
// 0x0008 (0x0040 - 0x0038)
class UAnimNotifyState_MonsterControllCamera final : public UAnimNotifyState
{
public:
	EMonsterCameraControllType                    mControllType;                                     // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_MonsterControllCamera">();
	}
	static class UAnimNotifyState_MonsterControllCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_MonsterControllCamera>();
	}
};
static_assert(alignof(UAnimNotifyState_MonsterControllCamera) == 0x000008, "Wrong alignment on UAnimNotifyState_MonsterControllCamera");
static_assert(sizeof(UAnimNotifyState_MonsterControllCamera) == 0x000040, "Wrong size on UAnimNotifyState_MonsterControllCamera");
static_assert(offsetof(UAnimNotifyState_MonsterControllCamera, mControllType) == 0x000038, "Member 'UAnimNotifyState_MonsterControllCamera::mControllType' has a wrong offset!");

// Class DarwinGame.UIMenuBase
// 0x0030 (0x04C0 - 0x0490)
class UUIMenuBase : public UDarwinUserWidget
{
public:
	TMulticastInlineDelegate<void()>              OnChangeFocusStatus;                               // 0x0490(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A0[0x18];                                     // 0x04A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsEnableInputEventAtOpen;                         // 0x04B8(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bIsItemListUpdate;                                 // 0x04B9(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4BA[0x6];                                      // 0x04BA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddItemList(class UUIMenuItemBase* Item);
	bool ChangeFocusWithNavigation(EAxisMappingType Key, bool CheckSelfKeyInput);
	bool CheckSelectableFromKeyInput(EAxisMappingType Key, class UUIMenuBase* Menu);
	void ClearItemList();
	void CloseItemList();
	TArray<class UUIMenuItemBase*> GetItemList();
	void OnTriedToMoveBeyondTheEdgeFunc(EAxisMappingType Key);
	void OutFocusCurrentFocusItem();
	void RemoveIndexItemList(int32 Index_0);
	void SetFocusItem(class UUIMenuItemBase* Item);
	void SetFocusItemFromIndex(int32 ItemIndex);
	void SetItemList(const TArray<class UUIMenuItemBase*>& NewParam);
	void SetNavigationLinear(const TArray<class UUIMenuItemBase*>& NewParam, bool Loop, EAxisMappingType PrevKey, EAxisMappingType NextKey);
	void SetNavigationLinearLR(const TArray<class UUIMenuItemBase*>& NewParam, bool Loop);
	void SetNavigationLinearUpDown(const TArray<class UUIMenuItemBase*>& NewParam, bool Loop);

	class UUIMenuItemBase* GetFocusItem() const;
	int32 GetIndexAtFocusItem() const;
	bool HasFocusItem() const;
	int32 ItemListLastIndex() const;
	int32 ItemListLength() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIMenuBase">();
	}
	static class UUIMenuBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIMenuBase>();
	}
};
static_assert(alignof(UUIMenuBase) == 0x000008, "Wrong alignment on UUIMenuBase");
static_assert(sizeof(UUIMenuBase) == 0x0004C0, "Wrong size on UUIMenuBase");
static_assert(offsetof(UUIMenuBase, OnChangeFocusStatus) == 0x000490, "Member 'UUIMenuBase::OnChangeFocusStatus' has a wrong offset!");
static_assert(offsetof(UUIMenuBase, bIsEnableInputEventAtOpen) == 0x0004B8, "Member 'UUIMenuBase::bIsEnableInputEventAtOpen' has a wrong offset!");
static_assert(offsetof(UUIMenuBase, bIsItemListUpdate) == 0x0004B9, "Member 'UUIMenuBase::bIsItemListUpdate' has a wrong offset!");

// Class DarwinGame.UIScrollMenuBase
// 0x0110 (0x05D0 - 0x04C0)
class UUIScrollMenuBase : public UUIMenuBase
{
public:
	int32                                         CursorItemNum;                                     // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BeforeItemNum;                                     // 0x04C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AfterItemNum;                                      // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScrollSpeed;                                       // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableLoop;                                       // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLineEnableLoop;                                   // 0x04D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D2[0x2];                                      // 0x04D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LineItemNum;                                       // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultSelectSound;                                // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DefaultSelectErrorSound;                           // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ListItemNum;                                       // 0x04F8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ListStartIndex;                                    // 0x04FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      PositionArray;                                     // 0x0500(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUIMenuItemBase*                        TopItem;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      ScaleArray;                                        // 0x0518(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDarwinUserWidget*                      ArrowWidget;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                ScrollBarWidget;                                   // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                ScrollBaseWidget;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bNext)>    LineMoveExceptioEventDispather;                    // 0x0540(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	EScrollBarMoveType                            ScrollMoveType;                                    // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNotSelectItemInListScroll;                        // 0x0551(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAxisMappingType                              PrevItemKey;                                       // 0x0552(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAxisMappingType                              NextItemKey;                                       // 0x0553(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAxisMappingType                              PrevLineKey;                                       // 0x0554(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAxisMappingType                              NextLineKey;                                       // 0x0555(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTraceCursorArrow;                                 // 0x0556(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_557[0x1];                                      // 0x0557(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       ArrowLoopAnimation;                                // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_560[0x70];                                     // 0x0560(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CanPlaySelectSound();
	bool CanSelect();
	bool ChangePage(EAxisMappingType Key, bool CheckSelfKeyInput);
	void InitList(int32 InListNum);
	void InitScrollMenu(const TArray<class UUIScrollMenuItemBase*>& InItemList);
	bool IsScrolling();
	bool IsValidItem(class UUIScrollMenuItemBase* InItem);
	void ResetDispList(int32 InFocusIndex, bool IsSetFocus);
	void ResetDispListKeepFocus(bool IsSetFocus);
	void ResetDispListStartIndex(int32 InFocusIndex, int32 InListStartIndex, bool IsSetFocus);
	bool ScrollPage(EAxisMappingType Key, bool CheckSelfKeyInput);
	void SetFocusItemFromListIndex(int32 InIndex);
	void SetItemData(class UUIScrollMenuItemBase* InItem);
	void SetVisibleCursorArrow(bool IsVisible_0, EArrowWidgetVisibleType VisibleType);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIScrollMenuBase">();
	}
	static class UUIScrollMenuBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIScrollMenuBase>();
	}
};
static_assert(alignof(UUIScrollMenuBase) == 0x000008, "Wrong alignment on UUIScrollMenuBase");
static_assert(sizeof(UUIScrollMenuBase) == 0x0005D0, "Wrong size on UUIScrollMenuBase");
static_assert(offsetof(UUIScrollMenuBase, CursorItemNum) == 0x0004C0, "Member 'UUIScrollMenuBase::CursorItemNum' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, BeforeItemNum) == 0x0004C4, "Member 'UUIScrollMenuBase::BeforeItemNum' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, AfterItemNum) == 0x0004C8, "Member 'UUIScrollMenuBase::AfterItemNum' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, ScrollSpeed) == 0x0004CC, "Member 'UUIScrollMenuBase::ScrollSpeed' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, bEnableLoop) == 0x0004D0, "Member 'UUIScrollMenuBase::bEnableLoop' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, bLineEnableLoop) == 0x0004D1, "Member 'UUIScrollMenuBase::bLineEnableLoop' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, LineItemNum) == 0x0004D4, "Member 'UUIScrollMenuBase::LineItemNum' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, DefaultSelectSound) == 0x0004D8, "Member 'UUIScrollMenuBase::DefaultSelectSound' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, DefaultSelectErrorSound) == 0x0004E8, "Member 'UUIScrollMenuBase::DefaultSelectErrorSound' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, ListItemNum) == 0x0004F8, "Member 'UUIScrollMenuBase::ListItemNum' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, ListStartIndex) == 0x0004FC, "Member 'UUIScrollMenuBase::ListStartIndex' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, PositionArray) == 0x000500, "Member 'UUIScrollMenuBase::PositionArray' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, TopItem) == 0x000510, "Member 'UUIScrollMenuBase::TopItem' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, ScaleArray) == 0x000518, "Member 'UUIScrollMenuBase::ScaleArray' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, ArrowWidget) == 0x000528, "Member 'UUIScrollMenuBase::ArrowWidget' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, ScrollBarWidget) == 0x000530, "Member 'UUIScrollMenuBase::ScrollBarWidget' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, ScrollBaseWidget) == 0x000538, "Member 'UUIScrollMenuBase::ScrollBaseWidget' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, LineMoveExceptioEventDispather) == 0x000540, "Member 'UUIScrollMenuBase::LineMoveExceptioEventDispather' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, ScrollMoveType) == 0x000550, "Member 'UUIScrollMenuBase::ScrollMoveType' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, bNotSelectItemInListScroll) == 0x000551, "Member 'UUIScrollMenuBase::bNotSelectItemInListScroll' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, PrevItemKey) == 0x000552, "Member 'UUIScrollMenuBase::PrevItemKey' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, NextItemKey) == 0x000553, "Member 'UUIScrollMenuBase::NextItemKey' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, PrevLineKey) == 0x000554, "Member 'UUIScrollMenuBase::PrevLineKey' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, NextLineKey) == 0x000555, "Member 'UUIScrollMenuBase::NextLineKey' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, bTraceCursorArrow) == 0x000556, "Member 'UUIScrollMenuBase::bTraceCursorArrow' has a wrong offset!");
static_assert(offsetof(UUIScrollMenuBase, ArrowLoopAnimation) == 0x000558, "Member 'UUIScrollMenuBase::ArrowLoopAnimation' has a wrong offset!");

// Class DarwinGame.UIRewardItemListBase
// 0x0028 (0x05F8 - 0x05D0)
class UUIRewardItemListBase : public UUIScrollMenuBase
{
public:
	uint8                                         Pad_5D0[0x28];                                     // 0x05D0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIRewardItemListBase">();
	}
	static class UUIRewardItemListBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIRewardItemListBase>();
	}
};
static_assert(alignof(UUIRewardItemListBase) == 0x000008, "Wrong alignment on UUIRewardItemListBase");
static_assert(sizeof(UUIRewardItemListBase) == 0x0005F8, "Wrong size on UUIRewardItemListBase");

// Class DarwinGame.AbilityTask_PlayMontageAndWaitEvent
// 0x00C0 (0x0148 - 0x0088)
class UAbilityTask_PlayMontageAndWaitEvent final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> OnCompleted;                                       // 0x0088(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> OnBlendOut;                                        // 0x0098(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> OnInterrupted;                                     // 0x00A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> OnCancelled;                                       // 0x00B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> EventReceived;                                     // 0x00C8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAnimMontage*                           MontageToPlay;                                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  EventTags;                                         // 0x00E0(0x0020)(NativeAccessSpecifierPrivate)
	float                                         Rate;                                              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   StartSection;                                      // 0x0104(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AnimRootMotionTranslationScale;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bStopWhenAbilityEnds;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_111[0x37];                                     // 0x0111(0x0037)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_PlayMontageAndWaitEvent* PlayMontageAndWaitEvent(class UGameplayAbility* OwningAbility, class FName TaskInstanceName, class UAnimMontage* MontageToPlay_0, const struct FGameplayTagContainer& EventTags_0, float Rate_0, class FName StartSection_0, bool bStopWhenAbilityEnds_0, float AnimRootMotionTranslationScale_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_PlayMontageAndWaitEvent">();
	}
	static class UAbilityTask_PlayMontageAndWaitEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_PlayMontageAndWaitEvent>();
	}
};
static_assert(alignof(UAbilityTask_PlayMontageAndWaitEvent) == 0x000008, "Wrong alignment on UAbilityTask_PlayMontageAndWaitEvent");
static_assert(sizeof(UAbilityTask_PlayMontageAndWaitEvent) == 0x000148, "Wrong size on UAbilityTask_PlayMontageAndWaitEvent");
static_assert(offsetof(UAbilityTask_PlayMontageAndWaitEvent, OnCompleted) == 0x000088, "Member 'UAbilityTask_PlayMontageAndWaitEvent::OnCompleted' has a wrong offset!");
static_assert(offsetof(UAbilityTask_PlayMontageAndWaitEvent, OnBlendOut) == 0x000098, "Member 'UAbilityTask_PlayMontageAndWaitEvent::OnBlendOut' has a wrong offset!");
static_assert(offsetof(UAbilityTask_PlayMontageAndWaitEvent, OnInterrupted) == 0x0000A8, "Member 'UAbilityTask_PlayMontageAndWaitEvent::OnInterrupted' has a wrong offset!");
static_assert(offsetof(UAbilityTask_PlayMontageAndWaitEvent, OnCancelled) == 0x0000B8, "Member 'UAbilityTask_PlayMontageAndWaitEvent::OnCancelled' has a wrong offset!");
static_assert(offsetof(UAbilityTask_PlayMontageAndWaitEvent, EventReceived) == 0x0000C8, "Member 'UAbilityTask_PlayMontageAndWaitEvent::EventReceived' has a wrong offset!");
static_assert(offsetof(UAbilityTask_PlayMontageAndWaitEvent, MontageToPlay) == 0x0000D8, "Member 'UAbilityTask_PlayMontageAndWaitEvent::MontageToPlay' has a wrong offset!");
static_assert(offsetof(UAbilityTask_PlayMontageAndWaitEvent, EventTags) == 0x0000E0, "Member 'UAbilityTask_PlayMontageAndWaitEvent::EventTags' has a wrong offset!");
static_assert(offsetof(UAbilityTask_PlayMontageAndWaitEvent, Rate) == 0x000100, "Member 'UAbilityTask_PlayMontageAndWaitEvent::Rate' has a wrong offset!");
static_assert(offsetof(UAbilityTask_PlayMontageAndWaitEvent, StartSection) == 0x000104, "Member 'UAbilityTask_PlayMontageAndWaitEvent::StartSection' has a wrong offset!");
static_assert(offsetof(UAbilityTask_PlayMontageAndWaitEvent, AnimRootMotionTranslationScale) == 0x00010C, "Member 'UAbilityTask_PlayMontageAndWaitEvent::AnimRootMotionTranslationScale' has a wrong offset!");
static_assert(offsetof(UAbilityTask_PlayMontageAndWaitEvent, bStopWhenAbilityEnds) == 0x000110, "Member 'UAbilityTask_PlayMontageAndWaitEvent::bStopWhenAbilityEnds' has a wrong offset!");

// Class DarwinGame.AnimNotify_WarpToTarget
// 0x0020 (0x0060 - 0x0040)
class UAnimNotify_WarpToTarget final : public UAnimNotify
{
public:
	EWarpDir                                      mWarpDir;                                          // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         mDistance;                                         // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                mNavimeshSearchExtent;                             // 0x0048(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          mDebugDrawNavimeshSearchExtent;                    // 0x0054(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          mIsEditUnwarpableWallHeight;                       // 0x0055(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         mUnwarpableWallHeight;                             // 0x0058(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_WarpToTarget">();
	}
	static class UAnimNotify_WarpToTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_WarpToTarget>();
	}
};
static_assert(alignof(UAnimNotify_WarpToTarget) == 0x000008, "Wrong alignment on UAnimNotify_WarpToTarget");
static_assert(sizeof(UAnimNotify_WarpToTarget) == 0x000060, "Wrong size on UAnimNotify_WarpToTarget");
static_assert(offsetof(UAnimNotify_WarpToTarget, mWarpDir) == 0x000040, "Member 'UAnimNotify_WarpToTarget::mWarpDir' has a wrong offset!");
static_assert(offsetof(UAnimNotify_WarpToTarget, mDistance) == 0x000044, "Member 'UAnimNotify_WarpToTarget::mDistance' has a wrong offset!");
static_assert(offsetof(UAnimNotify_WarpToTarget, mNavimeshSearchExtent) == 0x000048, "Member 'UAnimNotify_WarpToTarget::mNavimeshSearchExtent' has a wrong offset!");
static_assert(offsetof(UAnimNotify_WarpToTarget, mDebugDrawNavimeshSearchExtent) == 0x000054, "Member 'UAnimNotify_WarpToTarget::mDebugDrawNavimeshSearchExtent' has a wrong offset!");
static_assert(offsetof(UAnimNotify_WarpToTarget, mIsEditUnwarpableWallHeight) == 0x000055, "Member 'UAnimNotify_WarpToTarget::mIsEditUnwarpableWallHeight' has a wrong offset!");
static_assert(offsetof(UAnimNotify_WarpToTarget, mUnwarpableWallHeight) == 0x000058, "Member 'UAnimNotify_WarpToTarget::mUnwarpableWallHeight' has a wrong offset!");

// Class DarwinGame.StateBase
// 0x0020 (0x00D8 - 0x00B8)
class UStateBase : public UActorComponent
{
public:
	int32                                         Priority;                                          // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGPACharacter*                          OwnerCharacter;                                    // 0x00C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x10];                                      // 0x00C8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Button_A(bool bRelease);
	void Button_B(bool bRelease);
	void Button_Down(bool bRelease);
	void Button_L(bool bRelease);
	void Button_Left(bool bRelease);
	void Button_LT(bool bRelease);
	void Button_PC_R(bool bRelease);
	void Button_PC_T(bool bRelease);
	void Button_R(bool bRelease);
	void Button_Right(bool bRelease);
	void Button_RMB(bool bRelease);
	void Button_RT(bool bRelease);
	void Button_Up(bool bRelease);
	void Button_X(bool bRelease);
	void Button_Y(bool bRelease);
	void Cancel();
	void Enter();
	void Exit();
	void Move(const struct FVector& InputVector);
	void SpecialLeft(bool bRelease);
	void SpecialRight(bool bRelease);
	void TakeAction(const struct FGameplayTag& ActionTag, bool bRelease);
	void Thumb_Left(bool bRelease);
	void Update(float DeltaTime);

	float CalcAxisValue() const;
	struct FRotator GetInputRotation() const;
	struct FVector GetLastMovementInput() const;
	struct FRotator GetMoveRotation() const;
	void GetMoveValue(float* Axis, float* Direction) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"StateBase">();
	}
	static class UStateBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateBase>();
	}
};
static_assert(alignof(UStateBase) == 0x000008, "Wrong alignment on UStateBase");
static_assert(sizeof(UStateBase) == 0x0000D8, "Wrong size on UStateBase");
static_assert(offsetof(UStateBase, Priority) == 0x0000B8, "Member 'UStateBase::Priority' has a wrong offset!");
static_assert(offsetof(UStateBase, OwnerCharacter) == 0x0000C0, "Member 'UStateBase::OwnerCharacter' has a wrong offset!");

// Class DarwinGame.AnimNotifyState_SetLandSection
// 0x0010 (0x0048 - 0x0038)
class UAnimNotifyState_SetLandSection final : public UAnimNotifyState
{
public:
	class FName                                   mLandSection;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          mResetLandSection;                                 // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_SetLandSection">();
	}
	static class UAnimNotifyState_SetLandSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_SetLandSection>();
	}
};
static_assert(alignof(UAnimNotifyState_SetLandSection) == 0x000008, "Wrong alignment on UAnimNotifyState_SetLandSection");
static_assert(sizeof(UAnimNotifyState_SetLandSection) == 0x000048, "Wrong size on UAnimNotifyState_SetLandSection");
static_assert(offsetof(UAnimNotifyState_SetLandSection, mLandSection) == 0x000038, "Member 'UAnimNotifyState_SetLandSection::mLandSection' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_SetLandSection, mResetLandSection) == 0x000040, "Member 'UAnimNotifyState_SetLandSection::mResetLandSection' has a wrong offset!");

// Class DarwinGame.UIDungeon_Floor
// 0x0000 (0x0490 - 0x0490)
class UUIDungeon_Floor : public UDarwinUserWidget
{
public:
	void SetRoomNumber(int32 NewRoomNumber);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UIDungeon_Floor">();
	}
	static class UUIDungeon_Floor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIDungeon_Floor>();
	}
};
static_assert(alignof(UUIDungeon_Floor) == 0x000008, "Wrong alignment on UUIDungeon_Floor");
static_assert(sizeof(UUIDungeon_Floor) == 0x000490, "Wrong size on UUIDungeon_Floor");

// Class DarwinGame.AnimNotify_WarpToTargetLocation
// 0x0000 (0x0040 - 0x0040)
class UAnimNotify_WarpToTargetLocation final : public UAnimNotify
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_WarpToTargetLocation">();
	}
	static class UAnimNotify_WarpToTargetLocation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_WarpToTargetLocation>();
	}
};
static_assert(alignof(UAnimNotify_WarpToTargetLocation) == 0x000008, "Wrong alignment on UAnimNotify_WarpToTargetLocation");
static_assert(sizeof(UAnimNotify_WarpToTargetLocation) == 0x000040, "Wrong size on UAnimNotify_WarpToTargetLocation");

// Class DarwinGame.UISentenceBase
// 0x0000 (0x0490 - 0x0490)
class UUISentenceBase : public UDarwinUserWidget
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UISentenceBase">();
	}
	static class UUISentenceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUISentenceBase>();
	}
};
static_assert(alignof(UUISentenceBase) == 0x000008, "Wrong alignment on UUISentenceBase");
static_assert(sizeof(UUISentenceBase) == 0x000490, "Wrong size on UUISentenceBase");

// Class DarwinGame.MoveStateBase
// 0x0098 (0x0170 - 0x00D8)
class UMoveStateBase : public UStateBase
{
public:
	uint8                                         Pad_D8[0x98];                                      // 0x00D8(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CheckFrontWall(float RayLength, float Angle, float IncidentAngle, float Top, float Bottom);
	bool CheckWallHeight(float Top, float Bottom, float* Height);
	struct FVector GetGradientVector();
	void SetNextMoveStateTag(const struct FGameplayTag& Tag);

	struct FGameplayTag GetNextMoveStateTag() const;
	struct FHitResult GetWallSurface() const;
	bool IsWallSurfaceFound() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoveStateBase">();
	}
	static class UMoveStateBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoveStateBase>();
	}
};
static_assert(alignof(UMoveStateBase) == 0x000008, "Wrong alignment on UMoveStateBase");
static_assert(sizeof(UMoveStateBase) == 0x000170, "Wrong size on UMoveStateBase");

// Class DarwinGame.AbnormalStateBase
// 0x0008 (0x0178 - 0x0170)
class UAbnormalStateBase final : public UMoveStateBase
{
public:
	uint8                                         Pad_170[0x8];                                      // 0x0170(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateBase">();
	}
	static class UAbnormalStateBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateBase>();
	}
};
static_assert(alignof(UAbnormalStateBase) == 0x000008, "Wrong alignment on UAbnormalStateBase");
static_assert(sizeof(UAbnormalStateBase) == 0x000178, "Wrong size on UAbnormalStateBase");

// Class DarwinGame.GameDataPlayer
// 0x01D0 (0x0200 - 0x0030)
class UGameDataPlayer final : public UObject
{
public:
	uint8                                         Pad_30[0x1D0];                                     // 0x0030(0x01D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 AddExp(const int32 Exp);
	void AddGold(int32 Gold);
	class UGameDataPlayer* Clone();
	void Overwrite(class UGameDataPlayer* game_data);
	void SetAttributeList(const TMap<class FName, int32>& list);
	void SetBP(int32 BP);
	void SetEquipmentCoins(const TArray<struct FST_CoinData>& EquipmentCoins);
	void SetFeatureBuffList(const TMap<class FName, struct FFeatureMapData>& list);
	void SetGold(int32 Gold);
	void SetHP(int32 HP);
	void SetMP(int32 MP);

	struct FST_Status GetAdvanceStatus() const;
	const TMap<class FName, int32> GetAttributeList() const;
	struct FST_Status GetBaseStatus() const;
	int32 GetBP() const;
	const TArray<struct FST_CoinData> GetEquipmentCoins() const;
	const TMap<class FName, struct FFeatureMapData> GetFeatureBuffList() const;
	int32 GetGold() const;
	int32 GetHP() const;
	int32 GetLevel() const;
	int32 GetMP() const;
	int32 GetRequiredExp(int32 Level) const;
	int32 GetRequiredExpToNextLevel() const;
	float GetRequiredExpToNextLevelPercent() const;
	struct FST_Status GetStatus() const;
	int32 GetTotalExp() const;
	bool IsKindKamyu() const;
	bool IsKindMaya() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GameDataPlayer">();
	}
	static class UGameDataPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameDataPlayer>();
	}
};
static_assert(alignof(UGameDataPlayer) == 0x000008, "Wrong alignment on UGameDataPlayer");
static_assert(sizeof(UGameDataPlayer) == 0x000200, "Wrong size on UGameDataPlayer");

// Class DarwinGame.BaseAreaLevelUpDataAsset
// 0x00B0 (0x00E8 - 0x0038)
class UBaseAreaLevelUpDataAsset final : public UDataAsset
{
public:
	TMap<int32, struct FBaseAreaLevelUpGameFlagList> mGameFlagList;                                     // 0x0038(0x0050)(Edit, DisableEditOnTemplate, EditConst, NativeAccessSpecifierPrivate)
	TArray<struct FBaseAreaLevelUpEventData>      mEventDataList;                                    // 0x0088(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, class FName>                mEventDataExclusiveList;                           // 0x0098(0x0050)(Edit, DisableEditOnTemplate, EditConst, NativeAccessSpecifierPrivate)

public:
	void Build();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BaseAreaLevelUpDataAsset">();
	}
	static class UBaseAreaLevelUpDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseAreaLevelUpDataAsset>();
	}
};
static_assert(alignof(UBaseAreaLevelUpDataAsset) == 0x000008, "Wrong alignment on UBaseAreaLevelUpDataAsset");
static_assert(sizeof(UBaseAreaLevelUpDataAsset) == 0x0000E8, "Wrong size on UBaseAreaLevelUpDataAsset");
static_assert(offsetof(UBaseAreaLevelUpDataAsset, mGameFlagList) == 0x000038, "Member 'UBaseAreaLevelUpDataAsset::mGameFlagList' has a wrong offset!");
static_assert(offsetof(UBaseAreaLevelUpDataAsset, mEventDataList) == 0x000088, "Member 'UBaseAreaLevelUpDataAsset::mEventDataList' has a wrong offset!");
static_assert(offsetof(UBaseAreaLevelUpDataAsset, mEventDataExclusiveList) == 0x000098, "Member 'UBaseAreaLevelUpDataAsset::mEventDataExclusiveList' has a wrong offset!");

// Class DarwinGame.AppGameModeBase
// 0x0000 (0x02C8 - 0x02C8)
class AAppGameModeBase : public AGameModeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AppGameModeBase">();
	}
	static class AAppGameModeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppGameModeBase>();
	}
};
static_assert(alignof(AAppGameModeBase) == 0x000008, "Wrong alignment on AAppGameModeBase");
static_assert(sizeof(AAppGameModeBase) == 0x0002C8, "Wrong size on AAppGameModeBase");

// Class DarwinGame.SoundTestGameMode
// 0x0000 (0x02C8 - 0x02C8)
class ASoundTestGameMode final : public AAppGameModeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SoundTestGameMode">();
	}
	static class ASoundTestGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASoundTestGameMode>();
	}
};
static_assert(alignof(ASoundTestGameMode) == 0x000008, "Wrong alignment on ASoundTestGameMode");
static_assert(sizeof(ASoundTestGameMode) == 0x0002C8, "Wrong size on ASoundTestGameMode");

// Class DarwinGame.AnimNotifyState_AddHateInRange
// 0x0008 (0x0040 - 0x0038)
class UAnimNotifyState_AddHateInRange final : public UAnimNotifyState
{
public:
	float                                         mHateRadius;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         mHateValue;                                        // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_AddHateInRange">();
	}
