#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Eff_CoinSet_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Eff_CoinSet_01.Eff_CoinSet_01_C
// 0x0028 (0x04B8 - 0x0490)
class UEff_CoinSet_01_C final : public UDarwinUserWidget
{
public:
	class UWidgetAnimation*                       Set;                                               // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Dot;                                               // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash_1;                                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash_2;                                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ring;                                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Eff_CoinSet_01_C">();
	}
	static class UEff_CoinSet_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEff_CoinSet_01_C>();
	}
};
static_assert(alignof(UEff_CoinSet_01_C) == 0x000008, "Wrong alignment on UEff_CoinSet_01_C");
static_assert(sizeof(UEff_CoinSet_01_C) == 0x0004B8, "Wrong size on UEff_CoinSet_01_C");
static_assert(offsetof(UEff_CoinSet_01_C, Set) == 0x000490, "Member 'UEff_CoinSet_01_C::Set' has a wrong offset!");
static_assert(offsetof(UEff_CoinSet_01_C, Dot) == 0x000498, "Member 'UEff_CoinSet_01_C::Dot' has a wrong offset!");
static_assert(offsetof(UEff_CoinSet_01_C, Flash_1) == 0x0004A0, "Member 'UEff_CoinSet_01_C::Flash_1' has a wrong offset!");
static_assert(offsetof(UEff_CoinSet_01_C, Flash_2) == 0x0004A8, "Member 'UEff_CoinSet_01_C::Flash_2' has a wrong offset!");
static_assert(offsetof(UEff_CoinSet_01_C, Ring) == 0x0004B0, "Member 'UEff_CoinSet_01_C::Ring' has a wrong offset!");

}

