#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQC_StartLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EQC_StartLocation.EQC_StartLocation_C.ProvideSingleLocation
// 0x0038 (0x0038 - 0x0000)
struct EQC_StartLocation_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMonster*                               K2Node_DynamicCast_AsMonster;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVectorOnBlackboard_ReturnValue;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQC_StartLocation_C_ProvideSingleLocation) == 0x000008, "Wrong alignment on EQC_StartLocation_C_ProvideSingleLocation");
static_assert(sizeof(EQC_StartLocation_C_ProvideSingleLocation) == 0x000038, "Wrong size on EQC_StartLocation_C_ProvideSingleLocation");
static_assert(offsetof(EQC_StartLocation_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'EQC_StartLocation_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQC_StartLocation_C_ProvideSingleLocation, QuerierActor) == 0x000008, "Member 'EQC_StartLocation_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQC_StartLocation_C_ProvideSingleLocation, ResultingLocation) == 0x000010, "Member 'EQC_StartLocation_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");
static_assert(offsetof(EQC_StartLocation_C_ProvideSingleLocation, K2Node_DynamicCast_AsMonster) == 0x000020, "Member 'EQC_StartLocation_C_ProvideSingleLocation::K2Node_DynamicCast_AsMonster' has a wrong offset!");
static_assert(offsetof(EQC_StartLocation_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'EQC_StartLocation_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EQC_StartLocation_C_ProvideSingleLocation, CallFunc_GetVectorOnBlackboard_ReturnValue) == 0x00002C, "Member 'EQC_StartLocation_C_ProvideSingleLocation::CallFunc_GetVectorOnBlackboard_ReturnValue' has a wrong offset!");

}

