#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldLink_Dive

#include "Basic.hpp"


namespace SDK::Params
{

// Function FieldLink_Dive.FieldLink_Dive_C.Button_A
// 0x0001 (0x0001 - 0x0000)
struct FieldLink_Dive_C_Button_A final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FieldLink_Dive_C_Button_A) == 0x000001, "Wrong alignment on FieldLink_Dive_C_Button_A");
static_assert(sizeof(FieldLink_Dive_C_Button_A) == 0x000001, "Wrong size on FieldLink_Dive_C_Button_A");
static_assert(offsetof(FieldLink_Dive_C_Button_A, bRelease) == 0x000000, "Member 'FieldLink_Dive_C_Button_A::bRelease' has a wrong offset!");

// Function FieldLink_Dive.FieldLink_Dive_C.ExecuteUbergraph_FieldLink_Dive
// 0x0028 (0x0028 - 0x0000)
struct FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGPACharacter*                          CallFunc_GetLinkTarget_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive) == 0x000008, "Wrong alignment on FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive");
static_assert(sizeof(FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive) == 0x000028, "Wrong size on FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive");
static_assert(offsetof(FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive, EntryPoint) == 0x000000, "Member 'FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive::EntryPoint' has a wrong offset!");
static_assert(offsetof(FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive, CallFunc_GetLinkTarget_ReturnValue) == 0x000008, "Member 'FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive::CallFunc_GetLinkTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive, K2Node_DynamicCast_AsCharacter_Interface) == 0x000010, "Member 'FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive, K2Node_Event_bRelease) == 0x000021, "Member 'FieldLink_Dive_C_ExecuteUbergraph_FieldLink_Dive::K2Node_Event_bRelease' has a wrong offset!");

}

