#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldLink_Move

#include "Basic.hpp"


namespace SDK::Params
{

// Function FieldLink_Move.FieldLink_Move_C.Button_A
// 0x0001 (0x0001 - 0x0000)
struct FieldLink_Move_C_Button_A final
{
public:
	bool                                          bRelease;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FieldLink_Move_C_Button_A) == 0x000001, "Wrong alignment on FieldLink_Move_C_Button_A");
static_assert(sizeof(FieldLink_Move_C_Button_A) == 0x000001, "Wrong size on FieldLink_Move_C_Button_A");
static_assert(offsetof(FieldLink_Move_C_Button_A, bRelease) == 0x000000, "Member 'FieldLink_Move_C_Button_A::bRelease' has a wrong offset!");

// Function FieldLink_Move.FieldLink_Move_C.ExecuteUbergraph_FieldLink_Move
// 0x0030 (0x0030 - 0x0000)
struct FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStateBase*                             CallFunc_GetCurrentState_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGPACharacter*                          CallFunc_GetLinkTarget_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IObjectCommunicationInterface> K2Node_DynamicCast_AsObject_Communication_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bRelease;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move) == 0x000008, "Wrong alignment on FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move");
static_assert(sizeof(FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move) == 0x000030, "Wrong size on FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move");
static_assert(offsetof(FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move, EntryPoint) == 0x000000, "Member 'FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move::EntryPoint' has a wrong offset!");
static_assert(offsetof(FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move, CallFunc_GetCurrentState_ReturnValue) == 0x000008, "Member 'FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move::CallFunc_GetCurrentState_ReturnValue' has a wrong offset!");
static_assert(offsetof(FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move, CallFunc_GetLinkTarget_ReturnValue) == 0x000010, "Member 'FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move::CallFunc_GetLinkTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move, K2Node_DynamicCast_AsObject_Communication_Interface) == 0x000018, "Member 'FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move::K2Node_DynamicCast_AsObject_Communication_Interface' has a wrong offset!");
static_assert(offsetof(FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move, K2Node_Event_bRelease) == 0x000029, "Member 'FieldLink_Move_C_ExecuteUbergraph_FieldLink_Move::K2Node_Event_bRelease' has a wrong offset!");

}

