#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldLink_HighJump

#include "Basic.hpp"


namespace SDK::Params
{

// Function FieldLink_HighJump.FieldLink_HighJump_C.ExecuteUbergraph_FieldLink_HighJump
// 0x0060 (0x0060 - 0x0000)
struct FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGPACharacter*                          CallFunc_GetLinkTarget_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExecuteAbility_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IObjectCommunicationInterface> K2Node_DynamicCast_AsObject_Communication_Interface; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_1;        // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump) == 0x000008, "Wrong alignment on FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump");
static_assert(sizeof(FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump) == 0x000060, "Wrong size on FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump");
static_assert(offsetof(FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump, EntryPoint) == 0x000000, "Member 'FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump::EntryPoint' has a wrong offset!");
static_assert(offsetof(FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump, K2Node_DynamicCast_AsCharacter_Interface) == 0x000008, "Member 'FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump, CallFunc_GetLinkTarget_ReturnValue) == 0x000020, "Member 'FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump::CallFunc_GetLinkTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump, CallFunc_ExecuteAbility_ReturnValue) == 0x000028, "Member 'FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump::CallFunc_ExecuteAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump, K2Node_DynamicCast_AsObject_Communication_Interface) == 0x000030, "Member 'FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump::K2Node_DynamicCast_AsObject_Communication_Interface' has a wrong offset!");
static_assert(offsetof(FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump, K2Node_DynamicCast_AsCharacter_Interface_1) == 0x000048, "Member 'FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump::K2Node_DynamicCast_AsCharacter_Interface_1' has a wrong offset!");
static_assert(offsetof(FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'FieldLink_HighJump_C_ExecuteUbergraph_FieldLink_HighJump::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

