#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Dead

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Dead.GA_Dead_C
// 0x0020 (0x0440 - 0x0420)
class UGA_Dead_C final : public UActionGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   StartSection;                                      // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGPACharacter*                          Character;                                         // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewVar_0;                                          // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Dead(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnCompleted_BEEC864C432C9C295BF8629D19F9EC6E(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnBlendOut_BEEC864C432C9C295BF8629D19F9EC6E(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnInterrupted_BEEC864C432C9C295BF8629D19F9EC6E(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnCancelled_BEEC864C432C9C295BF8629D19F9EC6E(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void EventReceived_BEEC864C432C9C295BF8629D19F9EC6E(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Dead_C">();
	}
	static class UGA_Dead_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Dead_C>();
	}
};
static_assert(alignof(UGA_Dead_C) == 0x000008, "Wrong alignment on UGA_Dead_C");
static_assert(sizeof(UGA_Dead_C) == 0x000440, "Wrong size on UGA_Dead_C");
static_assert(offsetof(UGA_Dead_C, UberGraphFrame) == 0x000420, "Member 'UGA_Dead_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Dead_C, StartSection) == 0x000428, "Member 'UGA_Dead_C::StartSection' has a wrong offset!");
static_assert(offsetof(UGA_Dead_C, Character) == 0x000430, "Member 'UGA_Dead_C::Character' has a wrong offset!");
static_assert(offsetof(UGA_Dead_C, NewVar_0) == 0x000438, "Member 'UGA_Dead_C::NewVar_0' has a wrong offset!");

}

