#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Despoil

#include "Basic.hpp"

#include "DarwinGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Despoil.GA_Despoil_C.ExecuteUbergraph_GA_Despoil
// 0x0658 (0x0658 - 0x0000)
struct GA_Despoil_C_ExecuteUbergraph_GA_Despoil final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_3;                     // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_3;                    // 0x0010(0x00B0)()
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_2;                     // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_2;                    // 0x00C8(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_1;                     // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_1;                    // 0x0190(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag;                       // 0x0250(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData;                      // 0x0258(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0308(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0318(0x00B0)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x03C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          Temp_object_Variable;                              // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          Temp_object_Variable_1;                            // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontage_ReturnValue;      // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontage_ReturnValue_1;    // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x03FC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x040C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWaitEvent*   CallFunc_PlayMontageAndWaitEvent_ReturnValue;      // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42A[0x6];                                      // 0x042A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x0430(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_1;        // 0x0450(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_4;                     // 0x0470(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_4;                    // 0x0478(0x00B0)()
	class USceneComponent*                        CallFunc_GetTargetComponent_ReturnValue;           // 0x0528(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRunninngActionOverViewID_ReturnValue;  // 0x0530(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0548(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0558(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0568(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttackHitParameter                    K2Node_MakeStruct_AttackHitParameter;              // 0x0574(0x0024)(NoDestructor)
	struct FAttackHitResultStruct                 K2Node_MakeStruct_AttackHitResultStruct;           // 0x0598(0x0040)(NoDestructor)
	struct FActionGameplayEffectContainerSpec     CallFunc_CreateEffectContainerSpecWithAttackResult_ReturnValue; // 0x05D8(0x0038)()
	struct FActionGameplayEffectContainerSpec     CallFunc_AddTargetsToEffectContainerSpec_ReturnValue; // 0x0610(0x0038)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyExternalEffectContainerSpec_ReturnValue; // 0x0648(0x0010)(ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil) == 0x000008, "Wrong alignment on GA_Despoil_C_ExecuteUbergraph_GA_Despoil");
static_assert(sizeof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil) == 0x000658, "Wrong size on GA_Despoil_C_ExecuteUbergraph_GA_Despoil");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, EntryPoint) == 0x000000, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CustomEvent_EventTag_3) == 0x000004, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CustomEvent_EventTag_3' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CustomEvent_EventData_3) == 0x000010, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CustomEvent_EventData_3' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CustomEvent_EventTag_2) == 0x0000C0, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CustomEvent_EventTag_2' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CustomEvent_EventData_2) == 0x0000C8, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CustomEvent_EventData_2' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CreateDelegate_OutputDelegate) == 0x000178, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CustomEvent_EventTag_1) == 0x000188, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CustomEvent_EventTag_1' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CustomEvent_EventData_1) == 0x000190, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CustomEvent_EventData_1' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CreateDelegate_OutputDelegate_1) == 0x000240, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CustomEvent_EventTag) == 0x000250, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CustomEvent_EventData) == 0x000258, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CustomEvent_EventData' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CreateDelegate_OutputDelegate_2) == 0x000308, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, Temp_struct_Variable) == 0x000318, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, Temp_struct_Variable_1) == 0x0003C8, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0003D0, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, Temp_object_Variable) == 0x0003D8, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, Temp_object_Variable_1) == 0x0003E0, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_GetCurrentActiveMontage_ReturnValue) == 0x0003E8, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_GetCurrentActiveMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_GetCurrentActiveMontage_ReturnValue_1) == 0x0003F0, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_GetCurrentActiveMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_Event_bWasCancelled) == 0x0003F8, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CreateDelegate_OutputDelegate_3) == 0x0003FC, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CreateDelegate_OutputDelegate_4) == 0x00040C, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_PlayMontageAndWaitEvent_ReturnValue) == 0x000420, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_PlayMontageAndWaitEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_IsValid_ReturnValue) == 0x000428, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_IsValid_ReturnValue_1) == 0x000429, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_DynamicCast_AsCharacter_Interface) == 0x000430, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_DynamicCast_bSuccess) == 0x000440, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_GetAnimInstance_ReturnValue) == 0x000448, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_DynamicCast_AsCharacter_Interface_1) == 0x000450, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_DynamicCast_AsCharacter_Interface_1' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_DynamicCast_bSuccess_1) == 0x000460, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000468, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CustomEvent_EventTag_4) == 0x000470, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CustomEvent_EventTag_4' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_CustomEvent_EventData_4) == 0x000478, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_CustomEvent_EventData_4' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_GetTargetComponent_ReturnValue) == 0x000528, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_GetTargetComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_GetRunninngActionOverViewID_ReturnValue) == 0x000530, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_GetRunninngActionOverViewID_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_IsValid_ReturnValue_2) == 0x000538, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_GetOwner_ReturnValue) == 0x000540, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000548, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_MakeArray_Array) == 0x000558, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000568, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_MakeStruct_AttackHitParameter) == 0x000574, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_MakeStruct_AttackHitParameter' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, K2Node_MakeStruct_AttackHitResultStruct) == 0x000598, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::K2Node_MakeStruct_AttackHitResultStruct' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_CreateEffectContainerSpecWithAttackResult_ReturnValue) == 0x0005D8, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_CreateEffectContainerSpecWithAttackResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_AddTargetsToEffectContainerSpec_ReturnValue) == 0x000610, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_AddTargetsToEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_ExecuteUbergraph_GA_Despoil, CallFunc_ApplyExternalEffectContainerSpec_ReturnValue) == 0x000648, "Member 'GA_Despoil_C_ExecuteUbergraph_GA_Despoil::CallFunc_ApplyExternalEffectContainerSpec_ReturnValue' has a wrong offset!");

// Function GA_Despoil.GA_Despoil_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Despoil_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Despoil_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Despoil_C_K2_OnEndAbility");
static_assert(sizeof(GA_Despoil_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Despoil_C_K2_OnEndAbility");
static_assert(offsetof(GA_Despoil_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Despoil_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Despoil.GA_Despoil_C.OnCompleted_412FEFFF49034F0B97BEA8B8BFF47790
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Despoil_C_OnCompleted_412FEFFF49034F0B97BEA8B8BFF47790 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Despoil_C_OnCompleted_412FEFFF49034F0B97BEA8B8BFF47790) == 0x000008, "Wrong alignment on GA_Despoil_C_OnCompleted_412FEFFF49034F0B97BEA8B8BFF47790");
static_assert(sizeof(GA_Despoil_C_OnCompleted_412FEFFF49034F0B97BEA8B8BFF47790) == 0x0000B8, "Wrong size on GA_Despoil_C_OnCompleted_412FEFFF49034F0B97BEA8B8BFF47790");
static_assert(offsetof(GA_Despoil_C_OnCompleted_412FEFFF49034F0B97BEA8B8BFF47790, EventTag) == 0x000000, "Member 'GA_Despoil_C_OnCompleted_412FEFFF49034F0B97BEA8B8BFF47790::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_OnCompleted_412FEFFF49034F0B97BEA8B8BFF47790, EventData) == 0x000008, "Member 'GA_Despoil_C_OnCompleted_412FEFFF49034F0B97BEA8B8BFF47790::EventData' has a wrong offset!");

// Function GA_Despoil.GA_Despoil_C.OnBlendOut_412FEFFF49034F0B97BEA8B8BFF47790
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Despoil_C_OnBlendOut_412FEFFF49034F0B97BEA8B8BFF47790 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Despoil_C_OnBlendOut_412FEFFF49034F0B97BEA8B8BFF47790) == 0x000008, "Wrong alignment on GA_Despoil_C_OnBlendOut_412FEFFF49034F0B97BEA8B8BFF47790");
static_assert(sizeof(GA_Despoil_C_OnBlendOut_412FEFFF49034F0B97BEA8B8BFF47790) == 0x0000B8, "Wrong size on GA_Despoil_C_OnBlendOut_412FEFFF49034F0B97BEA8B8BFF47790");
static_assert(offsetof(GA_Despoil_C_OnBlendOut_412FEFFF49034F0B97BEA8B8BFF47790, EventTag) == 0x000000, "Member 'GA_Despoil_C_OnBlendOut_412FEFFF49034F0B97BEA8B8BFF47790::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_OnBlendOut_412FEFFF49034F0B97BEA8B8BFF47790, EventData) == 0x000008, "Member 'GA_Despoil_C_OnBlendOut_412FEFFF49034F0B97BEA8B8BFF47790::EventData' has a wrong offset!");

// Function GA_Despoil.GA_Despoil_C.OnInterrupted_412FEFFF49034F0B97BEA8B8BFF47790
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Despoil_C_OnInterrupted_412FEFFF49034F0B97BEA8B8BFF47790 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Despoil_C_OnInterrupted_412FEFFF49034F0B97BEA8B8BFF47790) == 0x000008, "Wrong alignment on GA_Despoil_C_OnInterrupted_412FEFFF49034F0B97BEA8B8BFF47790");
static_assert(sizeof(GA_Despoil_C_OnInterrupted_412FEFFF49034F0B97BEA8B8BFF47790) == 0x0000B8, "Wrong size on GA_Despoil_C_OnInterrupted_412FEFFF49034F0B97BEA8B8BFF47790");
static_assert(offsetof(GA_Despoil_C_OnInterrupted_412FEFFF49034F0B97BEA8B8BFF47790, EventTag) == 0x000000, "Member 'GA_Despoil_C_OnInterrupted_412FEFFF49034F0B97BEA8B8BFF47790::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_OnInterrupted_412FEFFF49034F0B97BEA8B8BFF47790, EventData) == 0x000008, "Member 'GA_Despoil_C_OnInterrupted_412FEFFF49034F0B97BEA8B8BFF47790::EventData' has a wrong offset!");

// Function GA_Despoil.GA_Despoil_C.OnCancelled_412FEFFF49034F0B97BEA8B8BFF47790
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Despoil_C_OnCancelled_412FEFFF49034F0B97BEA8B8BFF47790 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Despoil_C_OnCancelled_412FEFFF49034F0B97BEA8B8BFF47790) == 0x000008, "Wrong alignment on GA_Despoil_C_OnCancelled_412FEFFF49034F0B97BEA8B8BFF47790");
static_assert(sizeof(GA_Despoil_C_OnCancelled_412FEFFF49034F0B97BEA8B8BFF47790) == 0x0000B8, "Wrong size on GA_Despoil_C_OnCancelled_412FEFFF49034F0B97BEA8B8BFF47790");
static_assert(offsetof(GA_Despoil_C_OnCancelled_412FEFFF49034F0B97BEA8B8BFF47790, EventTag) == 0x000000, "Member 'GA_Despoil_C_OnCancelled_412FEFFF49034F0B97BEA8B8BFF47790::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_OnCancelled_412FEFFF49034F0B97BEA8B8BFF47790, EventData) == 0x000008, "Member 'GA_Despoil_C_OnCancelled_412FEFFF49034F0B97BEA8B8BFF47790::EventData' has a wrong offset!");

// Function GA_Despoil.GA_Despoil_C.EventReceived_412FEFFF49034F0B97BEA8B8BFF47790
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Despoil_C_EventReceived_412FEFFF49034F0B97BEA8B8BFF47790 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Despoil_C_EventReceived_412FEFFF49034F0B97BEA8B8BFF47790) == 0x000008, "Wrong alignment on GA_Despoil_C_EventReceived_412FEFFF49034F0B97BEA8B8BFF47790");
static_assert(sizeof(GA_Despoil_C_EventReceived_412FEFFF49034F0B97BEA8B8BFF47790) == 0x0000B8, "Wrong size on GA_Despoil_C_EventReceived_412FEFFF49034F0B97BEA8B8BFF47790");
static_assert(offsetof(GA_Despoil_C_EventReceived_412FEFFF49034F0B97BEA8B8BFF47790, EventTag) == 0x000000, "Member 'GA_Despoil_C_EventReceived_412FEFFF49034F0B97BEA8B8BFF47790::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Despoil_C_EventReceived_412FEFFF49034F0B97BEA8B8BFF47790, EventData) == 0x000008, "Member 'GA_Despoil_C_EventReceived_412FEFFF49034F0B97BEA8B8BFF47790::EventData' has a wrong offset!");

}

