#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Link

#include "Basic.hpp"

#include "DarwinGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Link.GA_Link_C.ExecuteUbergraph_GA_Link
// 0x05E0 (0x05E0 - 0x0000)
struct GA_Link_C_ExecuteUbergraph_GA_Link final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFieldLinkType>                        K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_3;                     // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_3;                    // 0x0020(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_2;                     // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_2;                    // 0x00E8(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_1;                     // 0x01A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_1;                    // 0x01B0(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0260(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag;                       // 0x0270(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData;                      // 0x0278(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0328(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x0338(0x00B0)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x03E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          Temp_object_Variable;                              // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface;          // 0x0400(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character;             // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRunningLinkID_ReturnValue;             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_LinkData                           CallFunc_GetLinkData_LinkData;                     // 0x0438(0x0038)()
	float                                         CallFunc_GetTimeScale_ReturnValue;                 // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_RideMotionData                     CallFunc_GetRideMotion_FoundData;                  // 0x0478(0x0048)()
	bool                                          CallFunc_GetRideMotion_ReturnValue;                // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWaitEvent*   CallFunc_PlayMontageAndWaitEvent_ReturnValue;      // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D2[0x6];                                      // 0x04D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCharacter*                       K2Node_DynamicCast_AsPlayer_Character_1;           // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICharacterInterface>   K2Node_DynamicCast_AsCharacter_Interface_1;        // 0x04E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAttribute_ReturnValue;                 // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FA[0x2];                                      // 0x04FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_4;                     // 0x04FC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_4;                    // 0x0508(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x05B8(0x0010)(ZeroConstructor, NoDestructor)
	TArray<EFieldLinkType>                        K2Node_MakeArray_Array_1;                          // 0x05C8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x05D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x05DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x05DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Link_C_ExecuteUbergraph_GA_Link) == 0x000008, "Wrong alignment on GA_Link_C_ExecuteUbergraph_GA_Link");
static_assert(sizeof(GA_Link_C_ExecuteUbergraph_GA_Link) == 0x0005E0, "Wrong size on GA_Link_C_ExecuteUbergraph_GA_Link");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, EntryPoint) == 0x000000, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_MakeArray_Array) == 0x000008, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CustomEvent_EventTag_3) == 0x000018, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CustomEvent_EventTag_3' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CustomEvent_EventData_3) == 0x000020, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CustomEvent_EventData_3' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CustomEvent_EventTag_2) == 0x0000E0, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CustomEvent_EventTag_2' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CustomEvent_EventData_2) == 0x0000E8, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CustomEvent_EventData_2' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CreateDelegate_OutputDelegate_1) == 0x000198, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CustomEvent_EventTag_1) == 0x0001A8, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CustomEvent_EventTag_1' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CustomEvent_EventData_1) == 0x0001B0, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CustomEvent_EventData_1' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CreateDelegate_OutputDelegate_2) == 0x000260, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CustomEvent_EventTag) == 0x000270, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CustomEvent_EventData) == 0x000278, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CustomEvent_EventData' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CreateDelegate_OutputDelegate_3) == 0x000328, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, Temp_struct_Variable) == 0x000338, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, Temp_struct_Variable_1) == 0x0003E8, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, Temp_object_Variable) == 0x0003F0, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_Conv_IntToByte_ReturnValue) == 0x0003F8, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_GetValidValue_ReturnValue) == 0x0003F9, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_DynamicCast_AsCharacter_Interface) == 0x000400, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_DynamicCast_AsCharacter_Interface' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_DynamicCast_bSuccess) == 0x000410, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_DynamicCast_AsPlayer_Character) == 0x000418, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_DynamicCast_AsPlayer_Character' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_DynamicCast_bSuccess_1) == 0x000420, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_GetAnimInstance_ReturnValue) == 0x000428, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_GetRunningLinkID_ReturnValue) == 0x000430, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_GetRunningLinkID_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_GetLinkData_LinkData) == 0x000438, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_GetLinkData_LinkData' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_GetTimeScale_ReturnValue) == 0x000470, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_GetTimeScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_GetRideMotion_FoundData) == 0x000478, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_GetRideMotion_FoundData' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_GetRideMotion_ReturnValue) == 0x0004C0, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_GetRideMotion_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_PlayMontageAndWaitEvent_ReturnValue) == 0x0004C8, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_PlayMontageAndWaitEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_IsValid_ReturnValue) == 0x0004D0, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_Event_bWasCancelled) == 0x0004D1, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_DynamicCast_AsPlayer_Character_1) == 0x0004D8, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_DynamicCast_AsPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_DynamicCast_bSuccess_2) == 0x0004E0, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_DynamicCast_AsCharacter_Interface_1) == 0x0004E8, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_DynamicCast_AsCharacter_Interface_1' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_DynamicCast_bSuccess_3) == 0x0004F8, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_HasAttribute_ReturnValue) == 0x0004F9, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_HasAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CustomEvent_EventTag_4) == 0x0004FC, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CustomEvent_EventTag_4' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CustomEvent_EventData_4) == 0x000508, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CustomEvent_EventData_4' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_CreateDelegate_OutputDelegate_4) == 0x0005B8, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, K2Node_MakeArray_Array_1) == 0x0005C8, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_Array_Contains_ReturnValue) == 0x0005D8, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x0005D9, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_GetValidValue_ReturnValue_1) == 0x0005DA, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_GetValidValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Link_C_ExecuteUbergraph_GA_Link, CallFunc_Array_Contains_ReturnValue_1) == 0x0005DB, "Member 'GA_Link_C_ExecuteUbergraph_GA_Link::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");

// Function GA_Link.GA_Link_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Link_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Link_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Link_C_K2_OnEndAbility");
static_assert(sizeof(GA_Link_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Link_C_K2_OnEndAbility");
static_assert(offsetof(GA_Link_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Link_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Link.GA_Link_C.OnCompleted_890676F54015860AEA24AD98D7DC7322
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Link_C_OnCompleted_890676F54015860AEA24AD98D7DC7322 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Link_C_OnCompleted_890676F54015860AEA24AD98D7DC7322) == 0x000008, "Wrong alignment on GA_Link_C_OnCompleted_890676F54015860AEA24AD98D7DC7322");
static_assert(sizeof(GA_Link_C_OnCompleted_890676F54015860AEA24AD98D7DC7322) == 0x0000B8, "Wrong size on GA_Link_C_OnCompleted_890676F54015860AEA24AD98D7DC7322");
static_assert(offsetof(GA_Link_C_OnCompleted_890676F54015860AEA24AD98D7DC7322, EventTag) == 0x000000, "Member 'GA_Link_C_OnCompleted_890676F54015860AEA24AD98D7DC7322::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Link_C_OnCompleted_890676F54015860AEA24AD98D7DC7322, EventData) == 0x000008, "Member 'GA_Link_C_OnCompleted_890676F54015860AEA24AD98D7DC7322::EventData' has a wrong offset!");

// Function GA_Link.GA_Link_C.OnBlendOut_890676F54015860AEA24AD98D7DC7322
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Link_C_OnBlendOut_890676F54015860AEA24AD98D7DC7322 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Link_C_OnBlendOut_890676F54015860AEA24AD98D7DC7322) == 0x000008, "Wrong alignment on GA_Link_C_OnBlendOut_890676F54015860AEA24AD98D7DC7322");
static_assert(sizeof(GA_Link_C_OnBlendOut_890676F54015860AEA24AD98D7DC7322) == 0x0000B8, "Wrong size on GA_Link_C_OnBlendOut_890676F54015860AEA24AD98D7DC7322");
static_assert(offsetof(GA_Link_C_OnBlendOut_890676F54015860AEA24AD98D7DC7322, EventTag) == 0x000000, "Member 'GA_Link_C_OnBlendOut_890676F54015860AEA24AD98D7DC7322::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Link_C_OnBlendOut_890676F54015860AEA24AD98D7DC7322, EventData) == 0x000008, "Member 'GA_Link_C_OnBlendOut_890676F54015860AEA24AD98D7DC7322::EventData' has a wrong offset!");

// Function GA_Link.GA_Link_C.OnInterrupted_890676F54015860AEA24AD98D7DC7322
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Link_C_OnInterrupted_890676F54015860AEA24AD98D7DC7322 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Link_C_OnInterrupted_890676F54015860AEA24AD98D7DC7322) == 0x000008, "Wrong alignment on GA_Link_C_OnInterrupted_890676F54015860AEA24AD98D7DC7322");
static_assert(sizeof(GA_Link_C_OnInterrupted_890676F54015860AEA24AD98D7DC7322) == 0x0000B8, "Wrong size on GA_Link_C_OnInterrupted_890676F54015860AEA24AD98D7DC7322");
static_assert(offsetof(GA_Link_C_OnInterrupted_890676F54015860AEA24AD98D7DC7322, EventTag) == 0x000000, "Member 'GA_Link_C_OnInterrupted_890676F54015860AEA24AD98D7DC7322::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Link_C_OnInterrupted_890676F54015860AEA24AD98D7DC7322, EventData) == 0x000008, "Member 'GA_Link_C_OnInterrupted_890676F54015860AEA24AD98D7DC7322::EventData' has a wrong offset!");

// Function GA_Link.GA_Link_C.OnCancelled_890676F54015860AEA24AD98D7DC7322
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Link_C_OnCancelled_890676F54015860AEA24AD98D7DC7322 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Link_C_OnCancelled_890676F54015860AEA24AD98D7DC7322) == 0x000008, "Wrong alignment on GA_Link_C_OnCancelled_890676F54015860AEA24AD98D7DC7322");
static_assert(sizeof(GA_Link_C_OnCancelled_890676F54015860AEA24AD98D7DC7322) == 0x0000B8, "Wrong size on GA_Link_C_OnCancelled_890676F54015860AEA24AD98D7DC7322");
static_assert(offsetof(GA_Link_C_OnCancelled_890676F54015860AEA24AD98D7DC7322, EventTag) == 0x000000, "Member 'GA_Link_C_OnCancelled_890676F54015860AEA24AD98D7DC7322::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Link_C_OnCancelled_890676F54015860AEA24AD98D7DC7322, EventData) == 0x000008, "Member 'GA_Link_C_OnCancelled_890676F54015860AEA24AD98D7DC7322::EventData' has a wrong offset!");

// Function GA_Link.GA_Link_C.EventReceived_890676F54015860AEA24AD98D7DC7322
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Link_C_EventReceived_890676F54015860AEA24AD98D7DC7322 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Link_C_EventReceived_890676F54015860AEA24AD98D7DC7322) == 0x000008, "Wrong alignment on GA_Link_C_EventReceived_890676F54015860AEA24AD98D7DC7322");
static_assert(sizeof(GA_Link_C_EventReceived_890676F54015860AEA24AD98D7DC7322) == 0x0000B8, "Wrong size on GA_Link_C_EventReceived_890676F54015860AEA24AD98D7DC7322");
static_assert(offsetof(GA_Link_C_EventReceived_890676F54015860AEA24AD98D7DC7322, EventTag) == 0x000000, "Member 'GA_Link_C_EventReceived_890676F54015860AEA24AD98D7DC7322::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Link_C_EventReceived_890676F54015860AEA24AD98D7DC7322, EventData) == 0x000008, "Member 'GA_Link_C_EventReceived_890676F54015860AEA24AD98D7DC7322::EventData' has a wrong offset!");

}

