#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Link

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Link.GA_Link_C
// 0x0048 (0x0468 - 0x0420)
class UGA_Link_C final : public UActionGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FST_LinkData                           LinkData;                                          // 0x0428(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         PrevTimeScale;                                     // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Link(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnCompleted_890676F54015860AEA24AD98D7DC7322(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnBlendOut_890676F54015860AEA24AD98D7DC7322(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnInterrupted_890676F54015860AEA24AD98D7DC7322(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnCancelled_890676F54015860AEA24AD98D7DC7322(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void EventReceived_890676F54015860AEA24AD98D7DC7322(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Link_C">();
	}
	static class UGA_Link_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Link_C>();
	}
};
static_assert(alignof(UGA_Link_C) == 0x000008, "Wrong alignment on UGA_Link_C");
static_assert(sizeof(UGA_Link_C) == 0x000468, "Wrong size on UGA_Link_C");
static_assert(offsetof(UGA_Link_C, UberGraphFrame) == 0x000420, "Member 'UGA_Link_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Link_C, LinkData) == 0x000428, "Member 'UGA_Link_C::LinkData' has a wrong offset!");
static_assert(offsetof(UGA_Link_C, PrevTimeScale) == 0x000460, "Member 'UGA_Link_C::PrevTimeScale' has a wrong offset!");

}

