#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_EcoSleep

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_EcoSleep.GC_EcoSleep_C
// 0x0018 (0x02C0 - 0x02A8)
class AGC_EcoSleep_C final : public ADarwinGameplayCue
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AEffectBase*                            Effect;                                            // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_GC_EcoSleep(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_EcoSleep_C">();
	}
	static class AGC_EcoSleep_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_EcoSleep_C>();
	}
};
static_assert(alignof(AGC_EcoSleep_C) == 0x000008, "Wrong alignment on AGC_EcoSleep_C");
static_assert(sizeof(AGC_EcoSleep_C) == 0x0002C0, "Wrong size on AGC_EcoSleep_C");
static_assert(offsetof(AGC_EcoSleep_C, UberGraphFrame) == 0x0002A8, "Member 'AGC_EcoSleep_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_EcoSleep_C, DefaultSceneRoot) == 0x0002B0, "Member 'AGC_EcoSleep_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_EcoSleep_C, Effect) == 0x0002B8, "Member 'AGC_EcoSleep_C::Effect' has a wrong offset!");

}

