#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Ground

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Ground.GC_Ground_C.OnActive
// 0x00C8 (0x00C8 - 0x0000)
struct GC_Ground_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_Ground_C_OnActive) == 0x000008, "Wrong alignment on GC_Ground_C_OnActive");
static_assert(sizeof(GC_Ground_C_OnActive) == 0x0000C8, "Wrong size on GC_Ground_C_OnActive");
static_assert(offsetof(GC_Ground_C_OnActive, MyTarget) == 0x000000, "Member 'GC_Ground_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Ground_C_OnActive, Parameters) == 0x000008, "Member 'GC_Ground_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Ground_C_OnActive, ReturnValue) == 0x0000C0, "Member 'GC_Ground_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Ground_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x0000C1, "Member 'GC_Ground_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");

}

