#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Provocation

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Provocation.GC_Provocation_C.OnActive
// 0x00D8 (0x00D8 - 0x0000)
struct GC_Provocation_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnActive_ReturnValue;                     // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGPACharacter*                          K2Node_DynamicCast_AsGPACharacter;                 // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GC_Provocation_C_OnActive) == 0x000008, "Wrong alignment on GC_Provocation_C_OnActive");
static_assert(sizeof(GC_Provocation_C_OnActive) == 0x0000D8, "Wrong size on GC_Provocation_C_OnActive");
static_assert(offsetof(GC_Provocation_C_OnActive, MyTarget) == 0x000000, "Member 'GC_Provocation_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Provocation_C_OnActive, Parameters) == 0x000008, "Member 'GC_Provocation_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Provocation_C_OnActive, ReturnValue) == 0x0000C0, "Member 'GC_Provocation_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Provocation_C_OnActive, CallFunc_OnActive_ReturnValue) == 0x0000C1, "Member 'GC_Provocation_C_OnActive::CallFunc_OnActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Provocation_C_OnActive, K2Node_DynamicCast_AsGPACharacter) == 0x0000C8, "Member 'GC_Provocation_C_OnActive::K2Node_DynamicCast_AsGPACharacter' has a wrong offset!");
static_assert(offsetof(GC_Provocation_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'GC_Provocation_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

