#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LS_BossFinish

#include "Basic.hpp"

#include "DarwinGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LS_BossFinish.LS_BossFinish_SequenceDirector_C.ExecuteUbergraph_LS_BossFinish_SequenceDirector
// 0x04F8 (0x04F8 - 0x0000)
struct LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMonsterBase*                           K2Node_DynamicCast_AsMonster_Base;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEventSystemManager*                    CallFunc_GetInstance_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTalkEventSystem*                       CallFunc_GetTalkEventSystem_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_UIManager_C*                        CallFunc_GetBPUIManager_Result;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_Talk_WinStatus_C*                    CallFunc_GetTalkWindow_OutWidget;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_BossActor;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_UIManager_C*                        CallFunc_GetBPUIManager_Result_1;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGPACharacter*                          K2Node_DynamicCast_AsGPACharacter;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Fade_C*                              CallFunc_GetFade_OutWidget;                        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BossFinishTimer_C*                  K2Node_CustomEvent_BP_Boss_Finish_Timer_Event;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue_1;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_FC_RequestSocketNameFromKind_ResultSocket; // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_JumpToMarkedFrame_ReturnValue;            // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FC_AddOffSetLocation_AddOffsetLocation;   // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FC_AddOffSetLocation_SpringLength;        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UIManager_C*                        CallFunc_GetBPUIManager_Result_2;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Fade_C*                              CallFunc_GetFade_OutWidget_1;                      // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACineCameraActor*                       K2Node_CustomEvent_CineCamera;                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x00FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAttachParentActor_ReturnValue;         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGPACharacter*                          K2Node_DynamicCast_AsGPACharacter_1;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x01C8(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x01F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0290(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x031C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0328(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UIManager_C*                        CallFunc_GetBPUIManager_Result_3;                  // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_Fade_C*                              CallFunc_GetFade_OutWidget_2;                      // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x03D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D3[0x1];                                      // 0x03D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0420(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0444(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0464(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0470(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector) == 0x000008, "Wrong alignment on LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector");
static_assert(sizeof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector) == 0x0004F8, "Wrong size on LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, EntryPoint) == 0x000000, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::EntryPoint' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, K2Node_DynamicCast_AsMonster_Base) == 0x000008, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::K2Node_DynamicCast_AsMonster_Base' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_GetInstance_ReturnValue) == 0x000018, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_GetInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_MakeLiteralString_ReturnValue) == 0x000020, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_MakeLiteralString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_GetTalkEventSystem_ReturnValue) == 0x000030, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_GetTalkEventSystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_GetBPUIManager_Result) == 0x000038, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_GetBPUIManager_Result' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_GetTalkWindow_OutWidget) == 0x000040, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_GetTalkWindow_OutWidget' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_SetGamePaused_ReturnValue) == 0x000048, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, K2Node_CustomEvent_BossActor) == 0x000050, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::K2Node_CustomEvent_BossActor' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_GetBPUIManager_Result_1) == 0x000058, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_GetBPUIManager_Result_1' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, K2Node_DynamicCast_AsGPACharacter) == 0x000060, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::K2Node_DynamicCast_AsGPACharacter' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_GetFade_OutWidget) == 0x000070, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_GetFade_OutWidget' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_IsValid_ReturnValue_2) == 0x000079, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, K2Node_CreateDelegate_OutputDelegate) == 0x00007C, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, K2Node_CustomEvent_BP_Boss_Finish_Timer_Event) == 0x000090, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::K2Node_CustomEvent_BP_Boss_Finish_Timer_Event' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_SetGamePaused_ReturnValue_1) == 0x000098, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_SetGamePaused_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_FC_RequestSocketNameFromKind_ResultSocket) == 0x00009C, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_FC_RequestSocketNameFromKind_ResultSocket' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_JumpToMarkedFrame_ReturnValue) == 0x0000A4, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_JumpToMarkedFrame_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_FC_AddOffSetLocation_AddOffsetLocation) == 0x0000A8, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_FC_AddOffSetLocation_AddOffsetLocation' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_FC_AddOffSetLocation_SpringLength) == 0x0000B4, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_FC_AddOffSetLocation_SpringLength' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_MakeVector_ReturnValue) == 0x0000B8, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_GetBPUIManager_Result_2) == 0x0000C8, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_GetBPUIManager_Result_2' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_IsValid_ReturnValue_3) == 0x0000D0, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_GetFade_OutWidget_1) == 0x0000D8, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_GetFade_OutWidget_1' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_IsValid_ReturnValue_4) == 0x0000E0, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, K2Node_CustomEvent_CineCamera) == 0x0000E8, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::K2Node_CustomEvent_CineCamera' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000F0, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x0000FC, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_GetAttachParentActor_ReturnValue) == 0x000188, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_GetAttachParentActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, K2Node_DynamicCast_AsGPACharacter_1) == 0x000190, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::K2Node_DynamicCast_AsGPACharacter_1' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, K2Node_DynamicCast_bSuccess_2) == 0x000198, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_IsValid_ReturnValue_5) == 0x000199, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_IsValid_ReturnValue_6) == 0x00019A, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_DoesSocketExist_ReturnValue) == 0x00019B, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_GetSocketLocation_ReturnValue) == 0x00019C, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_Add_VectorVector_ReturnValue) == 0x0001A8, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001B4, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, K2Node_MakeArray_Array) == 0x0001C8, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_MakeVector_ReturnValue_1) == 0x0001D8, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001E4, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0001F0, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_Normal_ReturnValue) == 0x000278, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000284, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000290, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000318, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_Add_VectorVector_ReturnValue_1) == 0x00031C, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_SphereTraceSingle_OutHit) == 0x000328, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_SphereTraceSingle_ReturnValue) == 0x0003B0, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_GetBPUIManager_Result_3) == 0x0003B8, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_GetBPUIManager_Result_3' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_IsValid_ReturnValue_7) == 0x0003C0, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_GetFade_OutWidget_2) == 0x0003C8, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_GetFade_OutWidget_2' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_IsValid_ReturnValue_8) == 0x0003D0, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_bBlockingHit) == 0x0003D1, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_bInitialOverlap) == 0x0003D2, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_Time) == 0x0003D4, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_Distance) == 0x0003D8, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_Location) == 0x0003DC, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_ImpactPoint) == 0x0003E8, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_Normal) == 0x0003F4, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_ImpactNormal) == 0x000400, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_PhysMat) == 0x000410, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_HitActor) == 0x000418, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_HitComponent) == 0x000420, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_HitBoneName) == 0x000428, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_HitItem) == 0x000430, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_FaceIndex) == 0x000434, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_TraceStart) == 0x000438, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_BreakHitResult_TraceEnd) == 0x000444, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000450, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_VSize_ReturnValue) == 0x00045C, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000460, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_MakeVector_ReturnValue_2) == 0x000464, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000470, "Member 'LS_BossFinish_SequenceDirector_C_ExecuteUbergraph_LS_BossFinish_SequenceDirector::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");

// Function LS_BossFinish.LS_BossFinish_SequenceDirector_C.CEV_UseSocketPosition
// 0x0008 (0x0008 - 0x0000)
struct LS_BossFinish_SequenceDirector_C_CEV_UseSocketPosition final
{
public:
	class ACineCameraActor*                       CineCamera;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_BossFinish_SequenceDirector_C_CEV_UseSocketPosition) == 0x000008, "Wrong alignment on LS_BossFinish_SequenceDirector_C_CEV_UseSocketPosition");
static_assert(sizeof(LS_BossFinish_SequenceDirector_C_CEV_UseSocketPosition) == 0x000008, "Wrong size on LS_BossFinish_SequenceDirector_C_CEV_UseSocketPosition");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_CEV_UseSocketPosition, CineCamera) == 0x000000, "Member 'LS_BossFinish_SequenceDirector_C_CEV_UseSocketPosition::CineCamera' has a wrong offset!");

// Function LS_BossFinish.LS_BossFinish_SequenceDirector_C.CEV_InitTimer
// 0x0008 (0x0008 - 0x0000)
struct LS_BossFinish_SequenceDirector_C_CEV_InitTimer final
{
public:
	class ABP_BossFinishTimer_C*                  BP_Boss_Finish_Timer_Event;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_BossFinish_SequenceDirector_C_CEV_InitTimer) == 0x000008, "Wrong alignment on LS_BossFinish_SequenceDirector_C_CEV_InitTimer");
static_assert(sizeof(LS_BossFinish_SequenceDirector_C_CEV_InitTimer) == 0x000008, "Wrong size on LS_BossFinish_SequenceDirector_C_CEV_InitTimer");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_CEV_InitTimer, BP_Boss_Finish_Timer_Event) == 0x000000, "Member 'LS_BossFinish_SequenceDirector_C_CEV_InitTimer::BP_Boss_Finish_Timer_Event' has a wrong offset!");

// Function LS_BossFinish.LS_BossFinish_SequenceDirector_C.CEV_GetBossInit
// 0x0008 (0x0008 - 0x0000)
struct LS_BossFinish_SequenceDirector_C_CEV_GetBossInit final
{
public:
	class AActor*                                 BossActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_BossFinish_SequenceDirector_C_CEV_GetBossInit) == 0x000008, "Wrong alignment on LS_BossFinish_SequenceDirector_C_CEV_GetBossInit");
static_assert(sizeof(LS_BossFinish_SequenceDirector_C_CEV_GetBossInit) == 0x000008, "Wrong size on LS_BossFinish_SequenceDirector_C_CEV_GetBossInit");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_CEV_GetBossInit, BossActor) == 0x000000, "Member 'LS_BossFinish_SequenceDirector_C_CEV_GetBossInit::BossActor' has a wrong offset!");

// Function LS_BossFinish.LS_BossFinish_SequenceDirector_C.FC_RequestSocketNameFromKind
// 0x0014 (0x0014 - 0x0000)
struct LS_BossFinish_SequenceDirector_C_FC_RequestSocketNameFromKind final
{
public:
	class FName                                   ResultSocket;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetOriginKindID_ReturnValue;              // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LS_BossFinish_SequenceDirector_C_FC_RequestSocketNameFromKind) == 0x000004, "Wrong alignment on LS_BossFinish_SequenceDirector_C_FC_RequestSocketNameFromKind");
static_assert(sizeof(LS_BossFinish_SequenceDirector_C_FC_RequestSocketNameFromKind) == 0x000014, "Wrong size on LS_BossFinish_SequenceDirector_C_FC_RequestSocketNameFromKind");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_RequestSocketNameFromKind, ResultSocket) == 0x000000, "Member 'LS_BossFinish_SequenceDirector_C_FC_RequestSocketNameFromKind::ResultSocket' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_RequestSocketNameFromKind, CallFunc_GetOriginKindID_ReturnValue) == 0x000008, "Member 'LS_BossFinish_SequenceDirector_C_FC_RequestSocketNameFromKind::CallFunc_GetOriginKindID_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_RequestSocketNameFromKind, K2Node_SwitchName_CmpSuccess) == 0x000010, "Member 'LS_BossFinish_SequenceDirector_C_FC_RequestSocketNameFromKind::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function LS_BossFinish.LS_BossFinish_SequenceDirector_C.FC_AddOffSetLocation
// 0x001C (0x001C - 0x0000)
struct LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation final
{
public:
	struct FVector                                AddOffsetLocation;                                 // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpringLength;                                      // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetOriginKindID_ReturnValue;              // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEffectSizeID                                 CallFunc_GetEffectSize_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation) == 0x000004, "Wrong alignment on LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation");
static_assert(sizeof(LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation) == 0x00001C, "Wrong size on LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation, AddOffsetLocation) == 0x000000, "Member 'LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation::AddOffsetLocation' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation, SpringLength) == 0x00000C, "Member 'LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation::SpringLength' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation, CallFunc_GetOriginKindID_ReturnValue) == 0x000010, "Member 'LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation::CallFunc_GetOriginKindID_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation, CallFunc_GetEffectSize_ReturnValue) == 0x000018, "Member 'LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation::CallFunc_GetEffectSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation, CallFunc_NotEqual_NameName_ReturnValue) == 0x000019, "Member 'LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'LS_BossFinish_SequenceDirector_C_FC_AddOffSetLocation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function LS_BossFinish.LS_BossFinish_SequenceDirector_C.FC_IsSilverBones
// 0x0020 (0x0020 - 0x0000)
struct LS_BossFinish_SequenceDirector_C_FC_IsSilverBones final
{
public:
	class AGPACharacter*                          Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBoss;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMonsterBoss*                           K2Node_DynamicCast_AsMonster_Boss;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMonsterBossType                              CallFunc_GetBossType_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LS_BossFinish_SequenceDirector_C_FC_IsSilverBones) == 0x000008, "Wrong alignment on LS_BossFinish_SequenceDirector_C_FC_IsSilverBones");
static_assert(sizeof(LS_BossFinish_SequenceDirector_C_FC_IsSilverBones) == 0x000020, "Wrong size on LS_BossFinish_SequenceDirector_C_FC_IsSilverBones");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_IsSilverBones, Character) == 0x000000, "Member 'LS_BossFinish_SequenceDirector_C_FC_IsSilverBones::Character' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_IsSilverBones, IsBoss) == 0x000008, "Member 'LS_BossFinish_SequenceDirector_C_FC_IsSilverBones::IsBoss' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_IsSilverBones, K2Node_DynamicCast_AsMonster_Boss) == 0x000010, "Member 'LS_BossFinish_SequenceDirector_C_FC_IsSilverBones::K2Node_DynamicCast_AsMonster_Boss' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_IsSilverBones, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'LS_BossFinish_SequenceDirector_C_FC_IsSilverBones::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_IsSilverBones, CallFunc_GetBossType_ReturnValue) == 0x000019, "Member 'LS_BossFinish_SequenceDirector_C_FC_IsSilverBones::CallFunc_GetBossType_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_IsSilverBones, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'LS_BossFinish_SequenceDirector_C_FC_IsSilverBones::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_IsSilverBones, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00001B, "Member 'LS_BossFinish_SequenceDirector_C_FC_IsSilverBones::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_FC_IsSilverBones, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'LS_BossFinish_SequenceDirector_C_FC_IsSilverBones::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function LS_BossFinish.LS_BossFinish_SequenceDirector_C.SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_3
// 0x0008 (0x0008 - 0x0000)
struct LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_3 final
{
public:
	class AActor*                                 BossActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_3) == 0x000008, "Wrong alignment on LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_3");
static_assert(sizeof(LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_3) == 0x000008, "Wrong size on LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_3");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_3, BossActor) == 0x000000, "Member 'LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_3::BossActor' has a wrong offset!");

// Function LS_BossFinish.LS_BossFinish_SequenceDirector_C.SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_4
// 0x0008 (0x0008 - 0x0000)
struct LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_4 final
{
public:
	class ABP_BossFinishTimer_C*                  BP_Boss_Finish_Timer_Event;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_4) == 0x000008, "Wrong alignment on LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_4");
static_assert(sizeof(LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_4) == 0x000008, "Wrong size on LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_4");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_4, BP_Boss_Finish_Timer_Event) == 0x000000, "Member 'LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_4::BP_Boss_Finish_Timer_Event' has a wrong offset!");

// Function LS_BossFinish.LS_BossFinish_SequenceDirector_C.SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_6
// 0x0008 (0x0008 - 0x0000)
struct LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_6 final
{
public:
	class ACineCameraActor*                       CineCamera;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_6) == 0x000008, "Wrong alignment on LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_6");
static_assert(sizeof(LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_6) == 0x000008, "Wrong size on LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_6");
static_assert(offsetof(LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_6, CineCamera) == 0x000000, "Member 'LS_BossFinish_SequenceDirector_C_SequenceEvent__ENTRYPOINTLS_BossFinish_SequenceDirector_6::CineCamera' has a wrong offset!");

}

