#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Menu_Page_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Menu_Page_01.Menu_Page_01_C
// 0x0020 (0x0520 - 0x0500)
class UMenu_Page_01_C final : public UUITabLRItemBase
{
public:
	class UWidgetAnimation*                       on;                                                // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       off;                                               // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base;                                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Page;                                              // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Menu_Page_01_C">();
	}
	static class UMenu_Page_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenu_Page_01_C>();
	}
};
static_assert(alignof(UMenu_Page_01_C) == 0x000008, "Wrong alignment on UMenu_Page_01_C");
static_assert(sizeof(UMenu_Page_01_C) == 0x000520, "Wrong size on UMenu_Page_01_C");
static_assert(offsetof(UMenu_Page_01_C, on) == 0x000500, "Member 'UMenu_Page_01_C::on' has a wrong offset!");
static_assert(offsetof(UMenu_Page_01_C, off) == 0x000508, "Member 'UMenu_Page_01_C::off' has a wrong offset!");
static_assert(offsetof(UMenu_Page_01_C, Base) == 0x000510, "Member 'UMenu_Page_01_C::Base' has a wrong offset!");
static_assert(offsetof(UMenu_Page_01_C, Page) == 0x000518, "Member 'UMenu_Page_01_C::Page' has a wrong offset!");

}

