#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_SimultaneousKey

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "DarwinGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_SimultaneousKey.ST_SimultaneousKey
// 0x0010 (0x0010 - 0x0000)
struct FST_SimultaneousKey final
{
public:
	struct FGameplayTag                           ActionTag_20_AE2FECAF43F0F7D66F6C77AE70B40667;     // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         Priority_18_2867813041251A11F3B4DAADFA64CA78;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAxisMappingType                              RequiredKey1_13_65A660D3484D9808C22A2399515624A4;  // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAxisMappingType                              RequiredKey2_15_6ED7A3D545F761B44CF684AB55223FA0;  // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_SimultaneousKey) == 0x000004, "Wrong alignment on FST_SimultaneousKey");
static_assert(sizeof(FST_SimultaneousKey) == 0x000010, "Wrong size on FST_SimultaneousKey");
static_assert(offsetof(FST_SimultaneousKey, ActionTag_20_AE2FECAF43F0F7D66F6C77AE70B40667) == 0x000000, "Member 'FST_SimultaneousKey::ActionTag_20_AE2FECAF43F0F7D66F6C77AE70B40667' has a wrong offset!");
static_assert(offsetof(FST_SimultaneousKey, Priority_18_2867813041251A11F3B4DAADFA64CA78) == 0x000008, "Member 'FST_SimultaneousKey::Priority_18_2867813041251A11F3B4DAADFA64CA78' has a wrong offset!");
static_assert(offsetof(FST_SimultaneousKey, RequiredKey1_13_65A660D3484D9808C22A2399515624A4) == 0x00000C, "Member 'FST_SimultaneousKey::RequiredKey1_13_65A660D3484D9808C22A2399515624A4' has a wrong offset!");
static_assert(offsetof(FST_SimultaneousKey, RequiredKey2_15_6ED7A3D545F761B44CF684AB55223FA0) == 0x00000D, "Member 'FST_SimultaneousKey::RequiredKey2_15_6ED7A3D545F761B44CF684AB55223FA0' has a wrong offset!");

}

