#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Alert_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Alert_01.W_Alert_01_C
// 0x0020 (0x0638 - 0x0618)
class UW_Alert_01_C final : public UUIAlert_01
{
public:
	class UWidgetAnimation*                       Alert_Out;                                         // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Alert_In;                                          // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Alert;                                             // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Alert_02;                                          // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Alert_01_C">();
	}
	static class UW_Alert_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Alert_01_C>();
	}
};
static_assert(alignof(UW_Alert_01_C) == 0x000008, "Wrong alignment on UW_Alert_01_C");
static_assert(sizeof(UW_Alert_01_C) == 0x000638, "Wrong size on UW_Alert_01_C");
static_assert(offsetof(UW_Alert_01_C, Alert_Out) == 0x000618, "Member 'UW_Alert_01_C::Alert_Out' has a wrong offset!");
static_assert(offsetof(UW_Alert_01_C, Alert_In) == 0x000620, "Member 'UW_Alert_01_C::Alert_In' has a wrong offset!");
static_assert(offsetof(UW_Alert_01_C, Alert) == 0x000628, "Member 'UW_Alert_01_C::Alert' has a wrong offset!");
static_assert(offsetof(UW_Alert_01_C, Alert_02) == 0x000630, "Member 'UW_Alert_01_C::Alert_02' has a wrong offset!");

}

