#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Alert_00

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Alert_00.W_Alert_00_C
// 0x0058 (0x0690 - 0x0638)
class UW_Alert_00_C final : public UUIAlert_00
{
public:
	class UWidgetAnimation*                       Alert_Out;                                         // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Alert_In;                                          // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Alert;                                             // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Alert_02;                                          // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top_Icon_0;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top_Icon_1;                                        // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top_Icon_2;                                        // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top_Icon_3;                                        // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top_Icon_4;                                        // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top_Icon_5;                                        // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Top_Icon_6;                                        // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Alert_00_C">();
	}
	static class UW_Alert_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Alert_00_C>();
	}
};
static_assert(alignof(UW_Alert_00_C) == 0x000008, "Wrong alignment on UW_Alert_00_C");
static_assert(sizeof(UW_Alert_00_C) == 0x000690, "Wrong size on UW_Alert_00_C");
static_assert(offsetof(UW_Alert_00_C, Alert_Out) == 0x000638, "Member 'UW_Alert_00_C::Alert_Out' has a wrong offset!");
static_assert(offsetof(UW_Alert_00_C, Alert_In) == 0x000640, "Member 'UW_Alert_00_C::Alert_In' has a wrong offset!");
static_assert(offsetof(UW_Alert_00_C, Alert) == 0x000648, "Member 'UW_Alert_00_C::Alert' has a wrong offset!");
static_assert(offsetof(UW_Alert_00_C, Alert_02) == 0x000650, "Member 'UW_Alert_00_C::Alert_02' has a wrong offset!");
static_assert(offsetof(UW_Alert_00_C, Top_Icon_0) == 0x000658, "Member 'UW_Alert_00_C::Top_Icon_0' has a wrong offset!");
static_assert(offsetof(UW_Alert_00_C, Top_Icon_1) == 0x000660, "Member 'UW_Alert_00_C::Top_Icon_1' has a wrong offset!");
static_assert(offsetof(UW_Alert_00_C, Top_Icon_2) == 0x000668, "Member 'UW_Alert_00_C::Top_Icon_2' has a wrong offset!");
static_assert(offsetof(UW_Alert_00_C, Top_Icon_3) == 0x000670, "Member 'UW_Alert_00_C::Top_Icon_3' has a wrong offset!");
static_assert(offsetof(UW_Alert_00_C, Top_Icon_4) == 0x000678, "Member 'UW_Alert_00_C::Top_Icon_4' has a wrong offset!");
static_assert(offsetof(UW_Alert_00_C, Top_Icon_5) == 0x000680, "Member 'UW_Alert_00_C::Top_Icon_5' has a wrong offset!");
static_assert(offsetof(UW_Alert_00_C, Top_Icon_6) == 0x000688, "Member 'UW_Alert_00_C::Top_Icon_6' has a wrong offset!");

}

