#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Artifact_ItemIcon

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Artifact_ItemIcon.W_Artifact_ItemIcon_C
// 0x0070 (0x0538 - 0x04C8)
class UW_Artifact_ItemIcon_C final : public UUIArtifact_ItemIcon
{
public:
	class UWidgetAnimation*                       Number_Off;                                        // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gray_Out;                                          // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gray_On;                                           // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemIcon_Off;                                      // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemIcon_On;                                       // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_1;                                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_2;                                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_3;                                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconBase;                                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconBase_1;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconGray;                                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconItem;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconRank;                                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Artifact_ItemIcon_C">();
	}
	static class UW_Artifact_ItemIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Artifact_ItemIcon_C>();
	}
};
static_assert(alignof(UW_Artifact_ItemIcon_C) == 0x000008, "Wrong alignment on UW_Artifact_ItemIcon_C");
static_assert(sizeof(UW_Artifact_ItemIcon_C) == 0x000538, "Wrong size on UW_Artifact_ItemIcon_C");
static_assert(offsetof(UW_Artifact_ItemIcon_C, Number_Off) == 0x0004C8, "Member 'UW_Artifact_ItemIcon_C::Number_Off' has a wrong offset!");
static_assert(offsetof(UW_Artifact_ItemIcon_C, Gray_Out) == 0x0004D0, "Member 'UW_Artifact_ItemIcon_C::Gray_Out' has a wrong offset!");
static_assert(offsetof(UW_Artifact_ItemIcon_C, Gray_On) == 0x0004D8, "Member 'UW_Artifact_ItemIcon_C::Gray_On' has a wrong offset!");
static_assert(offsetof(UW_Artifact_ItemIcon_C, ItemIcon_Off) == 0x0004E0, "Member 'UW_Artifact_ItemIcon_C::ItemIcon_Off' has a wrong offset!");
static_assert(offsetof(UW_Artifact_ItemIcon_C, ItemIcon_On) == 0x0004E8, "Member 'UW_Artifact_ItemIcon_C::ItemIcon_On' has a wrong offset!");
static_assert(offsetof(UW_Artifact_ItemIcon_C, Frame) == 0x0004F0, "Member 'UW_Artifact_ItemIcon_C::Frame' has a wrong offset!");
static_assert(offsetof(UW_Artifact_ItemIcon_C, Frame_1) == 0x0004F8, "Member 'UW_Artifact_ItemIcon_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UW_Artifact_ItemIcon_C, Frame_2) == 0x000500, "Member 'UW_Artifact_ItemIcon_C::Frame_2' has a wrong offset!");
static_assert(offsetof(UW_Artifact_ItemIcon_C, Frame_3) == 0x000508, "Member 'UW_Artifact_ItemIcon_C::Frame_3' has a wrong offset!");
static_assert(offsetof(UW_Artifact_ItemIcon_C, IconBase) == 0x000510, "Member 'UW_Artifact_ItemIcon_C::IconBase' has a wrong offset!");
static_assert(offsetof(UW_Artifact_ItemIcon_C, IconBase_1) == 0x000518, "Member 'UW_Artifact_ItemIcon_C::IconBase_1' has a wrong offset!");
static_assert(offsetof(UW_Artifact_ItemIcon_C, IconGray) == 0x000520, "Member 'UW_Artifact_ItemIcon_C::IconGray' has a wrong offset!");
static_assert(offsetof(UW_Artifact_ItemIcon_C, IconItem) == 0x000528, "Member 'UW_Artifact_ItemIcon_C::IconItem' has a wrong offset!");
static_assert(offsetof(UW_Artifact_ItemIcon_C, IconRank) == 0x000530, "Member 'UW_Artifact_ItemIcon_C::IconRank' has a wrong offset!");

}

