#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BossGauge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "W_GaugeBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BossGauge.W_BossGauge_C
// 0x0028 (0x0518 - 0x04F0)
class UW_BossGauge_C : public UW_GaugeBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeFixProgressBar*                    Gauge_Base;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeFixProgressBar*                    Gauge_Gradually;                                   // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeFixProgressBar*                    Gauge_Param;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeFixImage*                          Image_Flame;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_BossGauge(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_BossGauge_C">();
	}
	static class UW_BossGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_BossGauge_C>();
	}
};
static_assert(alignof(UW_BossGauge_C) == 0x000008, "Wrong alignment on UW_BossGauge_C");
static_assert(sizeof(UW_BossGauge_C) == 0x000518, "Wrong size on UW_BossGauge_C");
static_assert(offsetof(UW_BossGauge_C, UberGraphFrame) == 0x0004F0, "Member 'UW_BossGauge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_BossGauge_C, Gauge_Base) == 0x0004F8, "Member 'UW_BossGauge_C::Gauge_Base' has a wrong offset!");
static_assert(offsetof(UW_BossGauge_C, Gauge_Gradually) == 0x000500, "Member 'UW_BossGauge_C::Gauge_Gradually' has a wrong offset!");
static_assert(offsetof(UW_BossGauge_C, Gauge_Param) == 0x000508, "Member 'UW_BossGauge_C::Gauge_Param' has a wrong offset!");
static_assert(offsetof(UW_BossGauge_C, Image_Flame) == 0x000510, "Member 'UW_BossGauge_C::Image_Flame' has a wrong offset!");

}

