#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ButtonArrow

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ButtonArrow.W_ButtonArrow_C
// 0x0028 (0x04C0 - 0x0498)
class UW_ButtonArrow_C final : public UUIButtonArrow
{
public:
	class UWidgetAnimation*                       Push_W_ButtonArrow_C;                              // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on_W_ButtonArrow_C;                                // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       off_W_ButtonArrow_C;                               // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_U;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ArrowBase_U;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_ButtonArrow_C">();
	}
	static class UW_ButtonArrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ButtonArrow_C>();
	}
};
static_assert(alignof(UW_ButtonArrow_C) == 0x000008, "Wrong alignment on UW_ButtonArrow_C");
static_assert(sizeof(UW_ButtonArrow_C) == 0x0004C0, "Wrong size on UW_ButtonArrow_C");
static_assert(offsetof(UW_ButtonArrow_C, Push_W_ButtonArrow_C) == 0x000498, "Member 'UW_ButtonArrow_C::Push_W_ButtonArrow_C' has a wrong offset!");
static_assert(offsetof(UW_ButtonArrow_C, on_W_ButtonArrow_C) == 0x0004A0, "Member 'UW_ButtonArrow_C::on_W_ButtonArrow_C' has a wrong offset!");
static_assert(offsetof(UW_ButtonArrow_C, off_W_ButtonArrow_C) == 0x0004A8, "Member 'UW_ButtonArrow_C::off_W_ButtonArrow_C' has a wrong offset!");
static_assert(offsetof(UW_ButtonArrow_C, Arrow_U) == 0x0004B0, "Member 'UW_ButtonArrow_C::Arrow_U' has a wrong offset!");
static_assert(offsetof(UW_ButtonArrow_C, ArrowBase_U) == 0x0004B8, "Member 'UW_ButtonArrow_C::ArrowBase_U' has a wrong offset!");

}

