#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_CharAdd_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_CharAdd_01.W_CharAdd_01_C
// 0x0028 (0x0538 - 0x0510)
class UW_CharAdd_01_C final : public UUICharAdd_01
{
public:
	class UWidgetAnimation*                       PressA_In;                                         // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PressA_Off;                                        // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PressA_Wait;                                       // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon_1;                                            // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_CharAdd_01_C">();
	}
	static class UW_CharAdd_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_CharAdd_01_C>();
	}
};
static_assert(alignof(UW_CharAdd_01_C) == 0x000008, "Wrong alignment on UW_CharAdd_01_C");
static_assert(sizeof(UW_CharAdd_01_C) == 0x000538, "Wrong size on UW_CharAdd_01_C");
static_assert(offsetof(UW_CharAdd_01_C, PressA_In) == 0x000510, "Member 'UW_CharAdd_01_C::PressA_In' has a wrong offset!");
static_assert(offsetof(UW_CharAdd_01_C, PressA_Off) == 0x000518, "Member 'UW_CharAdd_01_C::PressA_Off' has a wrong offset!");
static_assert(offsetof(UW_CharAdd_01_C, PressA_Wait) == 0x000520, "Member 'UW_CharAdd_01_C::PressA_Wait' has a wrong offset!");
static_assert(offsetof(UW_CharAdd_01_C, In) == 0x000528, "Member 'UW_CharAdd_01_C::In' has a wrong offset!");
static_assert(offsetof(UW_CharAdd_01_C, Icon_1) == 0x000530, "Member 'UW_CharAdd_01_C::Icon_1' has a wrong offset!");

}

