#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Commonmenu_04

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Commonmenu_04.W_Commonmenu_04_C
// 0x01F0 (0x0880 - 0x0690)
class UW_Commonmenu_04_C final : public UUICommonmenu_04
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ItemName_On;                                       // 0x0698(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Sentence_On;                                       // 0x06A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Panel_On;                                          // 0x06A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Panel_Off;                                         // 0x06B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x06B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x06C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ScrollBase_01;                                     // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBase_02;                                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_10;                          // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_11;                          // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_12;                          // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_13;                          // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_14;                          // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_15;                          // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_16;                          // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_17;                          // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_18;                          // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_19;                          // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_20;                          // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_21;                          // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_22;                          // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_23;                          // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_24;                          // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_25;                          // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_26;                          // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_27;                          // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_28;                          // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_29;                          // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_30;                          // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_31;                          // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_32;                          // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_33;                          // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_34;                          // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_35;                          // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_36;                          // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_37;                          // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_38;                          // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_39;                          // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_40;                          // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_41;                          // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_42;                          // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_43;                          // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_44;                          // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_45;                          // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_46;                          // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_47;                          // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_48;                          // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_01;                          // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_02;                          // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_03;                          // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_04;                          // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_05;                          // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_06;                          // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_07;                          // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_08;                          // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_ItemChoice_C*               W_Artifact_ItemChoice_09;                          // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_ItemName_C*               W_Commonmenu_ItemName;                             // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_Sentence_C*               W_Commonmenu_Sentence;                             // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_SortIcon_C*               W_Commonmenu_SortIcon;                             // 0x0868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Commonmenu_04(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Commonmenu_04_C">();
	}
	static class UW_Commonmenu_04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Commonmenu_04_C>();
	}
};
static_assert(alignof(UW_Commonmenu_04_C) == 0x000010, "Wrong alignment on UW_Commonmenu_04_C");
static_assert(sizeof(UW_Commonmenu_04_C) == 0x000880, "Wrong size on UW_Commonmenu_04_C");
static_assert(offsetof(UW_Commonmenu_04_C, UberGraphFrame) == 0x000690, "Member 'UW_Commonmenu_04_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, ItemName_On) == 0x000698, "Member 'UW_Commonmenu_04_C::ItemName_On' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, Sentence_On) == 0x0006A0, "Member 'UW_Commonmenu_04_C::Sentence_On' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, Panel_On) == 0x0006A8, "Member 'UW_Commonmenu_04_C::Panel_On' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, Panel_Off) == 0x0006B0, "Member 'UW_Commonmenu_04_C::Panel_Off' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, Out) == 0x0006B8, "Member 'UW_Commonmenu_04_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, In) == 0x0006C0, "Member 'UW_Commonmenu_04_C::In' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, ScrollBase_01) == 0x0006C8, "Member 'UW_Commonmenu_04_C::ScrollBase_01' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, ScrollBase_02) == 0x0006D0, "Member 'UW_Commonmenu_04_C::ScrollBase_02' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_10) == 0x0006D8, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_10' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_11) == 0x0006E0, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_11' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_12) == 0x0006E8, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_12' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_13) == 0x0006F0, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_13' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_14) == 0x0006F8, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_14' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_15) == 0x000700, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_15' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_16) == 0x000708, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_16' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_17) == 0x000710, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_17' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_18) == 0x000718, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_18' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_19) == 0x000720, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_19' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_20) == 0x000728, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_20' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_21) == 0x000730, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_21' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_22) == 0x000738, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_22' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_23) == 0x000740, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_23' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_24) == 0x000748, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_24' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_25) == 0x000750, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_25' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_26) == 0x000758, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_26' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_27) == 0x000760, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_27' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_28) == 0x000768, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_28' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_29) == 0x000770, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_29' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_30) == 0x000778, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_30' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_31) == 0x000780, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_31' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_32) == 0x000788, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_32' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_33) == 0x000790, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_33' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_34) == 0x000798, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_34' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_35) == 0x0007A0, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_35' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_36) == 0x0007A8, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_36' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_37) == 0x0007B0, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_37' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_38) == 0x0007B8, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_38' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_39) == 0x0007C0, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_39' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_40) == 0x0007C8, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_40' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_41) == 0x0007D0, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_41' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_42) == 0x0007D8, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_42' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_43) == 0x0007E0, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_43' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_44) == 0x0007E8, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_44' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_45) == 0x0007F0, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_45' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_46) == 0x0007F8, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_46' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_47) == 0x000800, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_47' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_48) == 0x000808, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_48' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_01) == 0x000810, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_01' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_02) == 0x000818, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_02' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_03) == 0x000820, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_03' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_04) == 0x000828, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_04' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_05) == 0x000830, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_05' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_06) == 0x000838, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_06' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_07) == 0x000840, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_07' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_08) == 0x000848, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_08' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Artifact_ItemChoice_09) == 0x000850, "Member 'UW_Commonmenu_04_C::W_Artifact_ItemChoice_09' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Commonmenu_ItemName) == 0x000858, "Member 'UW_Commonmenu_04_C::W_Commonmenu_ItemName' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Commonmenu_Sentence) == 0x000860, "Member 'UW_Commonmenu_04_C::W_Commonmenu_Sentence' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Commonmenu_SortIcon) == 0x000868, "Member 'UW_Commonmenu_04_C::W_Commonmenu_SortIcon' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_04_C, W_Menu_IconArrow) == 0x000870, "Member 'UW_Commonmenu_04_C::W_Menu_IconArrow' has a wrong offset!");

}

