#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Commonmenu_sentence

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Commonmenu_sentence.W_Commonmenu_Sentence_C
// 0x0038 (0x04D0 - 0x0498)
class UW_Commonmenu_Sentence_C final : public UUICommonmenu_Sentence
{
public:
	class UWidgetAnimation*                       Bullet;                                            // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Food;                                              // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DescriptionBase_01;                                // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DescriptionBase_02;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleBase_Long;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Itemmenu_SatisfactGauge_C*           W_Itemmenu_SatisfactGauge;                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SideScrollTextWidget_C*              W_SideScrollTextWidget;                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Commonmenu_Sentence_C">();
	}
	static class UW_Commonmenu_Sentence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Commonmenu_Sentence_C>();
	}
};
static_assert(alignof(UW_Commonmenu_Sentence_C) == 0x000008, "Wrong alignment on UW_Commonmenu_Sentence_C");
static_assert(sizeof(UW_Commonmenu_Sentence_C) == 0x0004D0, "Wrong size on UW_Commonmenu_Sentence_C");
static_assert(offsetof(UW_Commonmenu_Sentence_C, Bullet) == 0x000498, "Member 'UW_Commonmenu_Sentence_C::Bullet' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_Sentence_C, Food) == 0x0004A0, "Member 'UW_Commonmenu_Sentence_C::Food' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_Sentence_C, DescriptionBase_01) == 0x0004A8, "Member 'UW_Commonmenu_Sentence_C::DescriptionBase_01' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_Sentence_C, DescriptionBase_02) == 0x0004B0, "Member 'UW_Commonmenu_Sentence_C::DescriptionBase_02' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_Sentence_C, TitleBase_Long) == 0x0004B8, "Member 'UW_Commonmenu_Sentence_C::TitleBase_Long' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_Sentence_C, W_Itemmenu_SatisfactGauge) == 0x0004C0, "Member 'UW_Commonmenu_Sentence_C::W_Itemmenu_SatisfactGauge' has a wrong offset!");
static_assert(offsetof(UW_Commonmenu_Sentence_C, W_SideScrollTextWidget) == 0x0004C8, "Member 'UW_Commonmenu_Sentence_C::W_SideScrollTextWidget' has a wrong offset!");

}

