#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Coin_Color

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Coin_Color.W_Coin_Color_C
// 0x00C0 (0x05A0 - 0x04E0)
class UW_Coin_Color_C final : public UUICoinMenu_Coin_Color
{
public:
	class UWidgetAnimation*                       off;                                               // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color_Rainbow;                                     // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color_Gold;                                        // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color_Silver;                                      // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color_Copper;                                      // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Type_004;                                          // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Type_003;                                          // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Type_002;                                          // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Type_001;                                          // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Ring_1;                                            // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ring_2;                                            // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ring_3;                                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ring_4;                                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Type_1_1;                                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Type_2_1;                                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Type_2_2;                                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Type_3_1;                                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Type_3_2;                                          // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Type_3_3;                                          // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Type_4_1;                                          // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Type_4_2;                                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Type_4_3;                                          // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Type_4_4;                                          // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Coin_Color_C">();
	}
	static class UW_Coin_Color_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Coin_Color_C>();
	}
};
static_assert(alignof(UW_Coin_Color_C) == 0x000008, "Wrong alignment on UW_Coin_Color_C");
static_assert(sizeof(UW_Coin_Color_C) == 0x0005A0, "Wrong size on UW_Coin_Color_C");
static_assert(offsetof(UW_Coin_Color_C, off) == 0x0004E0, "Member 'UW_Coin_Color_C::off' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, on) == 0x0004E8, "Member 'UW_Coin_Color_C::on' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Color_Rainbow) == 0x0004F0, "Member 'UW_Coin_Color_C::Color_Rainbow' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Color_Gold) == 0x0004F8, "Member 'UW_Coin_Color_C::Color_Gold' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Color_Silver) == 0x000500, "Member 'UW_Coin_Color_C::Color_Silver' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Color_Copper) == 0x000508, "Member 'UW_Coin_Color_C::Color_Copper' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_004) == 0x000510, "Member 'UW_Coin_Color_C::Type_004' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_003) == 0x000518, "Member 'UW_Coin_Color_C::Type_003' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_002) == 0x000520, "Member 'UW_Coin_Color_C::Type_002' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_001) == 0x000528, "Member 'UW_Coin_Color_C::Type_001' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Ring_1) == 0x000530, "Member 'UW_Coin_Color_C::Ring_1' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Ring_2) == 0x000538, "Member 'UW_Coin_Color_C::Ring_2' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Ring_3) == 0x000540, "Member 'UW_Coin_Color_C::Ring_3' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Ring_4) == 0x000548, "Member 'UW_Coin_Color_C::Ring_4' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_1_1) == 0x000550, "Member 'UW_Coin_Color_C::Type_1_1' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_2_1) == 0x000558, "Member 'UW_Coin_Color_C::Type_2_1' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_2_2) == 0x000560, "Member 'UW_Coin_Color_C::Type_2_2' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_3_1) == 0x000568, "Member 'UW_Coin_Color_C::Type_3_1' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_3_2) == 0x000570, "Member 'UW_Coin_Color_C::Type_3_2' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_3_3) == 0x000578, "Member 'UW_Coin_Color_C::Type_3_3' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_4_1) == 0x000580, "Member 'UW_Coin_Color_C::Type_4_1' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_4_2) == 0x000588, "Member 'UW_Coin_Color_C::Type_4_2' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_4_3) == 0x000590, "Member 'UW_Coin_Color_C::Type_4_3' has a wrong offset!");
static_assert(offsetof(UW_Coin_Color_C, Type_4_4) == 0x000598, "Member 'UW_Coin_Color_C::Type_4_4' has a wrong offset!");

}

