#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Coinmenu_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Coinmenu_01.W_Coinmenu_01_C
// 0x0078 (0x05D8 - 0x0560)
class UW_Coinmenu_01_C final : public UUICoinMenu
{
public:
	class UWidgetAnimation*                       Switching_02;                                      // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Switching_01;                                      // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BGImage;                                           // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CoinBase;                                          // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CoinDetail_BG;                                     // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_116;                                         // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 name_base_1;                                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Coin_Stock_01_C*                     W_Coin_Stock_01;                                   // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CoinPlate_Set_01_C*                  W_CoinPlate_Set_01;                                // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Page_CoinAbility_C*                  W_Page_CoinAbility;                                // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Page_CoinDetail_C*                   W_Page_CoinDetail;                                 // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Page_Strength_C*                     W_Page_Strength;                                   // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TopBar_02_C*                         W_TopBar_02;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Under_Button_C*                      W_Under_Button;                                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Coinmenu_01_C">();
	}
	static class UW_Coinmenu_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Coinmenu_01_C>();
	}
};
static_assert(alignof(UW_Coinmenu_01_C) == 0x000008, "Wrong alignment on UW_Coinmenu_01_C");
static_assert(sizeof(UW_Coinmenu_01_C) == 0x0005D8, "Wrong size on UW_Coinmenu_01_C");
static_assert(offsetof(UW_Coinmenu_01_C, Switching_02) == 0x000560, "Member 'UW_Coinmenu_01_C::Switching_02' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, Switching_01) == 0x000568, "Member 'UW_Coinmenu_01_C::Switching_01' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, In) == 0x000570, "Member 'UW_Coinmenu_01_C::In' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, BGImage) == 0x000578, "Member 'UW_Coinmenu_01_C::BGImage' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, CoinBase) == 0x000580, "Member 'UW_Coinmenu_01_C::CoinBase' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, CoinDetail_BG) == 0x000588, "Member 'UW_Coinmenu_01_C::CoinDetail_BG' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, Image_116) == 0x000590, "Member 'UW_Coinmenu_01_C::Image_116' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, name_base_1) == 0x000598, "Member 'UW_Coinmenu_01_C::name_base_1' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, W_Coin_Stock_01) == 0x0005A0, "Member 'UW_Coinmenu_01_C::W_Coin_Stock_01' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, W_CoinPlate_Set_01) == 0x0005A8, "Member 'UW_Coinmenu_01_C::W_CoinPlate_Set_01' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, W_Page_CoinAbility) == 0x0005B0, "Member 'UW_Coinmenu_01_C::W_Page_CoinAbility' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, W_Page_CoinDetail) == 0x0005B8, "Member 'UW_Coinmenu_01_C::W_Page_CoinDetail' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, W_Page_Strength) == 0x0005C0, "Member 'UW_Coinmenu_01_C::W_Page_Strength' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, W_TopBar_02) == 0x0005C8, "Member 'UW_Coinmenu_01_C::W_TopBar_02' has a wrong offset!");
static_assert(offsetof(UW_Coinmenu_01_C, W_Under_Button) == 0x0005D0, "Member 'UW_Coinmenu_01_C::W_Under_Button' has a wrong offset!");

}

