#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Cursor_Partymenu_03

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Cursor_Partymenu_03.W_Cursor_Partymenu_03_C
// 0x0218 (0x0808 - 0x05F0)
class UW_Cursor_Partymenu_03_C final : public UUICursor_Partymenu_03
{
public:
	class UWidgetAnimation*                       TextColor_Black;                                   // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TextColor_White;                                   // 0x05F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gray_Out_Off;                                      // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gray_Out_On;                                       // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       No_Icon;                                           // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Current_Icon;                                      // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       New_Current_Icon;                                  // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       New_Icon;                                          // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_HtoA_R;                                  // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_GtoA_R;                                  // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_H2;                                      // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_G2;                                      // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_HtoA;                                    // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_GtoA;                                    // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_H;                                       // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_G;                                       // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Text_2Line;                                        // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Text_1Line;                                        // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IconSet_Off;                                       // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IconSet_On;                                        // 0x0688(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unselect_RightCursor;                              // 0x0690(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_FtoA_R;                                  // 0x0698(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_EtoA_R;                                  // 0x06A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_DtoA_R;                                  // 0x06A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_CtoA_R;                                  // 0x06B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_BtoA_R;                                  // 0x06B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_AtoA_R;                                  // 0x06C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_UnderMenu;                                  // 0x06C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_FtoA;                                    // 0x06D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_EtoA;                                    // 0x06D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_DtoA;                                    // 0x06E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_CtoA;                                    // 0x06E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_BtoA;                                    // 0x06F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelMove_AtoA;                                    // 0x06F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_F2;                                      // 0x0700(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_E2;                                      // 0x0708(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_D2;                                      // 0x0710(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_C2;                                      // 0x0718(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_B2;                                      // 0x0720(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_A2;                                      // 0x0728(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_F;                                       // 0x0730(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_E;                                       // 0x0738(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_D;                                       // 0x0740(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_C;                                       // 0x0748(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_B;                                       // 0x0750(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_A;                                       // 0x0758(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_RightCursor;                                // 0x0760(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Nomal;                                             // 0x0768(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_4;                                       // 0x0770(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_3;                                       // 0x0778(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_2;                                       // 0x0780(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelSize_1;                                       // 0x0788(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0790(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       off;                                               // 0x0798(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x07A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x07A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 FacePlate_Csr;                                     // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FacePlate_Cursor;                                  // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Current_1;                                    // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Current_2;                                    // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_New;                                          // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Monster_Face;                                      // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plate_Nomal;                                       // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Select_Plate;                                      // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Select_Plate_Flash;                                // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Select_RCursor;                                    // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SideScrollTextWidget_C*              W_SideScrollTextWidget;                            // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Cursor_Partymenu_03_C">();
	}
	static class UW_Cursor_Partymenu_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Cursor_Partymenu_03_C>();
	}
};
static_assert(alignof(UW_Cursor_Partymenu_03_C) == 0x000008, "Wrong alignment on UW_Cursor_Partymenu_03_C");
static_assert(sizeof(UW_Cursor_Partymenu_03_C) == 0x000808, "Wrong size on UW_Cursor_Partymenu_03_C");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, TextColor_Black) == 0x0005F0, "Member 'UW_Cursor_Partymenu_03_C::TextColor_Black' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, TextColor_White) == 0x0005F8, "Member 'UW_Cursor_Partymenu_03_C::TextColor_White' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Gray_Out_Off) == 0x000600, "Member 'UW_Cursor_Partymenu_03_C::Gray_Out_Off' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Gray_Out_On) == 0x000608, "Member 'UW_Cursor_Partymenu_03_C::Gray_Out_On' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, No_Icon) == 0x000610, "Member 'UW_Cursor_Partymenu_03_C::No_Icon' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Current_Icon) == 0x000618, "Member 'UW_Cursor_Partymenu_03_C::Current_Icon' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, New_Current_Icon) == 0x000620, "Member 'UW_Cursor_Partymenu_03_C::New_Current_Icon' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, New_Icon) == 0x000628, "Member 'UW_Cursor_Partymenu_03_C::New_Icon' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_HtoA_R) == 0x000630, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_HtoA_R' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_GtoA_R) == 0x000638, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_GtoA_R' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_H2) == 0x000640, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_H2' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_G2) == 0x000648, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_G2' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_HtoA) == 0x000650, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_HtoA' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_GtoA) == 0x000658, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_GtoA' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_H) == 0x000660, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_H' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_G) == 0x000668, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_G' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Text_2Line) == 0x000670, "Member 'UW_Cursor_Partymenu_03_C::Text_2Line' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Text_1Line) == 0x000678, "Member 'UW_Cursor_Partymenu_03_C::Text_1Line' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, IconSet_Off) == 0x000680, "Member 'UW_Cursor_Partymenu_03_C::IconSet_Off' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, IconSet_On) == 0x000688, "Member 'UW_Cursor_Partymenu_03_C::IconSet_On' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Unselect_RightCursor) == 0x000690, "Member 'UW_Cursor_Partymenu_03_C::Unselect_RightCursor' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_FtoA_R) == 0x000698, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_FtoA_R' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_EtoA_R) == 0x0006A0, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_EtoA_R' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_DtoA_R) == 0x0006A8, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_DtoA_R' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_CtoA_R) == 0x0006B0, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_CtoA_R' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_BtoA_R) == 0x0006B8, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_BtoA_R' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_AtoA_R) == 0x0006C0, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_AtoA_R' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Select_UnderMenu) == 0x0006C8, "Member 'UW_Cursor_Partymenu_03_C::Select_UnderMenu' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_FtoA) == 0x0006D0, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_FtoA' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_EtoA) == 0x0006D8, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_EtoA' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_DtoA) == 0x0006E0, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_DtoA' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_CtoA) == 0x0006E8, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_CtoA' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_BtoA) == 0x0006F0, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_BtoA' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelMove_AtoA) == 0x0006F8, "Member 'UW_Cursor_Partymenu_03_C::PanelMove_AtoA' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_F2) == 0x000700, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_F2' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_E2) == 0x000708, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_E2' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_D2) == 0x000710, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_D2' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_C2) == 0x000718, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_C2' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_B2) == 0x000720, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_B2' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_A2) == 0x000728, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_A2' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_F) == 0x000730, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_F' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_E) == 0x000738, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_E' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_D) == 0x000740, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_D' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_C) == 0x000748, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_C' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_B) == 0x000750, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_B' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_A) == 0x000758, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_A' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Select_RightCursor) == 0x000760, "Member 'UW_Cursor_Partymenu_03_C::Select_RightCursor' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Nomal) == 0x000768, "Member 'UW_Cursor_Partymenu_03_C::Nomal' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_4) == 0x000770, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_4' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_3) == 0x000778, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_3' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_2) == 0x000780, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_2' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, PanelSize_1) == 0x000788, "Member 'UW_Cursor_Partymenu_03_C::PanelSize_1' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Out) == 0x000790, "Member 'UW_Cursor_Partymenu_03_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, off) == 0x000798, "Member 'UW_Cursor_Partymenu_03_C::off' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Wait) == 0x0007A0, "Member 'UW_Cursor_Partymenu_03_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, on) == 0x0007A8, "Member 'UW_Cursor_Partymenu_03_C::on' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, FacePlate_Csr) == 0x0007B0, "Member 'UW_Cursor_Partymenu_03_C::FacePlate_Csr' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, FacePlate_Cursor) == 0x0007B8, "Member 'UW_Cursor_Partymenu_03_C::FacePlate_Cursor' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Icon_Current_1) == 0x0007C0, "Member 'UW_Cursor_Partymenu_03_C::Icon_Current_1' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Icon_Current_2) == 0x0007C8, "Member 'UW_Cursor_Partymenu_03_C::Icon_Current_2' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Icon_New) == 0x0007D0, "Member 'UW_Cursor_Partymenu_03_C::Icon_New' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Monster_Face) == 0x0007D8, "Member 'UW_Cursor_Partymenu_03_C::Monster_Face' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Plate_Nomal) == 0x0007E0, "Member 'UW_Cursor_Partymenu_03_C::Plate_Nomal' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Select_Plate) == 0x0007E8, "Member 'UW_Cursor_Partymenu_03_C::Select_Plate' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Select_Plate_Flash) == 0x0007F0, "Member 'UW_Cursor_Partymenu_03_C::Select_Plate_Flash' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, Select_RCursor) == 0x0007F8, "Member 'UW_Cursor_Partymenu_03_C::Select_RCursor' has a wrong offset!");
static_assert(offsetof(UW_Cursor_Partymenu_03_C, W_SideScrollTextWidget) == 0x000800, "Member 'UW_Cursor_Partymenu_03_C::W_SideScrollTextWidget' has a wrong offset!");

}

