#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Darkness_Map

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Darkness_Map.W_Darkness_Map_C
// 0x0038 (0x04C8 - 0x0490)
class UW_Darkness_Map_C final : public UUIDarkness_Map
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Board;                                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnFinishFadeOut;                                   // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFinishFadeIn;                                    // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Darkness_Map_C">();
	}
	static class UW_Darkness_Map_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Darkness_Map_C>();
	}
};
static_assert(alignof(UW_Darkness_Map_C) == 0x000008, "Wrong alignment on UW_Darkness_Map_C");
static_assert(sizeof(UW_Darkness_Map_C) == 0x0004C8, "Wrong size on UW_Darkness_Map_C");
static_assert(offsetof(UW_Darkness_Map_C, Out) == 0x000490, "Member 'UW_Darkness_Map_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Darkness_Map_C, In) == 0x000498, "Member 'UW_Darkness_Map_C::In' has a wrong offset!");
static_assert(offsetof(UW_Darkness_Map_C, Board) == 0x0004A0, "Member 'UW_Darkness_Map_C::Board' has a wrong offset!");
static_assert(offsetof(UW_Darkness_Map_C, OnFinishFadeOut) == 0x0004A8, "Member 'UW_Darkness_Map_C::OnFinishFadeOut' has a wrong offset!");
static_assert(offsetof(UW_Darkness_Map_C, OnFinishFadeIn) == 0x0004B8, "Member 'UW_Darkness_Map_C::OnFinishFadeIn' has a wrong offset!");

}

