#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Darkness

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "W_UIBase_classes.hpp"
#include "DarwinGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Darkness.W_Darkness_C
// 0x0058 (0x04F8 - 0x04A0)
class UW_Darkness_C final : public UW_UIBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_W_Darkness_C;                       // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Board;                                             // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AlphaStep;                                         // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFading;                                          // 0x04D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D5[0x3];                                      // 0x04D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFinishFadeOut;                                   // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnFinishFadeIn;                                    // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ReAddViewPort(EFadeZOrderType ZorderType);
	void FadeInScreen(float Time);
	void UpdateFade();
	void FadeOutScreen(const struct FLinearColor& Color_0, float Time, EFadeZOrderType ZorderType);
	void Update(float DeltaTime);
	void open();
	void ExecuteUbergraph_W_Darkness(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Darkness_C">();
	}
	static class UW_Darkness_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Darkness_C>();
	}
};
static_assert(alignof(UW_Darkness_C) == 0x000008, "Wrong alignment on UW_Darkness_C");
static_assert(sizeof(UW_Darkness_C) == 0x0004F8, "Wrong size on UW_Darkness_C");
static_assert(offsetof(UW_Darkness_C, UberGraphFrame_W_Darkness_C) == 0x0004A0, "Member 'UW_Darkness_C::UberGraphFrame_W_Darkness_C' has a wrong offset!");
static_assert(offsetof(UW_Darkness_C, Out) == 0x0004A8, "Member 'UW_Darkness_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Darkness_C, In) == 0x0004B0, "Member 'UW_Darkness_C::In' has a wrong offset!");
static_assert(offsetof(UW_Darkness_C, Board) == 0x0004B8, "Member 'UW_Darkness_C::Board' has a wrong offset!");
static_assert(offsetof(UW_Darkness_C, Color) == 0x0004C0, "Member 'UW_Darkness_C::Color' has a wrong offset!");
static_assert(offsetof(UW_Darkness_C, AlphaStep) == 0x0004D0, "Member 'UW_Darkness_C::AlphaStep' has a wrong offset!");
static_assert(offsetof(UW_Darkness_C, IsFading) == 0x0004D4, "Member 'UW_Darkness_C::IsFading' has a wrong offset!");
static_assert(offsetof(UW_Darkness_C, OnFinishFadeOut) == 0x0004D8, "Member 'UW_Darkness_C::OnFinishFadeOut' has a wrong offset!");
static_assert(offsetof(UW_Darkness_C, OnFinishFadeIn) == 0x0004E8, "Member 'UW_Darkness_C::OnFinishFadeIn' has a wrong offset!");

}

