#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DebugMoveMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DebugMoveMode.W_DebugMoveMode_C
// 0x0030 (0x0268 - 0x0238)
class UW_DebugMoveMode_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PosX;                                              // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PosY;                                              // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PosZ;                                              // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Speed;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetMoveSpeed(const class FText& InText);
	void ExecuteUbergraph_W_DebugMoveMode(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_DebugMoveMode_C">();
	}
	static class UW_DebugMoveMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DebugMoveMode_C>();
	}
};
static_assert(alignof(UW_DebugMoveMode_C) == 0x000008, "Wrong alignment on UW_DebugMoveMode_C");
static_assert(sizeof(UW_DebugMoveMode_C) == 0x000268, "Wrong size on UW_DebugMoveMode_C");
static_assert(offsetof(UW_DebugMoveMode_C, UberGraphFrame) == 0x000238, "Member 'UW_DebugMoveMode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DebugMoveMode_C, Image_0) == 0x000240, "Member 'UW_DebugMoveMode_C::Image_0' has a wrong offset!");
static_assert(offsetof(UW_DebugMoveMode_C, PosX) == 0x000248, "Member 'UW_DebugMoveMode_C::PosX' has a wrong offset!");
static_assert(offsetof(UW_DebugMoveMode_C, PosY) == 0x000250, "Member 'UW_DebugMoveMode_C::PosY' has a wrong offset!");
static_assert(offsetof(UW_DebugMoveMode_C, PosZ) == 0x000258, "Member 'UW_DebugMoveMode_C::PosZ' has a wrong offset!");
static_assert(offsetof(UW_DebugMoveMode_C, Speed) == 0x000260, "Member 'UW_DebugMoveMode_C::Speed' has a wrong offset!");

}

