#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DebugMenuBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_DebugMenuBase.W_DebugMenuBase_C.ExecuteUbergraph_W_DebugMenuBase
// 0x0210 (0x0210 - 0x0000)
struct W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetDisplayItemNum_ReturnValue;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetItemValueLayout_text;                  // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetItemValueLayout_x;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetItemValueLayout_y;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetItemValueLayout_color;                 // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetItemNameLayout_text;                   // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetItemNameLayout_x;                      // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetItemNameLayout_y;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetItemNameLayout_color;                  // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00C8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00F0(0x0028)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0120(0x0018)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0140(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CallFunc_CreateText_ReturnValue;                   // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CallFunc_CreateText_ReturnValue_1;                 // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue_1;           // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetScrollLayout_text;                     // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollLayout_x;                        // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollLayout_y;                        // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetScrollLayout_color;                    // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CallFunc_CreateText_ReturnValue_2;                 // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01B8(0x0018)()
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue_2;           // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAppGameInstance*                       CallFunc_GetAppGameInstance_ReturnValue;           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAppDebugMenu*                          CallFunc_GetDebugMenu_ReturnValue;                 // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetRevision_text;                         // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x01F8(0x0018)()
};
static_assert(alignof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase) == 0x000008, "Wrong alignment on W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase");
static_assert(sizeof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase) == 0x000210, "Wrong size on W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, EntryPoint) == 0x000000, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, Temp_bool_IsClosed_Variable) == 0x00000C, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, Temp_bool_Has_Been_Initd_Variable) == 0x00000D, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, K2Node_Event_IsDesignTime) == 0x00000E, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, K2Node_Event_MyGeometry) == 0x000010, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, K2Node_Event_InDeltaTime) == 0x000048, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetDisplayItemNum_ReturnValue) == 0x000050, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetDisplayItemNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_Min_ReturnValue) == 0x000054, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_Subtract_IntInt_ReturnValue) == 0x000058, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, Temp_int_Variable) == 0x00005C, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_Array_Get_Item) == 0x000060, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetItemValueLayout_text) == 0x000078, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetItemValueLayout_text' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetItemValueLayout_x) == 0x000088, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetItemValueLayout_x' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetItemValueLayout_y) == 0x00008C, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetItemValueLayout_y' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetItemValueLayout_color) == 0x000090, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetItemValueLayout_color' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetItemNameLayout_text) == 0x0000A0, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetItemNameLayout_text' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetItemNameLayout_x) == 0x0000B0, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetItemNameLayout_x' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetItemNameLayout_y) == 0x0000B4, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetItemNameLayout_y' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetItemNameLayout_color) == 0x0000B8, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetItemNameLayout_color' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, K2Node_MakeStruct_SlateColor) == 0x0000C8, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, K2Node_MakeStruct_SlateColor_1) == 0x0000F0, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_MakeVector2D_ReturnValue_1) == 0x000118, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_Conv_StringToText_ReturnValue) == 0x000120, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_MakeVector2D_ReturnValue_2) == 0x000138, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000140, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000158, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_Add_IntInt_ReturnValue) == 0x00015C, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_CreateText_ReturnValue) == 0x000160, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_CreateText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_AddChildToCanvas_ReturnValue) == 0x000168, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_CreateText_ReturnValue_1) == 0x000170, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_CreateText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_AddChildToCanvas_ReturnValue_1) == 0x000178, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_AddChildToCanvas_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetScrollLayout_text) == 0x000180, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetScrollLayout_text' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetScrollLayout_x) == 0x000190, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetScrollLayout_x' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetScrollLayout_y) == 0x000194, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetScrollLayout_y' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetScrollLayout_color) == 0x000198, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetScrollLayout_color' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_CreateText_ReturnValue_2) == 0x0001A8, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_CreateText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_MakeVector2D_ReturnValue_3) == 0x0001B0, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0001B8, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_AddChildToCanvas_ReturnValue_2) == 0x0001D0, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_AddChildToCanvas_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetAppGameInstance_ReturnValue) == 0x0001D8, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetAppGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetDebugMenu_ReturnValue) == 0x0001E0, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetDebugMenu_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_GetRevision_text) == 0x0001E8, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_GetRevision_text' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0001F8, "Member 'W_DebugMenuBase_C_ExecuteUbergraph_W_DebugMenuBase::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");

// Function W_DebugMenuBase.W_DebugMenuBase_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_DebugMenuBase_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DebugMenuBase_C_Tick) == 0x000004, "Wrong alignment on W_DebugMenuBase_C_Tick");
static_assert(sizeof(W_DebugMenuBase_C_Tick) == 0x00003C, "Wrong size on W_DebugMenuBase_C_Tick");
static_assert(offsetof(W_DebugMenuBase_C_Tick, MyGeometry) == 0x000000, "Member 'W_DebugMenuBase_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_Tick, InDeltaTime) == 0x000038, "Member 'W_DebugMenuBase_C_Tick::InDeltaTime' has a wrong offset!");

// Function W_DebugMenuBase.W_DebugMenuBase_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_DebugMenuBase_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_DebugMenuBase_C_PreConstruct) == 0x000001, "Wrong alignment on W_DebugMenuBase_C_PreConstruct");
static_assert(sizeof(W_DebugMenuBase_C_PreConstruct) == 0x000001, "Wrong size on W_DebugMenuBase_C_PreConstruct");
static_assert(offsetof(W_DebugMenuBase_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_DebugMenuBase_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_DebugMenuBase.W_DebugMenuBase_C.CreateText
// 0x0068 (0x0068 - 0x0000)
struct W_DebugMenuBase_C_CreateText final
{
public:
	class UTextBlock*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFontHeight_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0018(0x0050)(HasGetValueTypeHash)
};
static_assert(alignof(W_DebugMenuBase_C_CreateText) == 0x000008, "Wrong alignment on W_DebugMenuBase_C_CreateText");
static_assert(sizeof(W_DebugMenuBase_C_CreateText) == 0x000068, "Wrong size on W_DebugMenuBase_C_CreateText");
static_assert(offsetof(W_DebugMenuBase_C_CreateText, ReturnValue) == 0x000000, "Member 'W_DebugMenuBase_C_CreateText::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_CreateText, CallFunc_GetFontHeight_ReturnValue) == 0x000008, "Member 'W_DebugMenuBase_C_CreateText::CallFunc_GetFontHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_CreateText, CallFunc_SpawnObject_ReturnValue) == 0x000010, "Member 'W_DebugMenuBase_C_CreateText::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_CreateText, K2Node_MakeStruct_SlateFontInfo) == 0x000018, "Member 'W_DebugMenuBase_C_CreateText::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function W_DebugMenuBase.W_DebugMenuBase_C.ClearText
// 0x0030 (0x0030 - 0x0000)
struct W_DebugMenuBase_C_ClearText final
{
public:
	TArray<class UTextBlock*>                     TextList;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UTextBlock*                             NewLocalVar_0;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DebugMenuBase_C_ClearText) == 0x000008, "Wrong alignment on W_DebugMenuBase_C_ClearText");
static_assert(sizeof(W_DebugMenuBase_C_ClearText) == 0x000030, "Wrong size on W_DebugMenuBase_C_ClearText");
static_assert(offsetof(W_DebugMenuBase_C_ClearText, TextList) == 0x000000, "Member 'W_DebugMenuBase_C_ClearText::TextList' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ClearText, NewLocalVar_0) == 0x000010, "Member 'W_DebugMenuBase_C_ClearText::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ClearText, CallFunc_Array_LastIndex_ReturnValue) == 0x000018, "Member 'W_DebugMenuBase_C_ClearText::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ClearText, Temp_int_Variable) == 0x00001C, "Member 'W_DebugMenuBase_C_ClearText::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ClearText, CallFunc_Array_Get_Item) == 0x000020, "Member 'W_DebugMenuBase_C_ClearText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ClearText, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'W_DebugMenuBase_C_ClearText::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_ClearText, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'W_DebugMenuBase_C_ClearText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function W_DebugMenuBase.W_DebugMenuBase_C.InitTextList
// 0x0040 (0x0040 - 0x0000)
struct W_DebugMenuBase_C_InitTextList final
{
public:
	TArray<class UTextBlock*>                     TextList;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UCanvasPanel*                           TargetCanvas;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num;                                               // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_CreateText_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DebugMenuBase_C_InitTextList) == 0x000008, "Wrong alignment on W_DebugMenuBase_C_InitTextList");
static_assert(sizeof(W_DebugMenuBase_C_InitTextList) == 0x000040, "Wrong size on W_DebugMenuBase_C_InitTextList");
static_assert(offsetof(W_DebugMenuBase_C_InitTextList, TextList) == 0x000000, "Member 'W_DebugMenuBase_C_InitTextList::TextList' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_InitTextList, TargetCanvas) == 0x000010, "Member 'W_DebugMenuBase_C_InitTextList::TargetCanvas' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_InitTextList, Num) == 0x000018, "Member 'W_DebugMenuBase_C_InitTextList::Num' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_InitTextList, CallFunc_CreateText_ReturnValue) == 0x000020, "Member 'W_DebugMenuBase_C_InitTextList::CallFunc_CreateText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_InitTextList, Temp_int_Variable) == 0x000028, "Member 'W_DebugMenuBase_C_InitTextList::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_InitTextList, CallFunc_Array_Add_ReturnValue) == 0x00002C, "Member 'W_DebugMenuBase_C_InitTextList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_InitTextList, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000030, "Member 'W_DebugMenuBase_C_InitTextList::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_InitTextList, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'W_DebugMenuBase_C_InitTextList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_InitTextList, CallFunc_AddChildToCanvas_ReturnValue) == 0x000038, "Member 'W_DebugMenuBase_C_InitTextList::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function W_DebugMenuBase.W_DebugMenuBase_C.DisplayTitle
// 0x0070 (0x0070 - 0x0000)
struct W_DebugMenuBase_C_DisplayTitle final
{
public:
	class FString                                 CallFunc_GetTitleLayout_text;                      // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTitleLayout_x;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTitleLayout_y;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetTitleLayout_color;                     // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0040(0x0028)()
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DebugMenuBase_C_DisplayTitle) == 0x000008, "Wrong alignment on W_DebugMenuBase_C_DisplayTitle");
static_assert(sizeof(W_DebugMenuBase_C_DisplayTitle) == 0x000070, "Wrong size on W_DebugMenuBase_C_DisplayTitle");
static_assert(offsetof(W_DebugMenuBase_C_DisplayTitle, CallFunc_GetTitleLayout_text) == 0x000000, "Member 'W_DebugMenuBase_C_DisplayTitle::CallFunc_GetTitleLayout_text' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_DisplayTitle, CallFunc_GetTitleLayout_x) == 0x000010, "Member 'W_DebugMenuBase_C_DisplayTitle::CallFunc_GetTitleLayout_x' has a wrong offset!");
static_assert(offsetof(W_DebugMenuBase_C_DisplayTitle, CallFunc_GetTitleLayout_y) == 0x000014, "Member 'W_DebugMenuBase_C_DisplayTitle::CallFunc_GetTitleLayout_y' has a wrong offset!");
