#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DebugMenuBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_DebugMenuBase.W_DebugMenuBase_C
// 0x0060 (0x0298 - 0x0238)
class UW_DebugMenuBase_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ItemNum;                                           // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTextBlock*>                     ItemuNameArray;                                    // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     ItemuValueArray;                                   // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class UAppDebugMenu*                          AppDebugMenu;                                      // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPDebugMenuInterface*                  BPDebugMenuInterface;                              // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ScrollText;                                        // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             RevisionText;                                      // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_DebugMenuBase(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	class UTextBlock* CreateText();
	void ClearText(TArray<class UTextBlock*>& TextList);
	void InitTextList(TArray<class UTextBlock*>& TextList, class UCanvasPanel* TargetCanvas, int32 Num);
	void DisplayTitle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_DebugMenuBase_C">();
	}
	static class UW_DebugMenuBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_DebugMenuBase_C>();
	}
};
static_assert(alignof(UW_DebugMenuBase_C) == 0x000008, "Wrong alignment on UW_DebugMenuBase_C");
static_assert(sizeof(UW_DebugMenuBase_C) == 0x000298, "Wrong size on UW_DebugMenuBase_C");
static_assert(offsetof(UW_DebugMenuBase_C, UberGraphFrame) == 0x000238, "Member 'UW_DebugMenuBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_DebugMenuBase_C, CanvasPanel_0) == 0x000240, "Member 'UW_DebugMenuBase_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UW_DebugMenuBase_C, ItemNum) == 0x000248, "Member 'UW_DebugMenuBase_C::ItemNum' has a wrong offset!");
static_assert(offsetof(UW_DebugMenuBase_C, ItemuNameArray) == 0x000250, "Member 'UW_DebugMenuBase_C::ItemuNameArray' has a wrong offset!");
static_assert(offsetof(UW_DebugMenuBase_C, ItemuValueArray) == 0x000260, "Member 'UW_DebugMenuBase_C::ItemuValueArray' has a wrong offset!");
static_assert(offsetof(UW_DebugMenuBase_C, AppDebugMenu) == 0x000270, "Member 'UW_DebugMenuBase_C::AppDebugMenu' has a wrong offset!");
static_assert(offsetof(UW_DebugMenuBase_C, BPDebugMenuInterface) == 0x000278, "Member 'UW_DebugMenuBase_C::BPDebugMenuInterface' has a wrong offset!");
static_assert(offsetof(UW_DebugMenuBase_C, TitleText) == 0x000280, "Member 'UW_DebugMenuBase_C::TitleText' has a wrong offset!");
static_assert(offsetof(UW_DebugMenuBase_C, ScrollText) == 0x000288, "Member 'UW_DebugMenuBase_C::ScrollText' has a wrong offset!");
static_assert(offsetof(UW_DebugMenuBase_C, RevisionText) == 0x000290, "Member 'UW_DebugMenuBase_C::RevisionText' has a wrong offset!");

}

