#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Dispatch_TeamStatus

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Dispatch_TeamStatus.W_Dispatch_TeamStatus_C
// 0x0130 (0x0668 - 0x0538)
class UW_Dispatch_TeamStatus_C final : public UUIDispatch_TeamStatus
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BasePanel;                                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CategoryBase;                                      // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_CategoryIcon_C*             CategoryIcon_01;                                   // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_CategoryIcon_C*             CategoryIcon_02;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_CategoryIcon_C*             CategoryIcon_03;                                   // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_CategoryIcon_C*             CategoryIcon_04;                                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_CategoryIcon_C*             CategoryIcon_05;                                   // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_CategoryIcon_C*             CategoryIcon_06;                                   // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_CategoryIcon_Effect_3_C*    CategoryIcon_Eff_01;                               // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_CategoryIcon_Effect_3_C*    CategoryIcon_Eff_02;                               // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_CategoryIcon_Effect_3_C*    CategoryIcon_Eff_03;                               // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_CategoryIcon_Effect_3_C*    CategoryIcon_Eff_04;                               // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_CategoryIcon_Effect_3_C*    CategoryIcon_Eff_05;                               // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_CategoryIcon_Effect_3_C*    CategoryIcon_Eff_06;                               // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Head;                                              // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 line_2;                                            // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plate_2;                                           // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plate_1_0;                                         // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar_Base;                                    // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_10;                                     // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_11;                                     // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_12;                                     // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_13;                                     // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_14;                                     // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_00;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_01;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_02;                                     // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_03;                                     // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_04;                                     // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_05;                                     // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_06;                                     // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_07;                                     // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_08;                                     // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ItemName_C*                          W_ItemName_09;                                     // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SideScrollTextWidget_C*              W_StationNameScroll;                               // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Dispatch_TeamStatus_C">();
	}
	static class UW_Dispatch_TeamStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Dispatch_TeamStatus_C>();
	}
};
static_assert(alignof(UW_Dispatch_TeamStatus_C) == 0x000008, "Wrong alignment on UW_Dispatch_TeamStatus_C");
static_assert(sizeof(UW_Dispatch_TeamStatus_C) == 0x000668, "Wrong size on UW_Dispatch_TeamStatus_C");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, Out) == 0x000538, "Member 'UW_Dispatch_TeamStatus_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, In) == 0x000540, "Member 'UW_Dispatch_TeamStatus_C::In' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, BasePanel) == 0x000548, "Member 'UW_Dispatch_TeamStatus_C::BasePanel' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, CategoryBase) == 0x000550, "Member 'UW_Dispatch_TeamStatus_C::CategoryBase' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, CategoryIcon_01) == 0x000558, "Member 'UW_Dispatch_TeamStatus_C::CategoryIcon_01' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, CategoryIcon_02) == 0x000560, "Member 'UW_Dispatch_TeamStatus_C::CategoryIcon_02' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, CategoryIcon_03) == 0x000568, "Member 'UW_Dispatch_TeamStatus_C::CategoryIcon_03' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, CategoryIcon_04) == 0x000570, "Member 'UW_Dispatch_TeamStatus_C::CategoryIcon_04' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, CategoryIcon_05) == 0x000578, "Member 'UW_Dispatch_TeamStatus_C::CategoryIcon_05' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, CategoryIcon_06) == 0x000580, "Member 'UW_Dispatch_TeamStatus_C::CategoryIcon_06' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, CategoryIcon_Eff_01) == 0x000588, "Member 'UW_Dispatch_TeamStatus_C::CategoryIcon_Eff_01' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, CategoryIcon_Eff_02) == 0x000590, "Member 'UW_Dispatch_TeamStatus_C::CategoryIcon_Eff_02' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, CategoryIcon_Eff_03) == 0x000598, "Member 'UW_Dispatch_TeamStatus_C::CategoryIcon_Eff_03' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, CategoryIcon_Eff_04) == 0x0005A0, "Member 'UW_Dispatch_TeamStatus_C::CategoryIcon_Eff_04' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, CategoryIcon_Eff_05) == 0x0005A8, "Member 'UW_Dispatch_TeamStatus_C::CategoryIcon_Eff_05' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, CategoryIcon_Eff_06) == 0x0005B0, "Member 'UW_Dispatch_TeamStatus_C::CategoryIcon_Eff_06' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, Head) == 0x0005B8, "Member 'UW_Dispatch_TeamStatus_C::Head' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, line_2) == 0x0005C0, "Member 'UW_Dispatch_TeamStatus_C::line_2' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, Plate_2) == 0x0005C8, "Member 'UW_Dispatch_TeamStatus_C::Plate_2' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, Plate_1_0) == 0x0005D0, "Member 'UW_Dispatch_TeamStatus_C::Plate_1_0' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, ScrollBar) == 0x0005D8, "Member 'UW_Dispatch_TeamStatus_C::ScrollBar' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, ScrollBar_Base) == 0x0005E0, "Member 'UW_Dispatch_TeamStatus_C::ScrollBar_Base' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_10) == 0x0005E8, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_10' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_11) == 0x0005F0, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_11' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_12) == 0x0005F8, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_12' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_13) == 0x000600, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_13' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_14) == 0x000608, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_14' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_00) == 0x000610, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_00' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_01) == 0x000618, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_01' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_02) == 0x000620, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_02' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_03) == 0x000628, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_03' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_04) == 0x000630, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_04' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_05) == 0x000638, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_05' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_06) == 0x000640, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_06' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_07) == 0x000648, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_07' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_08) == 0x000650, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_08' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_ItemName_09) == 0x000658, "Member 'UW_Dispatch_TeamStatus_C::W_ItemName_09' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_TeamStatus_C, W_StationNameScroll) == 0x000660, "Member 'UW_Dispatch_TeamStatus_C::W_StationNameScroll' has a wrong offset!");

}

