#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Dispatch_Panel_00

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Dispatch_Panel_00.W_Dispatch_Panel_00_C
// 0x01E0 (0x0788 - 0x05A8)
class UW_Dispatch_Panel_00_C final : public UUIDispatch_Panel_00
{
public:
	class UWidgetAnimation*                       Match_0;                                           // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Match_100;                                         // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Match_50;                                          // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Cursor_Stop;                                       // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Status_3;                                          // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Status_2;                                          // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Status_1;                                          // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Status_0;                                          // 0x05E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Mons3_Off;                                         // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Mons3_On;                                          // 0x05F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Mons2_Off;                                         // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Mons2_On;                                          // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Mons1_Off;                                         // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Mons1_On;                                          // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PartyName_2;                                       // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PartyName_1;                                       // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       off;                                               // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Base_Maya;                                         // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Base_Kamyu;                                        // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Base_Normal;                                       // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           arrow;                                             // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Csr;                                               // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Csr_Add;                                           // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dispatch_FriendBase02_3;                           // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dispatch_FriendBase_02_1;                          // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dispatch_FriendBase_02_2;                          // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Area;                                         // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Member_1;                                          // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Member_2;                                          // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Member_3;                                          // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Member_1_Base;                                     // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Member_1_Face;                                     // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Member_2_Base;                                     // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Member_2_Face;                                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Member_3_Base;                                     // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Member_3_Face;                                     // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameAndStatus_0;                                   // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameAndStatus_1;                                   // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameAndStatus_2;                                   // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameAndStatus_3;                                   // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Normal_Base;                                       // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Normal_Base_GrayOut;                               // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReturnLogo;                                        // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TimeBase_01;                                       // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_1_1;                                    // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_1_2;                                    // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_2_1;                                    // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_2_2;                                    // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_3_1;                                    // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_3_2;                                    // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_Counter_Eff_00_C*           W_Dispatch_Counter_Eff;                            // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_Counter_Eff_00_C*           W_Dispatch_Counter_Eff_1;                          // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_Counter_Eff_00_C*           W_Dispatch_Counter_Eff_2;                          // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_Counter_Eff_00_C*           W_Dispatch_Counter_Eff_01;                         // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Dispatch_Match_Eff_C*                W_Dispatch_Match_Eff;                              // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TeamIcon_Set_C*                      W_TeamIcon_Set;                                    // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Dispatch_Panel_00_C">();
	}
	static class UW_Dispatch_Panel_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Dispatch_Panel_00_C>();
	}
};
static_assert(alignof(UW_Dispatch_Panel_00_C) == 0x000008, "Wrong alignment on UW_Dispatch_Panel_00_C");
static_assert(sizeof(UW_Dispatch_Panel_00_C) == 0x000788, "Wrong size on UW_Dispatch_Panel_00_C");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Match_0) == 0x0005A8, "Member 'UW_Dispatch_Panel_00_C::Match_0' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, NewAnimation) == 0x0005B0, "Member 'UW_Dispatch_Panel_00_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Match_100) == 0x0005B8, "Member 'UW_Dispatch_Panel_00_C::Match_100' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Match_50) == 0x0005C0, "Member 'UW_Dispatch_Panel_00_C::Match_50' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Cursor_Stop) == 0x0005C8, "Member 'UW_Dispatch_Panel_00_C::Cursor_Stop' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Status_3) == 0x0005D0, "Member 'UW_Dispatch_Panel_00_C::Status_3' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Status_2) == 0x0005D8, "Member 'UW_Dispatch_Panel_00_C::Status_2' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Status_1) == 0x0005E0, "Member 'UW_Dispatch_Panel_00_C::Status_1' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Status_0) == 0x0005E8, "Member 'UW_Dispatch_Panel_00_C::Status_0' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Mons3_Off) == 0x0005F0, "Member 'UW_Dispatch_Panel_00_C::Mons3_Off' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Mons3_On) == 0x0005F8, "Member 'UW_Dispatch_Panel_00_C::Mons3_On' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Mons2_Off) == 0x000600, "Member 'UW_Dispatch_Panel_00_C::Mons2_Off' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Mons2_On) == 0x000608, "Member 'UW_Dispatch_Panel_00_C::Mons2_On' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Mons1_Off) == 0x000610, "Member 'UW_Dispatch_Panel_00_C::Mons1_Off' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Mons1_On) == 0x000618, "Member 'UW_Dispatch_Panel_00_C::Mons1_On' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, PartyName_2) == 0x000620, "Member 'UW_Dispatch_Panel_00_C::PartyName_2' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, PartyName_1) == 0x000628, "Member 'UW_Dispatch_Panel_00_C::PartyName_1' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, off) == 0x000630, "Member 'UW_Dispatch_Panel_00_C::off' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Wait) == 0x000638, "Member 'UW_Dispatch_Panel_00_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, on) == 0x000640, "Member 'UW_Dispatch_Panel_00_C::on' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Base_Maya) == 0x000648, "Member 'UW_Dispatch_Panel_00_C::Base_Maya' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Base_Kamyu) == 0x000650, "Member 'UW_Dispatch_Panel_00_C::Base_Kamyu' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Base_Normal) == 0x000658, "Member 'UW_Dispatch_Panel_00_C::Base_Normal' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, arrow) == 0x000660, "Member 'UW_Dispatch_Panel_00_C::arrow' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, BG) == 0x000668, "Member 'UW_Dispatch_Panel_00_C::BG' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Csr) == 0x000670, "Member 'UW_Dispatch_Panel_00_C::Csr' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Csr_Add) == 0x000678, "Member 'UW_Dispatch_Panel_00_C::Csr_Add' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Dispatch_FriendBase02_3) == 0x000680, "Member 'UW_Dispatch_Panel_00_C::Dispatch_FriendBase02_3' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Dispatch_FriendBase_02_1) == 0x000688, "Member 'UW_Dispatch_Panel_00_C::Dispatch_FriendBase_02_1' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Dispatch_FriendBase_02_2) == 0x000690, "Member 'UW_Dispatch_Panel_00_C::Dispatch_FriendBase_02_2' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Icon_Area) == 0x000698, "Member 'UW_Dispatch_Panel_00_C::Icon_Area' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Member_1) == 0x0006A0, "Member 'UW_Dispatch_Panel_00_C::Member_1' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Member_2) == 0x0006A8, "Member 'UW_Dispatch_Panel_00_C::Member_2' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Member_3) == 0x0006B0, "Member 'UW_Dispatch_Panel_00_C::Member_3' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Member_1_Base) == 0x0006B8, "Member 'UW_Dispatch_Panel_00_C::Member_1_Base' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Member_1_Face) == 0x0006C0, "Member 'UW_Dispatch_Panel_00_C::Member_1_Face' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Member_2_Base) == 0x0006C8, "Member 'UW_Dispatch_Panel_00_C::Member_2_Base' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Member_2_Face) == 0x0006D0, "Member 'UW_Dispatch_Panel_00_C::Member_2_Face' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Member_3_Base) == 0x0006D8, "Member 'UW_Dispatch_Panel_00_C::Member_3_Base' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Member_3_Face) == 0x0006E0, "Member 'UW_Dispatch_Panel_00_C::Member_3_Face' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, NameAndStatus_0) == 0x0006E8, "Member 'UW_Dispatch_Panel_00_C::NameAndStatus_0' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, NameAndStatus_1) == 0x0006F0, "Member 'UW_Dispatch_Panel_00_C::NameAndStatus_1' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, NameAndStatus_2) == 0x0006F8, "Member 'UW_Dispatch_Panel_00_C::NameAndStatus_2' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, NameAndStatus_3) == 0x000700, "Member 'UW_Dispatch_Panel_00_C::NameAndStatus_3' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Normal_Base) == 0x000708, "Member 'UW_Dispatch_Panel_00_C::Normal_Base' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, Normal_Base_GrayOut) == 0x000710, "Member 'UW_Dispatch_Panel_00_C::Normal_Base_GrayOut' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, ReturnLogo) == 0x000718, "Member 'UW_Dispatch_Panel_00_C::ReturnLogo' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, TimeBase_01) == 0x000720, "Member 'UW_Dispatch_Panel_00_C::TimeBase_01' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, W_Category_1_1) == 0x000728, "Member 'UW_Dispatch_Panel_00_C::W_Category_1_1' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, W_Category_1_2) == 0x000730, "Member 'UW_Dispatch_Panel_00_C::W_Category_1_2' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, W_Category_2_1) == 0x000738, "Member 'UW_Dispatch_Panel_00_C::W_Category_2_1' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, W_Category_2_2) == 0x000740, "Member 'UW_Dispatch_Panel_00_C::W_Category_2_2' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, W_Category_3_1) == 0x000748, "Member 'UW_Dispatch_Panel_00_C::W_Category_3_1' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, W_Category_3_2) == 0x000750, "Member 'UW_Dispatch_Panel_00_C::W_Category_3_2' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, W_Dispatch_Counter_Eff) == 0x000758, "Member 'UW_Dispatch_Panel_00_C::W_Dispatch_Counter_Eff' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, W_Dispatch_Counter_Eff_1) == 0x000760, "Member 'UW_Dispatch_Panel_00_C::W_Dispatch_Counter_Eff_1' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, W_Dispatch_Counter_Eff_2) == 0x000768, "Member 'UW_Dispatch_Panel_00_C::W_Dispatch_Counter_Eff_2' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, W_Dispatch_Counter_Eff_01) == 0x000770, "Member 'UW_Dispatch_Panel_00_C::W_Dispatch_Counter_Eff_01' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, W_Dispatch_Match_Eff) == 0x000778, "Member 'UW_Dispatch_Panel_00_C::W_Dispatch_Match_Eff' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_Panel_00_C, W_TeamIcon_Set) == 0x000780, "Member 'UW_Dispatch_Panel_00_C::W_TeamIcon_Set' has a wrong offset!");

}

