#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Dispatch_CategoryIcon_Effect_3

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Dispatch_CategoryIcon_Effect_3.W_Dispatch_CategoryIcon_Effect_3_C
// 0x0038 (0x04C8 - 0x0490)
class UW_Dispatch_CategoryIcon_Effect_3_C final : public UUIDispatch_CategoryIcon_Effect
{
public:
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Effect_Off;                                        // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Effect_Wait;                                       // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Effect_01;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_02;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_1E;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_2E;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Dispatch_CategoryIcon_Effect_3_C">();
	}
	static class UW_Dispatch_CategoryIcon_Effect_3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Dispatch_CategoryIcon_Effect_3_C>();
	}
};
static_assert(alignof(UW_Dispatch_CategoryIcon_Effect_3_C) == 0x000008, "Wrong alignment on UW_Dispatch_CategoryIcon_Effect_3_C");
static_assert(sizeof(UW_Dispatch_CategoryIcon_Effect_3_C) == 0x0004C8, "Wrong size on UW_Dispatch_CategoryIcon_Effect_3_C");
static_assert(offsetof(UW_Dispatch_CategoryIcon_Effect_3_C, NewAnimation) == 0x000490, "Member 'UW_Dispatch_CategoryIcon_Effect_3_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_CategoryIcon_Effect_3_C, Effect_Off) == 0x000498, "Member 'UW_Dispatch_CategoryIcon_Effect_3_C::Effect_Off' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_CategoryIcon_Effect_3_C, Effect_Wait) == 0x0004A0, "Member 'UW_Dispatch_CategoryIcon_Effect_3_C::Effect_Wait' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_CategoryIcon_Effect_3_C, Effect_01) == 0x0004A8, "Member 'UW_Dispatch_CategoryIcon_Effect_3_C::Effect_01' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_CategoryIcon_Effect_3_C, Effect_02) == 0x0004B0, "Member 'UW_Dispatch_CategoryIcon_Effect_3_C::Effect_02' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_CategoryIcon_Effect_3_C, Effect_1E) == 0x0004B8, "Member 'UW_Dispatch_CategoryIcon_Effect_3_C::Effect_1E' has a wrong offset!");
static_assert(offsetof(UW_Dispatch_CategoryIcon_Effect_3_C, Effect_2E) == 0x0004C0, "Member 'UW_Dispatch_CategoryIcon_Effect_3_C::Effect_2E' has a wrong offset!");

}

