#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Dungeon_Floor

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Dungeon_Floor.W_Dungeon_Floor_C
// 0x0018 (0x04A8 - 0x0490)
class UW_Dungeon_Floor_C final : public UUIDungeon_Floor
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BasePanel;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Dungeon_Floor_C">();
	}
	static class UW_Dungeon_Floor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Dungeon_Floor_C>();
	}
};
static_assert(alignof(UW_Dungeon_Floor_C) == 0x000008, "Wrong alignment on UW_Dungeon_Floor_C");
static_assert(sizeof(UW_Dungeon_Floor_C) == 0x0004A8, "Wrong size on UW_Dungeon_Floor_C");
static_assert(offsetof(UW_Dungeon_Floor_C, Out) == 0x000490, "Member 'UW_Dungeon_Floor_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Dungeon_Floor_C, In) == 0x000498, "Member 'UW_Dungeon_Floor_C::In' has a wrong offset!");
static_assert(offsetof(UW_Dungeon_Floor_C, BasePanel) == 0x0004A0, "Member 'UW_Dungeon_Floor_C::BasePanel' has a wrong offset!");

}

