#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EstimatedPriceUpPerformance_Root

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_EstimatedPriceUpPerformance_Root.W_EstimatedPriceUpPerformance_Root_C
// 0x0018 (0x0530 - 0x0518)
class UW_EstimatedPriceUpPerformance_Root_C final : public UUIEstimatedPriceUpPerformance_Root
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BK;                                                // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_EstimatedPriceUpPerformance_Root_C">();
	}
	static class UW_EstimatedPriceUpPerformance_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_EstimatedPriceUpPerformance_Root_C>();
	}
};
static_assert(alignof(UW_EstimatedPriceUpPerformance_Root_C) == 0x000008, "Wrong alignment on UW_EstimatedPriceUpPerformance_Root_C");
static_assert(sizeof(UW_EstimatedPriceUpPerformance_Root_C) == 0x000530, "Wrong size on UW_EstimatedPriceUpPerformance_Root_C");
static_assert(offsetof(UW_EstimatedPriceUpPerformance_Root_C, Out) == 0x000518, "Member 'UW_EstimatedPriceUpPerformance_Root_C::Out' has a wrong offset!");
static_assert(offsetof(UW_EstimatedPriceUpPerformance_Root_C, In) == 0x000520, "Member 'UW_EstimatedPriceUpPerformance_Root_C::In' has a wrong offset!");
static_assert(offsetof(UW_EstimatedPriceUpPerformance_Root_C, BK) == 0x000528, "Member 'UW_EstimatedPriceUpPerformance_Root_C::BK' has a wrong offset!");

}

