#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Facility_CategoryArea

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Facility_CategoryArea.W_Facility_CategoryArea_C
// 0x0110 (0x05A0 - 0x0490)
class UW_Facility_CategoryArea_C final : public UUIFacility_CategoryArea
{
public:
	class UWidgetAnimation*                       Set_4_Off;                                         // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Set_4_On;                                          // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Set_3_Off;                                         // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Set_3_On;                                          // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Set_2_Off;                                         // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Set_2_On;                                          // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Set_1_Off;                                         // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Set_1_On;                                          // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Set_0_Off;                                         // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Set_0_On;                                          // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AreaIcon_0;                                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AreaIcon_1;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AreaIcon_2;                                        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AreaIcon_3;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AreaIcon_4;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseBar;                                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow_0;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow_1;                                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow_2;                                          // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow_3;                                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow_4;                                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_Panel_0;                                // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_Panel_1;                                // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_Panel_2;                                // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_Panel_3;                                // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_Panel_4;                                // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_Panel_5;                                // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_Panel_6;                                // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_Panel_7;                                // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_Panel_8;                                // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 W_Category_Panel_9;                                // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Facility_CategoryArea_C">();
	}
	static class UW_Facility_CategoryArea_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Facility_CategoryArea_C>();
	}
};
static_assert(alignof(UW_Facility_CategoryArea_C) == 0x000008, "Wrong alignment on UW_Facility_CategoryArea_C");
static_assert(sizeof(UW_Facility_CategoryArea_C) == 0x0005A0, "Wrong size on UW_Facility_CategoryArea_C");
static_assert(offsetof(UW_Facility_CategoryArea_C, Set_4_Off) == 0x000490, "Member 'UW_Facility_CategoryArea_C::Set_4_Off' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Set_4_On) == 0x000498, "Member 'UW_Facility_CategoryArea_C::Set_4_On' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Set_3_Off) == 0x0004A0, "Member 'UW_Facility_CategoryArea_C::Set_3_Off' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Set_3_On) == 0x0004A8, "Member 'UW_Facility_CategoryArea_C::Set_3_On' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Set_2_Off) == 0x0004B0, "Member 'UW_Facility_CategoryArea_C::Set_2_Off' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Set_2_On) == 0x0004B8, "Member 'UW_Facility_CategoryArea_C::Set_2_On' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Set_1_Off) == 0x0004C0, "Member 'UW_Facility_CategoryArea_C::Set_1_Off' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Set_1_On) == 0x0004C8, "Member 'UW_Facility_CategoryArea_C::Set_1_On' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Set_0_Off) == 0x0004D0, "Member 'UW_Facility_CategoryArea_C::Set_0_Off' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Set_0_On) == 0x0004D8, "Member 'UW_Facility_CategoryArea_C::Set_0_On' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, AreaIcon_0) == 0x0004E0, "Member 'UW_Facility_CategoryArea_C::AreaIcon_0' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, AreaIcon_1) == 0x0004E8, "Member 'UW_Facility_CategoryArea_C::AreaIcon_1' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, AreaIcon_2) == 0x0004F0, "Member 'UW_Facility_CategoryArea_C::AreaIcon_2' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, AreaIcon_3) == 0x0004F8, "Member 'UW_Facility_CategoryArea_C::AreaIcon_3' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, AreaIcon_4) == 0x000500, "Member 'UW_Facility_CategoryArea_C::AreaIcon_4' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, BaseBar) == 0x000508, "Member 'UW_Facility_CategoryArea_C::BaseBar' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Image_1) == 0x000510, "Member 'UW_Facility_CategoryArea_C::Image_1' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Image_2) == 0x000518, "Member 'UW_Facility_CategoryArea_C::Image_2' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Image_3) == 0x000520, "Member 'UW_Facility_CategoryArea_C::Image_3' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Shadow_0) == 0x000528, "Member 'UW_Facility_CategoryArea_C::Shadow_0' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Shadow_1) == 0x000530, "Member 'UW_Facility_CategoryArea_C::Shadow_1' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Shadow_2) == 0x000538, "Member 'UW_Facility_CategoryArea_C::Shadow_2' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Shadow_3) == 0x000540, "Member 'UW_Facility_CategoryArea_C::Shadow_3' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, Shadow_4) == 0x000548, "Member 'UW_Facility_CategoryArea_C::Shadow_4' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, W_Category_Panel_0) == 0x000550, "Member 'UW_Facility_CategoryArea_C::W_Category_Panel_0' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, W_Category_Panel_1) == 0x000558, "Member 'UW_Facility_CategoryArea_C::W_Category_Panel_1' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, W_Category_Panel_2) == 0x000560, "Member 'UW_Facility_CategoryArea_C::W_Category_Panel_2' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, W_Category_Panel_3) == 0x000568, "Member 'UW_Facility_CategoryArea_C::W_Category_Panel_3' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, W_Category_Panel_4) == 0x000570, "Member 'UW_Facility_CategoryArea_C::W_Category_Panel_4' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, W_Category_Panel_5) == 0x000578, "Member 'UW_Facility_CategoryArea_C::W_Category_Panel_5' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, W_Category_Panel_6) == 0x000580, "Member 'UW_Facility_CategoryArea_C::W_Category_Panel_6' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, W_Category_Panel_7) == 0x000588, "Member 'UW_Facility_CategoryArea_C::W_Category_Panel_7' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, W_Category_Panel_8) == 0x000590, "Member 'UW_Facility_CategoryArea_C::W_Category_Panel_8' has a wrong offset!");
static_assert(offsetof(UW_Facility_CategoryArea_C, W_Category_Panel_9) == 0x000598, "Member 'UW_Facility_CategoryArea_C::W_Category_Panel_9' has a wrong offset!");

}

