#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_WinAction

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_WinAction.W_Field_WinAction_C
// 0x0100 (0x05F0 - 0x04F0)
class UW_Field_WinAction_C final : public UUIField_WinAction
{
public:
	class UWidgetAnimation*                       NewAnimation;                                      // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Caution_Off;                                       // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Caution_Wait;                                      // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Caution_On;                                        // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Trade_Off;                                         // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Trade_On;                                          // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Nagaoshi2_Off;                                     // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Nagaoshi2_On;                                      // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disabled_Off;                                      // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disabled_On;                                       // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Watasu_Naderu;                                     // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Watasu;                                            // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Naderu;                                            // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out_Icon;                                          // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_Icon;                                           // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AButton_Hold;                                      // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AButton_Hold_1;                                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Action_base;                                       // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Action_base_1;                                     // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Disabled_Icon;                                     // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_68;                                          // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Input_Button;                                      // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Input_Button_1;                                    // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StrokeFlame;                                       // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StrokeFlame_1;                                     // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text_Action;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text_Action_1;                                     // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_FieldAction_Caution_04_C*            W_FieldAction_Caution_04;                          // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_FieldAction_Glut_C*                  W_FieldAction_Glut;                                // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_FieldActionGauge_C*                  W_FieldActionGauge;                                // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_WinAction_C">();
	}
	static class UW_Field_WinAction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_WinAction_C>();
	}
};
static_assert(alignof(UW_Field_WinAction_C) == 0x000010, "Wrong alignment on UW_Field_WinAction_C");
static_assert(sizeof(UW_Field_WinAction_C) == 0x0005F0, "Wrong size on UW_Field_WinAction_C");
static_assert(offsetof(UW_Field_WinAction_C, NewAnimation) == 0x0004F0, "Member 'UW_Field_WinAction_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Caution_Off) == 0x0004F8, "Member 'UW_Field_WinAction_C::Caution_Off' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Caution_Wait) == 0x000500, "Member 'UW_Field_WinAction_C::Caution_Wait' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Caution_On) == 0x000508, "Member 'UW_Field_WinAction_C::Caution_On' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Trade_Off) == 0x000510, "Member 'UW_Field_WinAction_C::Trade_Off' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Trade_On) == 0x000518, "Member 'UW_Field_WinAction_C::Trade_On' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Nagaoshi2_Off) == 0x000520, "Member 'UW_Field_WinAction_C::Nagaoshi2_Off' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Nagaoshi2_On) == 0x000528, "Member 'UW_Field_WinAction_C::Nagaoshi2_On' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Disabled_Off) == 0x000530, "Member 'UW_Field_WinAction_C::Disabled_Off' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Disabled_On) == 0x000538, "Member 'UW_Field_WinAction_C::Disabled_On' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Watasu_Naderu) == 0x000540, "Member 'UW_Field_WinAction_C::Watasu_Naderu' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Watasu) == 0x000548, "Member 'UW_Field_WinAction_C::Watasu' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Normal) == 0x000550, "Member 'UW_Field_WinAction_C::Normal' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Naderu) == 0x000558, "Member 'UW_Field_WinAction_C::Naderu' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Out_Icon) == 0x000560, "Member 'UW_Field_WinAction_C::Out_Icon' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, In_Icon) == 0x000568, "Member 'UW_Field_WinAction_C::In_Icon' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, AButton_Hold) == 0x000570, "Member 'UW_Field_WinAction_C::AButton_Hold' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, AButton_Hold_1) == 0x000578, "Member 'UW_Field_WinAction_C::AButton_Hold_1' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Action_base) == 0x000580, "Member 'UW_Field_WinAction_C::Action_base' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Action_base_1) == 0x000588, "Member 'UW_Field_WinAction_C::Action_base_1' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Disabled_Icon) == 0x000590, "Member 'UW_Field_WinAction_C::Disabled_Icon' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Image) == 0x000598, "Member 'UW_Field_WinAction_C::Image' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Image_68) == 0x0005A0, "Member 'UW_Field_WinAction_C::Image_68' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Input_Button) == 0x0005A8, "Member 'UW_Field_WinAction_C::Input_Button' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Input_Button_1) == 0x0005B0, "Member 'UW_Field_WinAction_C::Input_Button_1' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, StrokeFlame) == 0x0005B8, "Member 'UW_Field_WinAction_C::StrokeFlame' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, StrokeFlame_1) == 0x0005C0, "Member 'UW_Field_WinAction_C::StrokeFlame_1' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Text_Action) == 0x0005C8, "Member 'UW_Field_WinAction_C::Text_Action' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, Text_Action_1) == 0x0005D0, "Member 'UW_Field_WinAction_C::Text_Action_1' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, W_FieldAction_Caution_04) == 0x0005D8, "Member 'UW_Field_WinAction_C::W_FieldAction_Caution_04' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, W_FieldAction_Glut) == 0x0005E0, "Member 'UW_Field_WinAction_C::W_FieldAction_Glut' has a wrong offset!");
static_assert(offsetof(UW_Field_WinAction_C, W_FieldActionGauge) == 0x0005E8, "Member 'UW_Field_WinAction_C::W_FieldActionGauge' has a wrong offset!");

}

