#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_SearchPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Field_SearchPoint.W_Field_SearchPoint_C.WaitAnim
// 0x0008 (0x0008 - 0x0000)
struct W_Field_SearchPoint_C_WaitAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_SearchPoint_C_WaitAnim) == 0x000008, "Wrong alignment on W_Field_SearchPoint_C_WaitAnim");
static_assert(sizeof(W_Field_SearchPoint_C_WaitAnim) == 0x000008, "Wrong size on W_Field_SearchPoint_C_WaitAnim");
static_assert(offsetof(W_Field_SearchPoint_C_WaitAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'W_Field_SearchPoint_C_WaitAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function W_Field_SearchPoint.W_Field_SearchPoint_C.PlayAnim
// 0x0008 (0x0008 - 0x0000)
struct W_Field_SearchPoint_C_PlayAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_SearchPoint_C_PlayAnim) == 0x000008, "Wrong alignment on W_Field_SearchPoint_C_PlayAnim");
static_assert(sizeof(W_Field_SearchPoint_C_PlayAnim) == 0x000008, "Wrong size on W_Field_SearchPoint_C_PlayAnim");
static_assert(offsetof(W_Field_SearchPoint_C_PlayAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'W_Field_SearchPoint_C_PlayAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

