#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_IconStamp_21

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_IconStamp_21.W_Field_IconStamp_21_C
// 0x0040 (0x0650 - 0x0610)
class UW_Field_IconStamp_21_C final : public UUIField_StampIconBase
{
public:
	class UWidgetAnimation*                       off;                                               // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_297;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_298;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Kira_1;                                            // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Kira_2;                                            // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Kira_3;                                            // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_IconStamp_21_C">();
	}
	static class UW_Field_IconStamp_21_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_IconStamp_21_C>();
	}
};
static_assert(alignof(UW_Field_IconStamp_21_C) == 0x000010, "Wrong alignment on UW_Field_IconStamp_21_C");
static_assert(sizeof(UW_Field_IconStamp_21_C) == 0x000650, "Wrong size on UW_Field_IconStamp_21_C");
static_assert(offsetof(UW_Field_IconStamp_21_C, off) == 0x000610, "Member 'UW_Field_IconStamp_21_C::off' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_21_C, on) == 0x000618, "Member 'UW_Field_IconStamp_21_C::on' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_21_C, Image_297) == 0x000620, "Member 'UW_Field_IconStamp_21_C::Image_297' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_21_C, Image_298) == 0x000628, "Member 'UW_Field_IconStamp_21_C::Image_298' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_21_C, Kira_1) == 0x000630, "Member 'UW_Field_IconStamp_21_C::Kira_1' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_21_C, Kira_2) == 0x000638, "Member 'UW_Field_IconStamp_21_C::Kira_2' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_21_C, Kira_3) == 0x000640, "Member 'UW_Field_IconStamp_21_C::Kira_3' has a wrong offset!");

}

