#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_QuestConfirmation

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_QuestConfirmation.W_Field_QuestConfirmation_C
// 0x0020 (0x0540 - 0x0520)
class UW_Field_QuestConfirmation_C final : public UUIField_QuestConfirmation
{
public:
	class UWidgetAnimation*                       In;                                                // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Button;                                            // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextBase;                                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_QuestConfirmation_C">();
	}
	static class UW_Field_QuestConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_QuestConfirmation_C>();
	}
};
static_assert(alignof(UW_Field_QuestConfirmation_C) == 0x000010, "Wrong alignment on UW_Field_QuestConfirmation_C");
static_assert(sizeof(UW_Field_QuestConfirmation_C) == 0x000540, "Wrong size on UW_Field_QuestConfirmation_C");
static_assert(offsetof(UW_Field_QuestConfirmation_C, In) == 0x000520, "Member 'UW_Field_QuestConfirmation_C::In' has a wrong offset!");
static_assert(offsetof(UW_Field_QuestConfirmation_C, Button) == 0x000528, "Member 'UW_Field_QuestConfirmation_C::Button' has a wrong offset!");
static_assert(offsetof(UW_Field_QuestConfirmation_C, TextBase) == 0x000530, "Member 'UW_Field_QuestConfirmation_C::TextBase' has a wrong offset!");

}

