#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_WinPStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_WinPStatus.W_Field_WinPStatus_C
// 0x00F8 (0x06A0 - 0x05A8)
class UW_Field_WinPStatus_C final : public UUIField_WinPStatus
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Dead;                                              // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Danger;                                            // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Damage;                                            // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Base_out;                                          // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Base_in;                                           // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_PlayerGauge_C*                       GaugeHP;                                           // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlayerGauge_C*                       GaugeMP;                                           // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Base;                                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Coffin;                                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Danger;                                      // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Dead;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_face;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Status_Icon_Player_0001;                           // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Status_Icon_Player_0002;                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Status_Icon_Player_0003;                           // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Status_Icon_Player_0004;                           // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text_Hp;                                           // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text_Hp_Gauge;                                     // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text_Lv_01;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text_Lv_02;                                        // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text_MP;                                           // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text_Mp_Gauge;                                     // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text_NAME;                                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Sign_IconLvupStatus_C*               W_Field_Icon_Lvupstatus;                           // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Sign_IconLvup_C*                     W_Field_IconLvup;                                  // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlayerSp_Stock_C*                    W_PlayerSp_Stock;                                  // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         HP;                                                // 0x0680(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxHP;                                             // 0x0684(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Beast;                                             // 0x0688(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxBeast;                                          // 0x068C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0690(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ComboUP;                                           // 0x0694(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_695[0x3];                                      // 0x0695(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BeforeHP;                                          // 0x0698(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BeforeLevel;                                       // 0x069C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetTextColor(class UTextBlock* Text, const struct FLinearColor& Color);
	void SetWindowColor();
	void DamageExec();
	void InitializeLevel();
	void InitializeHP();
	void UpdateHP();
	void Construct();
	void Update(float DeltaTime);
	void PlayLvupAnim();
	void EndLvupAnim();
	void SetHP(int32 InHP, bool IsDamage, bool IsPlayAnim);
	void SetMaxHP(int32 InMaxHP);
	void SetLevel(int32 NewLevel);
	void ExecLvup(int32 UpLevel, bool ComboUP_0);
	void ExecuteUbergraph_W_Field_WinPStatus(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_WinPStatus_C">();
	}
	static class UW_Field_WinPStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_WinPStatus_C>();
	}
};
static_assert(alignof(UW_Field_WinPStatus_C) == 0x000008, "Wrong alignment on UW_Field_WinPStatus_C");
static_assert(sizeof(UW_Field_WinPStatus_C) == 0x0006A0, "Wrong size on UW_Field_WinPStatus_C");
static_assert(offsetof(UW_Field_WinPStatus_C, UberGraphFrame) == 0x0005A8, "Member 'UW_Field_WinPStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Dead) == 0x0005B0, "Member 'UW_Field_WinPStatus_C::Dead' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Danger) == 0x0005B8, "Member 'UW_Field_WinPStatus_C::Danger' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Damage) == 0x0005C0, "Member 'UW_Field_WinPStatus_C::Damage' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Base_out) == 0x0005C8, "Member 'UW_Field_WinPStatus_C::Base_out' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Base_in) == 0x0005D0, "Member 'UW_Field_WinPStatus_C::Base_in' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, GaugeHP) == 0x0005D8, "Member 'UW_Field_WinPStatus_C::GaugeHP' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, GaugeMP) == 0x0005E0, "Member 'UW_Field_WinPStatus_C::GaugeMP' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Image_Base) == 0x0005E8, "Member 'UW_Field_WinPStatus_C::Image_Base' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Image_Coffin) == 0x0005F0, "Member 'UW_Field_WinPStatus_C::Image_Coffin' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Image_Danger) == 0x0005F8, "Member 'UW_Field_WinPStatus_C::Image_Danger' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Image_Dead) == 0x000600, "Member 'UW_Field_WinPStatus_C::Image_Dead' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Image_face) == 0x000608, "Member 'UW_Field_WinPStatus_C::Image_face' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Status_Icon_Player_0001) == 0x000610, "Member 'UW_Field_WinPStatus_C::Status_Icon_Player_0001' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Status_Icon_Player_0002) == 0x000618, "Member 'UW_Field_WinPStatus_C::Status_Icon_Player_0002' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Status_Icon_Player_0003) == 0x000620, "Member 'UW_Field_WinPStatus_C::Status_Icon_Player_0003' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Status_Icon_Player_0004) == 0x000628, "Member 'UW_Field_WinPStatus_C::Status_Icon_Player_0004' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Text_Hp) == 0x000630, "Member 'UW_Field_WinPStatus_C::Text_Hp' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Text_Hp_Gauge) == 0x000638, "Member 'UW_Field_WinPStatus_C::Text_Hp_Gauge' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Text_Lv_01) == 0x000640, "Member 'UW_Field_WinPStatus_C::Text_Lv_01' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Text_Lv_02) == 0x000648, "Member 'UW_Field_WinPStatus_C::Text_Lv_02' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Text_MP) == 0x000650, "Member 'UW_Field_WinPStatus_C::Text_MP' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Text_Mp_Gauge) == 0x000658, "Member 'UW_Field_WinPStatus_C::Text_Mp_Gauge' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Text_NAME) == 0x000660, "Member 'UW_Field_WinPStatus_C::Text_NAME' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, W_Field_Icon_Lvupstatus) == 0x000668, "Member 'UW_Field_WinPStatus_C::W_Field_Icon_Lvupstatus' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, W_Field_IconLvup) == 0x000670, "Member 'UW_Field_WinPStatus_C::W_Field_IconLvup' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, W_PlayerSp_Stock) == 0x000678, "Member 'UW_Field_WinPStatus_C::W_PlayerSp_Stock' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, HP) == 0x000680, "Member 'UW_Field_WinPStatus_C::HP' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, MaxHP) == 0x000684, "Member 'UW_Field_WinPStatus_C::MaxHP' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Beast) == 0x000688, "Member 'UW_Field_WinPStatus_C::Beast' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, MaxBeast) == 0x00068C, "Member 'UW_Field_WinPStatus_C::MaxBeast' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, Level) == 0x000690, "Member 'UW_Field_WinPStatus_C::Level' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, ComboUP) == 0x000694, "Member 'UW_Field_WinPStatus_C::ComboUP' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, BeforeHP) == 0x000698, "Member 'UW_Field_WinPStatus_C::BeforeHP' has a wrong offset!");
static_assert(offsetof(UW_Field_WinPStatus_C, BeforeLevel) == 0x00069C, "Member 'UW_Field_WinPStatus_C::BeforeLevel' has a wrong offset!");

}

