#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_IconQuestline

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_IconQuestline.W_Field_IconQuestLine_C
// 0x0060 (0x0538 - 0x04D8)
class UW_Field_IconQuestLine_C final : public UUIField_IconQuestLine
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Quest_Off;                                         // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Quest_On;                                          // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Clear_Quest;                                       // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Start_Quest;                                       // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Button_Plus_1;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Official;                                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_Body;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_Head;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text_Quest;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text_Questmenu;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTW_Field_IconQuestLine_3();
	void SequenceEvent__ENTRYPOINTW_Field_IconQuestLine_2();
	void SequenceEvent__ENTRYPOINTW_Field_IconQuestLine_1();
	void SequenceEvent__ENTRYPOINTW_Field_IconQuestLine_0();
	void StartQuestAnimEnd();
	void StampWait();
	void StampAnimEnd();
	void ClearQuestAnimEnd();
	void ExecuteUbergraph_W_Field_IconQuestLine(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_IconQuestLine_C">();
	}
	static class UW_Field_IconQuestLine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_IconQuestLine_C>();
	}
};
static_assert(alignof(UW_Field_IconQuestLine_C) == 0x000008, "Wrong alignment on UW_Field_IconQuestLine_C");
static_assert(sizeof(UW_Field_IconQuestLine_C) == 0x000538, "Wrong size on UW_Field_IconQuestLine_C");
static_assert(offsetof(UW_Field_IconQuestLine_C, UberGraphFrame) == 0x0004D8, "Member 'UW_Field_IconQuestLine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Field_IconQuestLine_C, Quest_Off) == 0x0004E0, "Member 'UW_Field_IconQuestLine_C::Quest_Off' has a wrong offset!");
static_assert(offsetof(UW_Field_IconQuestLine_C, Quest_On) == 0x0004E8, "Member 'UW_Field_IconQuestLine_C::Quest_On' has a wrong offset!");
static_assert(offsetof(UW_Field_IconQuestLine_C, Clear_Quest) == 0x0004F0, "Member 'UW_Field_IconQuestLine_C::Clear_Quest' has a wrong offset!");
static_assert(offsetof(UW_Field_IconQuestLine_C, Start_Quest) == 0x0004F8, "Member 'UW_Field_IconQuestLine_C::Start_Quest' has a wrong offset!");
static_assert(offsetof(UW_Field_IconQuestLine_C, Button_Plus_1) == 0x000500, "Member 'UW_Field_IconQuestLine_C::Button_Plus_1' has a wrong offset!");
static_assert(offsetof(UW_Field_IconQuestLine_C, Icon_Official) == 0x000508, "Member 'UW_Field_IconQuestLine_C::Icon_Official' has a wrong offset!");
static_assert(offsetof(UW_Field_IconQuestLine_C, Image_1) == 0x000510, "Member 'UW_Field_IconQuestLine_C::Image_1' has a wrong offset!");
static_assert(offsetof(UW_Field_IconQuestLine_C, Line_Body) == 0x000518, "Member 'UW_Field_IconQuestLine_C::Line_Body' has a wrong offset!");
static_assert(offsetof(UW_Field_IconQuestLine_C, Line_Head) == 0x000520, "Member 'UW_Field_IconQuestLine_C::Line_Head' has a wrong offset!");
static_assert(offsetof(UW_Field_IconQuestLine_C, Text_Quest) == 0x000528, "Member 'UW_Field_IconQuestLine_C::Text_Quest' has a wrong offset!");
static_assert(offsetof(UW_Field_IconQuestLine_C, Text_Questmenu) == 0x000530, "Member 'UW_Field_IconQuestLine_C::Text_Questmenu' has a wrong offset!");

}

