#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_TacticsWord

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_TacticsWord.W_Field_TacticsWord_C
// 0x0040 (0x0600 - 0x05C0)
class UW_Field_TacticsWord_C final : public UUIField_TacticsWord
{
public:
	class UWidgetAnimation*                       Color_2;                                           // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color_1;                                           // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text;                                              // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WordBase;                                          // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_TacticsWord_C">();
	}
	static class UW_Field_TacticsWord_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_TacticsWord_C>();
	}
};
static_assert(alignof(UW_Field_TacticsWord_C) == 0x000010, "Wrong alignment on UW_Field_TacticsWord_C");
static_assert(sizeof(UW_Field_TacticsWord_C) == 0x000600, "Wrong size on UW_Field_TacticsWord_C");
static_assert(offsetof(UW_Field_TacticsWord_C, Color_2) == 0x0005C0, "Member 'UW_Field_TacticsWord_C::Color_2' has a wrong offset!");
static_assert(offsetof(UW_Field_TacticsWord_C, Color_1) == 0x0005C8, "Member 'UW_Field_TacticsWord_C::Color_1' has a wrong offset!");
static_assert(offsetof(UW_Field_TacticsWord_C, Out) == 0x0005D0, "Member 'UW_Field_TacticsWord_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Field_TacticsWord_C, Wait) == 0x0005D8, "Member 'UW_Field_TacticsWord_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_Field_TacticsWord_C, In) == 0x0005E0, "Member 'UW_Field_TacticsWord_C::In' has a wrong offset!");
static_assert(offsetof(UW_Field_TacticsWord_C, Text) == 0x0005E8, "Member 'UW_Field_TacticsWord_C::Text' has a wrong offset!");
static_assert(offsetof(UW_Field_TacticsWord_C, WordBase) == 0x0005F0, "Member 'UW_Field_TacticsWord_C::WordBase' has a wrong offset!");

}

