#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_WinSkillbox

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_WinSkillbox.W_Field_WinSkillbox_C
// 0x0070 (0x0568 - 0x04F8)
class UW_Field_WinSkillbox_C final : public UUIField_WinSkillbox
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ChainBase;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_NextChain_C*                         W_NextCain_00;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_NextChain_C*                         W_NextCain_01;                                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_NextChain_C*                         W_NextCain_02;                                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_NextChain_C*                         W_NextCain_03;                                     // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SkillChain_Panel_C*                  W_SkillChain_Panel_01;                             // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SkillChain_Panel_C*                  W_SkillChain_Panel_02;                             // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SkillChain_Panel_C*                  W_SkillChain_Panel_03;                             // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SkillChain_Panel_C*                  W_SkillChain_Panel_04;                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SkillChain_Panel_C*                  W_SkillChain_Panel_05;                             // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SkillChain_Panel_C*                  W_SkillChain_Panel_06;                             // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SkillChain_Panel_C*                  W_SkillChain_Panel_07;                             // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_WinSkillbox_C">();
	}
	static class UW_Field_WinSkillbox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_WinSkillbox_C>();
	}
};
static_assert(alignof(UW_Field_WinSkillbox_C) == 0x000008, "Wrong alignment on UW_Field_WinSkillbox_C");
static_assert(sizeof(UW_Field_WinSkillbox_C) == 0x000568, "Wrong size on UW_Field_WinSkillbox_C");
static_assert(offsetof(UW_Field_WinSkillbox_C, Out) == 0x0004F8, "Member 'UW_Field_WinSkillbox_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Field_WinSkillbox_C, In) == 0x000500, "Member 'UW_Field_WinSkillbox_C::In' has a wrong offset!");
static_assert(offsetof(UW_Field_WinSkillbox_C, ChainBase) == 0x000508, "Member 'UW_Field_WinSkillbox_C::ChainBase' has a wrong offset!");
static_assert(offsetof(UW_Field_WinSkillbox_C, W_NextCain_00) == 0x000510, "Member 'UW_Field_WinSkillbox_C::W_NextCain_00' has a wrong offset!");
static_assert(offsetof(UW_Field_WinSkillbox_C, W_NextCain_01) == 0x000518, "Member 'UW_Field_WinSkillbox_C::W_NextCain_01' has a wrong offset!");
static_assert(offsetof(UW_Field_WinSkillbox_C, W_NextCain_02) == 0x000520, "Member 'UW_Field_WinSkillbox_C::W_NextCain_02' has a wrong offset!");
static_assert(offsetof(UW_Field_WinSkillbox_C, W_NextCain_03) == 0x000528, "Member 'UW_Field_WinSkillbox_C::W_NextCain_03' has a wrong offset!");
static_assert(offsetof(UW_Field_WinSkillbox_C, W_SkillChain_Panel_01) == 0x000530, "Member 'UW_Field_WinSkillbox_C::W_SkillChain_Panel_01' has a wrong offset!");
static_assert(offsetof(UW_Field_WinSkillbox_C, W_SkillChain_Panel_02) == 0x000538, "Member 'UW_Field_WinSkillbox_C::W_SkillChain_Panel_02' has a wrong offset!");
static_assert(offsetof(UW_Field_WinSkillbox_C, W_SkillChain_Panel_03) == 0x000540, "Member 'UW_Field_WinSkillbox_C::W_SkillChain_Panel_03' has a wrong offset!");
static_assert(offsetof(UW_Field_WinSkillbox_C, W_SkillChain_Panel_04) == 0x000548, "Member 'UW_Field_WinSkillbox_C::W_SkillChain_Panel_04' has a wrong offset!");
static_assert(offsetof(UW_Field_WinSkillbox_C, W_SkillChain_Panel_05) == 0x000550, "Member 'UW_Field_WinSkillbox_C::W_SkillChain_Panel_05' has a wrong offset!");
static_assert(offsetof(UW_Field_WinSkillbox_C, W_SkillChain_Panel_06) == 0x000558, "Member 'UW_Field_WinSkillbox_C::W_SkillChain_Panel_06' has a wrong offset!");
static_assert(offsetof(UW_Field_WinSkillbox_C, W_SkillChain_Panel_07) == 0x000560, "Member 'UW_Field_WinSkillbox_C::W_SkillChain_Panel_07' has a wrong offset!");

}

