#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_WinLogbox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_WinLogbox.W_Field_WinLogbox_C
// 0x0030 (0x0560 - 0x0530)
class UW_Field_WinLogbox_C final : public UUIField_WinLogbox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_Field_WinLog_C*                      W_Field_WinLog_00;                                 // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_WinLog_C*                      W_Field_WinLog_01;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_WinLog_C*                      W_Field_WinLog_02;                                 // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_WinLog_C*                      W_Field_WinLog_03;                                 // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_WinLog_C*                      W_Field_WinLog_04;                                 // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_W_Field_WinLogbox(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_WinLogbox_C">();
	}
	static class UW_Field_WinLogbox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_WinLogbox_C>();
	}
};
static_assert(alignof(UW_Field_WinLogbox_C) == 0x000008, "Wrong alignment on UW_Field_WinLogbox_C");
static_assert(sizeof(UW_Field_WinLogbox_C) == 0x000560, "Wrong size on UW_Field_WinLogbox_C");
static_assert(offsetof(UW_Field_WinLogbox_C, UberGraphFrame) == 0x000530, "Member 'UW_Field_WinLogbox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Field_WinLogbox_C, W_Field_WinLog_00) == 0x000538, "Member 'UW_Field_WinLogbox_C::W_Field_WinLog_00' has a wrong offset!");
static_assert(offsetof(UW_Field_WinLogbox_C, W_Field_WinLog_01) == 0x000540, "Member 'UW_Field_WinLogbox_C::W_Field_WinLog_01' has a wrong offset!");
static_assert(offsetof(UW_Field_WinLogbox_C, W_Field_WinLog_02) == 0x000548, "Member 'UW_Field_WinLogbox_C::W_Field_WinLog_02' has a wrong offset!");
static_assert(offsetof(UW_Field_WinLogbox_C, W_Field_WinLog_03) == 0x000550, "Member 'UW_Field_WinLogbox_C::W_Field_WinLog_03' has a wrong offset!");
static_assert(offsetof(UW_Field_WinLogbox_C, W_Field_WinLog_04) == 0x000558, "Member 'UW_Field_WinLogbox_C::W_Field_WinLog_04' has a wrong offset!");

}

