#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_Status

#include "Basic.hpp"

#include "DarwinGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_Field_Status.W_Field_Status_C.GetCaution
// 0x0008 (0x0008 - 0x0000)
struct W_Field_Status_C_GetCaution final
{
public:
	class UUICaution*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_GetCaution) == 0x000008, "Wrong alignment on W_Field_Status_C_GetCaution");
static_assert(sizeof(W_Field_Status_C_GetCaution) == 0x000008, "Wrong size on W_Field_Status_C_GetCaution");
static_assert(offsetof(W_Field_Status_C_GetCaution, ReturnValue) == 0x000000, "Member 'W_Field_Status_C_GetCaution::ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.GetQuestConfirmation
// 0x0008 (0x0008 - 0x0000)
struct W_Field_Status_C_GetQuestConfirmation final
{
public:
	class UUIField_QuestConfirmation*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_GetQuestConfirmation) == 0x000008, "Wrong alignment on W_Field_Status_C_GetQuestConfirmation");
static_assert(sizeof(W_Field_Status_C_GetQuestConfirmation) == 0x000008, "Wrong size on W_Field_Status_C_GetQuestConfirmation");
static_assert(offsetof(W_Field_Status_C_GetQuestConfirmation, ReturnValue) == 0x000000, "Member 'W_Field_Status_C_GetQuestConfirmation::ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.GetMapStatus
// 0x0008 (0x0008 - 0x0000)
struct W_Field_Status_C_GetMapStatus final
{
public:
	class UUIMap_WinStatus*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_GetMapStatus) == 0x000008, "Wrong alignment on W_Field_Status_C_GetMapStatus");
static_assert(sizeof(W_Field_Status_C_GetMapStatus) == 0x000008, "Wrong size on W_Field_Status_C_GetMapStatus");
static_assert(offsetof(W_Field_Status_C_GetMapStatus, ReturnValue) == 0x000000, "Member 'W_Field_Status_C_GetMapStatus::ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.GetArtifactIconList
// 0x0008 (0x0008 - 0x0000)
struct W_Field_Status_C_GetArtifactIconList final
{
public:
	class UUIArtifactList_Field*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_GetArtifactIconList) == 0x000008, "Wrong alignment on W_Field_Status_C_GetArtifactIconList");
static_assert(sizeof(W_Field_Status_C_GetArtifactIconList) == 0x000008, "Wrong size on W_Field_Status_C_GetArtifactIconList");
static_assert(offsetof(W_Field_Status_C_GetArtifactIconList, ReturnValue) == 0x000000, "Member 'W_Field_Status_C_GetArtifactIconList::ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.GetBottomCautionAlert
// 0x0008 (0x0008 - 0x0000)
struct W_Field_Status_C_GetBottomCautionAlert final
{
public:
	class UUIAlert_01*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_GetBottomCautionAlert) == 0x000008, "Wrong alignment on W_Field_Status_C_GetBottomCautionAlert");
static_assert(sizeof(W_Field_Status_C_GetBottomCautionAlert) == 0x000008, "Wrong size on W_Field_Status_C_GetBottomCautionAlert");
static_assert(offsetof(W_Field_Status_C_GetBottomCautionAlert, ReturnValue) == 0x000000, "Member 'W_Field_Status_C_GetBottomCautionAlert::ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.GetTopCautionAlert
// 0x0008 (0x0008 - 0x0000)
struct W_Field_Status_C_GetTopCautionAlert final
{
public:
	class UUIAlert_00*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_GetTopCautionAlert) == 0x000008, "Wrong alignment on W_Field_Status_C_GetTopCautionAlert");
static_assert(sizeof(W_Field_Status_C_GetTopCautionAlert) == 0x000008, "Wrong size on W_Field_Status_C_GetTopCautionAlert");
static_assert(offsetof(W_Field_Status_C_GetTopCautionAlert, ReturnValue) == 0x000000, "Member 'W_Field_Status_C_GetTopCautionAlert::ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.GetMonsterVision
// 0x0008 (0x0008 - 0x0000)
struct W_Field_Status_C_GetMonsterVision final
{
public:
	class UUIVision_Field*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_GetMonsterVision) == 0x000008, "Wrong alignment on W_Field_Status_C_GetMonsterVision");
static_assert(sizeof(W_Field_Status_C_GetMonsterVision) == 0x000008, "Wrong size on W_Field_Status_C_GetMonsterVision");
static_assert(offsetof(W_Field_Status_C_GetMonsterVision, ReturnValue) == 0x000000, "Member 'W_Field_Status_C_GetMonsterVision::ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.GetBossStatus
// 0x0008 (0x0008 - 0x0000)
struct W_Field_Status_C_GetBossStatus final
{
public:
	class UUIField_WinBoss*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_GetBossStatus) == 0x000008, "Wrong alignment on W_Field_Status_C_GetBossStatus");
static_assert(sizeof(W_Field_Status_C_GetBossStatus) == 0x000008, "Wrong size on W_Field_Status_C_GetBossStatus");
static_assert(offsetof(W_Field_Status_C_GetBossStatus, ReturnValue) == 0x000000, "Member 'W_Field_Status_C_GetBossStatus::ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.GetSkillChainWindow
// 0x0008 (0x0008 - 0x0000)
struct W_Field_Status_C_GetSkillChainWindow final
{
public:
	class UUIField_WinSkillbox*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_GetSkillChainWindow) == 0x000008, "Wrong alignment on W_Field_Status_C_GetSkillChainWindow");
static_assert(sizeof(W_Field_Status_C_GetSkillChainWindow) == 0x000008, "Wrong size on W_Field_Status_C_GetSkillChainWindow");
static_assert(offsetof(W_Field_Status_C_GetSkillChainWindow, ReturnValue) == 0x000000, "Member 'W_Field_Status_C_GetSkillChainWindow::ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.GetPlayerStatus
// 0x0008 (0x0008 - 0x0000)
struct W_Field_Status_C_GetPlayerStatus final
{
public:
	class UUIField_WinPStatus*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_GetPlayerStatus) == 0x000008, "Wrong alignment on W_Field_Status_C_GetPlayerStatus");
static_assert(sizeof(W_Field_Status_C_GetPlayerStatus) == 0x000008, "Wrong size on W_Field_Status_C_GetPlayerStatus");
static_assert(offsetof(W_Field_Status_C_GetPlayerStatus, ReturnValue) == 0x000000, "Member 'W_Field_Status_C_GetPlayerStatus::ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.GetQuestWindow
// 0x0008 (0x0008 - 0x0000)
struct W_Field_Status_C_GetQuestWindow final
{
public:
	class UUIField_WinQuest*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_GetQuestWindow) == 0x000008, "Wrong alignment on W_Field_Status_C_GetQuestWindow");
static_assert(sizeof(W_Field_Status_C_GetQuestWindow) == 0x000008, "Wrong size on W_Field_Status_C_GetQuestWindow");
static_assert(offsetof(W_Field_Status_C_GetQuestWindow, ReturnValue) == 0x000000, "Member 'W_Field_Status_C_GetQuestWindow::ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.GetLogWindow
// 0x0008 (0x0008 - 0x0000)
struct W_Field_Status_C_GetLogWindow final
{
public:
	class UUIField_WinLogbox*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_GetLogWindow) == 0x000008, "Wrong alignment on W_Field_Status_C_GetLogWindow");
static_assert(sizeof(W_Field_Status_C_GetLogWindow) == 0x000008, "Wrong size on W_Field_Status_C_GetLogWindow");
static_assert(offsetof(W_Field_Status_C_GetLogWindow, ReturnValue) == 0x000000, "Member 'W_Field_Status_C_GetLogWindow::ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.GetUnusedFriendStatus
// 0x0040 (0x0040 - 0x0000)
struct W_Field_Status_C_GetUnusedFriendStatus final
{
public:
	class UUIField_WinFStatus*                    OutWidget;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ResultIndex;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIField_WinFStatus*                    Out;                                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUse_ReturnValue;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIField_WinFStatus*                    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_Field_Status_C_GetUnusedFriendStatus) == 0x000008, "Wrong alignment on W_Field_Status_C_GetUnusedFriendStatus");
static_assert(sizeof(W_Field_Status_C_GetUnusedFriendStatus) == 0x000040, "Wrong size on W_Field_Status_C_GetUnusedFriendStatus");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, OutWidget) == 0x000000, "Member 'W_Field_Status_C_GetUnusedFriendStatus::OutWidget' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, ResultIndex) == 0x000008, "Member 'W_Field_Status_C_GetUnusedFriendStatus::ResultIndex' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, Index_0) == 0x00000C, "Member 'W_Field_Status_C_GetUnusedFriendStatus::Index_0' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, Out) == 0x000010, "Member 'W_Field_Status_C_GetUnusedFriendStatus::Out' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'W_Field_Status_C_GetUnusedFriendStatus::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'W_Field_Status_C_GetUnusedFriendStatus::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'W_Field_Status_C_GetUnusedFriendStatus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'W_Field_Status_C_GetUnusedFriendStatus::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, CallFunc_IsUse_ReturnValue) == 0x000028, "Member 'W_Field_Status_C_GetUnusedFriendStatus::CallFunc_IsUse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'W_Field_Status_C_GetUnusedFriendStatus::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, CallFunc_Array_Get_Item) == 0x000030, "Member 'W_Field_Status_C_GetUnusedFriendStatus::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'W_Field_Status_C_GetUnusedFriendStatus::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'W_Field_Status_C_GetUnusedFriendStatus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetUnusedFriendStatus, CallFunc_BooleanAND_ReturnValue) == 0x00003D, "Member 'W_Field_Status_C_GetUnusedFriendStatus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.GetFriendStatus
// 0x0020 (0x0020 - 0x0000)
struct W_Field_Status_C_GetFriendStatus final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIField_WinFStatus*                    ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIField_WinFStatus*                    CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_GetFriendStatus) == 0x000008, "Wrong alignment on W_Field_Status_C_GetFriendStatus");
static_assert(sizeof(W_Field_Status_C_GetFriendStatus) == 0x000020, "Wrong size on W_Field_Status_C_GetFriendStatus");
static_assert(offsetof(W_Field_Status_C_GetFriendStatus, Index_0) == 0x000000, "Member 'W_Field_Status_C_GetFriendStatus::Index_0' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetFriendStatus, ReturnValue) == 0x000008, "Member 'W_Field_Status_C_GetFriendStatus::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetFriendStatus, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000010, "Member 'W_Field_Status_C_GetFriendStatus::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_GetFriendStatus, CallFunc_Array_Get_Item) == 0x000018, "Member 'W_Field_Status_C_GetFriendStatus::CallFunc_Array_Get_Item' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.InputEventFunc
// 0x01D8 (0x01D8 - 0x0000)
struct W_Field_Status_C_InputEventFunc final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GamePaused;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyInput                              KeyInput;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FKeyInput                              OutKeyInput;                                       // 0x0018(0x0010)(Parm, OutParm)
	struct FEventReply                            Reply;                                             // 0x0028(0x00B8)(Parm, OutParm)
	bool                                          IsInput;                                           // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKeyInput                              CallFunc_InputEventFunc_OutKeyInput;               // 0x00E8(0x0010)()
	struct FEventReply                            CallFunc_InputEventFunc_Reply;                     // 0x00F8(0x00B8)()
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRepeatPressed_ReturnValue;              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_Field_Status_C_InputEventFunc) == 0x000008, "Wrong alignment on W_Field_Status_C_InputEventFunc");
static_assert(sizeof(W_Field_Status_C_InputEventFunc) == 0x0001D8, "Wrong size on W_Field_Status_C_InputEventFunc");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, DeltaTime) == 0x000000, "Member 'W_Field_Status_C_InputEventFunc::DeltaTime' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, GamePaused) == 0x000004, "Member 'W_Field_Status_C_InputEventFunc::GamePaused' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, KeyInput) == 0x000008, "Member 'W_Field_Status_C_InputEventFunc::KeyInput' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, OutKeyInput) == 0x000018, "Member 'W_Field_Status_C_InputEventFunc::OutKeyInput' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, Reply) == 0x000028, "Member 'W_Field_Status_C_InputEventFunc::Reply' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, IsInput) == 0x0000E0, "Member 'W_Field_Status_C_InputEventFunc::IsInput' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, Temp_int_Variable) == 0x0000E4, "Member 'W_Field_Status_C_InputEventFunc::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, CallFunc_InputEventFunc_OutKeyInput) == 0x0000E8, "Member 'W_Field_Status_C_InputEventFunc::CallFunc_InputEventFunc_OutKeyInput' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, CallFunc_InputEventFunc_Reply) == 0x0000F8, "Member 'W_Field_Status_C_InputEventFunc::CallFunc_InputEventFunc_Reply' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, CallFunc_Conv_IntToByte_ReturnValue) == 0x0001B0, "Member 'W_Field_Status_C_InputEventFunc::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, CallFunc_GetValidValue_ReturnValue) == 0x0001B1, "Member 'W_Field_Status_C_InputEventFunc::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, Temp_int_Variable_1) == 0x0001B4, "Member 'W_Field_Status_C_InputEventFunc::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, CallFunc_IsRepeatPressed_ReturnValue) == 0x0001B8, "Member 'W_Field_Status_C_InputEventFunc::CallFunc_IsRepeatPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, CallFunc_Add_IntInt_ReturnValue) == 0x0001BC, "Member 'W_Field_Status_C_InputEventFunc::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x0001C0, "Member 'W_Field_Status_C_InputEventFunc::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x0001C1, "Member 'W_Field_Status_C_InputEventFunc::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0001C4, "Member 'W_Field_Status_C_InputEventFunc::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, K2Node_SwitchEnum_CmpSuccess) == 0x0001C8, "Member 'W_Field_Status_C_InputEventFunc::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, CallFunc_BooleanOR_ReturnValue) == 0x0001C9, "Member 'W_Field_Status_C_InputEventFunc::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, CallFunc_MakeLiteralInt_ReturnValue) == 0x0001CC, "Member 'W_Field_Status_C_InputEventFunc::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_Status_C_InputEventFunc, CallFunc_Less_IntInt_ReturnValue) == 0x0001D0, "Member 'W_Field_Status_C_InputEventFunc::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function W_Field_Status.W_Field_Status_C.ExecuteUbergraph_W_Field_Status
// 0x0004 (0x0004 - 0x0000)
struct W_Field_Status_C_ExecuteUbergraph_W_Field_Status final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_Status_C_ExecuteUbergraph_W_Field_Status) == 0x000004, "Wrong alignment on W_Field_Status_C_ExecuteUbergraph_W_Field_Status");
static_assert(sizeof(W_Field_Status_C_ExecuteUbergraph_W_Field_Status) == 0x000004, "Wrong size on W_Field_Status_C_ExecuteUbergraph_W_Field_Status");
static_assert(offsetof(W_Field_Status_C_ExecuteUbergraph_W_Field_Status, EntryPoint) == 0x000000, "Member 'W_Field_Status_C_ExecuteUbergraph_W_Field_Status::EntryPoint' has a wrong offset!");

}

