#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_IconlockOn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function W_Field_IconlockOn.W_Field_IconlockOn_C.Update
// 0x0004 (0x0004 - 0x0000)
struct W_Field_IconlockOn_C_Update final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_IconlockOn_C_Update) == 0x000004, "Wrong alignment on W_Field_IconlockOn_C_Update");
static_assert(sizeof(W_Field_IconlockOn_C_Update) == 0x000004, "Wrong size on W_Field_IconlockOn_C_Update");
static_assert(offsetof(W_Field_IconlockOn_C_Update, DeltaTime) == 0x000000, "Member 'W_Field_IconlockOn_C_Update::DeltaTime' has a wrong offset!");

// Function W_Field_IconlockOn.W_Field_IconlockOn_C.SetTarget
// 0x0008 (0x0008 - 0x0000)
struct W_Field_IconlockOn_C_SetTarget final
{
public:
	class USceneComponent*                        SceneComponent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_IconlockOn_C_SetTarget) == 0x000008, "Wrong alignment on W_Field_IconlockOn_C_SetTarget");
static_assert(sizeof(W_Field_IconlockOn_C_SetTarget) == 0x000008, "Wrong size on W_Field_IconlockOn_C_SetTarget");
static_assert(offsetof(W_Field_IconlockOn_C_SetTarget, SceneComponent) == 0x000000, "Member 'W_Field_IconlockOn_C_SetTarget::SceneComponent' has a wrong offset!");

// Function W_Field_IconlockOn.W_Field_IconlockOn_C.ExecuteUbergraph_W_Field_IconlockOn
// 0x0090 (0x0090 - 0x0000)
struct W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        K2Node_Event_SceneComponent;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn) == 0x000008, "Wrong alignment on W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn");
static_assert(sizeof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn) == 0x000090, "Wrong size on W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, EntryPoint) == 0x000000, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000008, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_BreakVector_X) == 0x000014, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_BreakVector_Y) == 0x000018, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_BreakVector_Z) == 0x00001C, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_MakeVector_ReturnValue) == 0x000030, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_GetPosition_ReturnValue) == 0x00003C, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_BreakVector2D_X) == 0x000044, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_BreakVector2D_Y) == 0x000048, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, K2Node_Event_DeltaTime) == 0x00004C, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000050, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_MakeVector2D_ReturnValue) == 0x000054, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_IsValid_ReturnValue_1) == 0x00005C, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000060, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_BreakVector_X_1) == 0x00006C, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_BreakVector_Y_1) == 0x000070, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_BreakVector_Z_1) == 0x000074, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000078, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, CallFunc_MakeVector_ReturnValue_1) == 0x00007C, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn, K2Node_Event_SceneComponent) == 0x000088, "Member 'W_Field_IconlockOn_C_ExecuteUbergraph_W_Field_IconlockOn::K2Node_Event_SceneComponent' has a wrong offset!");

}

