#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_Status

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_Status.W_Field_Status_C
// 0x00C0 (0x05D8 - 0x0518)
class UW_Field_Status_C final : public UUIField_Status
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0518(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Button_Wait;                                       // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Button_In;                                         // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Button_Out;                                        // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Button_2;                                          // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_Plus_1;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_23;                                // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Alert_00_C*                          W_Alert_00;                                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Alert_01_C*                          W_Alert_01;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ArtifactList_Field_C*                W_ArtifactList_Field;                              // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_WinBoss_C*                     W_Boss_Status;                                     // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Caution_C*                           W_Caution;                                         // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_WinLogbox_C*                   W_Field_LogWindow;                                 // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_Mouse_01_C*                    W_Field_Mouse;                                     // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_QuestConfirmation_C*           W_Field_QuestConfirmation;                         // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Map_WinStatus_C*                     W_Field_WinNavi;                                   // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_WinQuest_C*                    W_Field_WinQuest;                                  // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_WinSkillbox_C*                 W_Field_WinSkillbox;                               // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_WinFStatus_C*                  W_Friend_Status_001;                               // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_WinFStatus_C*                  W_Friend_Status_002;                               // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_WinFStatus_C*                  W_Friend_Status_003;                               // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_WinPStatus_C*                  W_Player_Status;                                   // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Vision_Field_C*                      W_Vision_Field;                                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UUICaution* GetCaution();
	class UUIField_QuestConfirmation* GetQuestConfirmation();
	class UUIMap_WinStatus* GetMapStatus();
	class UUIArtifactList_Field* GetArtifactIconList();
	class UUIAlert_01* GetBottomCautionAlert();
	class UUIAlert_00* GetTopCautionAlert();
	class UUIVision_Field* GetMonsterVision();
	class UUIField_WinBoss* GetBossStatus();
	class UUIField_WinSkillbox* GetSkillChainWindow();
	class UUIField_WinPStatus* GetPlayerStatus();
	class UUIField_WinQuest* GetQuestWindow();
	class UUIField_WinLogbox* GetLogWindow();
	void GetUnusedFriendStatus(class UUIField_WinFStatus** OutWidget, int32* ResultIndex);
	class UUIField_WinFStatus* GetFriendStatus(int32 Index_0);
	void InputEventFunc(float DeltaTime, bool GamePaused, const struct FKeyInput& KeyInput, struct FKeyInput* OutKeyInput, struct FEventReply* Reply);
	void ExecuteUbergraph_W_Field_Status(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_Status_C">();
	}
	static class UW_Field_Status_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_Status_C>();
	}
};
static_assert(alignof(UW_Field_Status_C) == 0x000008, "Wrong alignment on UW_Field_Status_C");
static_assert(sizeof(UW_Field_Status_C) == 0x0005D8, "Wrong size on UW_Field_Status_C");
static_assert(offsetof(UW_Field_Status_C, UberGraphFrame) == 0x000518, "Member 'UW_Field_Status_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, Button_Wait) == 0x000520, "Member 'UW_Field_Status_C::Button_Wait' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, Button_In) == 0x000528, "Member 'UW_Field_Status_C::Button_In' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, Button_Out) == 0x000530, "Member 'UW_Field_Status_C::Button_Out' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, Button_2) == 0x000538, "Member 'UW_Field_Status_C::Button_2' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, Button_Plus_1) == 0x000540, "Member 'UW_Field_Status_C::Button_Plus_1' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, Image) == 0x000548, "Member 'UW_Field_Status_C::Image' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, InvalidationBox_23) == 0x000550, "Member 'UW_Field_Status_C::InvalidationBox_23' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Alert_00) == 0x000558, "Member 'UW_Field_Status_C::W_Alert_00' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Alert_01) == 0x000560, "Member 'UW_Field_Status_C::W_Alert_01' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_ArtifactList_Field) == 0x000568, "Member 'UW_Field_Status_C::W_ArtifactList_Field' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Boss_Status) == 0x000570, "Member 'UW_Field_Status_C::W_Boss_Status' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Caution) == 0x000578, "Member 'UW_Field_Status_C::W_Caution' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Field_LogWindow) == 0x000580, "Member 'UW_Field_Status_C::W_Field_LogWindow' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Field_Mouse) == 0x000588, "Member 'UW_Field_Status_C::W_Field_Mouse' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Field_QuestConfirmation) == 0x000590, "Member 'UW_Field_Status_C::W_Field_QuestConfirmation' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Field_WinNavi) == 0x000598, "Member 'UW_Field_Status_C::W_Field_WinNavi' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Field_WinQuest) == 0x0005A0, "Member 'UW_Field_Status_C::W_Field_WinQuest' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Field_WinSkillbox) == 0x0005A8, "Member 'UW_Field_Status_C::W_Field_WinSkillbox' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Friend_Status_001) == 0x0005B0, "Member 'UW_Field_Status_C::W_Friend_Status_001' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Friend_Status_002) == 0x0005B8, "Member 'UW_Field_Status_C::W_Friend_Status_002' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Friend_Status_003) == 0x0005C0, "Member 'UW_Field_Status_C::W_Friend_Status_003' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Player_Status) == 0x0005C8, "Member 'UW_Field_Status_C::W_Player_Status' has a wrong offset!");
static_assert(offsetof(UW_Field_Status_C, W_Vision_Field) == 0x0005D0, "Member 'UW_Field_Status_C::W_Vision_Field' has a wrong offset!");

}

