#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_IconStamp_41

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_IconStamp_41.W_Field_IconStamp_41_C
// 0x0030 (0x0640 - 0x0610)
class UW_Field_IconStamp_41_C final : public UUIField_StampIconBase
{
public:
	class UWidgetAnimation*                       In;                                                // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       off;                                               // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon01;                                            // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon02;                                            // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon03;                                            // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_IconStamp_41_C">();
	}
	static class UW_Field_IconStamp_41_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_IconStamp_41_C>();
	}
};
static_assert(alignof(UW_Field_IconStamp_41_C) == 0x000010, "Wrong alignment on UW_Field_IconStamp_41_C");
static_assert(sizeof(UW_Field_IconStamp_41_C) == 0x000640, "Wrong size on UW_Field_IconStamp_41_C");
static_assert(offsetof(UW_Field_IconStamp_41_C, In) == 0x000610, "Member 'UW_Field_IconStamp_41_C::In' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_41_C, off) == 0x000618, "Member 'UW_Field_IconStamp_41_C::off' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_41_C, Wait) == 0x000620, "Member 'UW_Field_IconStamp_41_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_41_C, Icon01) == 0x000628, "Member 'UW_Field_IconStamp_41_C::Icon01' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_41_C, Icon02) == 0x000630, "Member 'UW_Field_IconStamp_41_C::Icon02' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_41_C, Icon03) == 0x000638, "Member 'UW_Field_IconStamp_41_C::Icon03' has a wrong offset!");

}

