#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FieldAction_Caution_04

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FieldAction_Caution_04.W_FieldAction_Caution_04_C
// 0x0018 (0x04C0 - 0x04A8)
class UW_FieldAction_Caution_04_C final : public UUIFieldAction_Caution_04
{
public:
	class UImage*                                 CautionBase;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CautionIcon;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tail;                                              // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_FieldAction_Caution_04_C">();
	}
	static class UW_FieldAction_Caution_04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_FieldAction_Caution_04_C>();
	}
};
static_assert(alignof(UW_FieldAction_Caution_04_C) == 0x000008, "Wrong alignment on UW_FieldAction_Caution_04_C");
static_assert(sizeof(UW_FieldAction_Caution_04_C) == 0x0004C0, "Wrong size on UW_FieldAction_Caution_04_C");
static_assert(offsetof(UW_FieldAction_Caution_04_C, CautionBase) == 0x0004A8, "Member 'UW_FieldAction_Caution_04_C::CautionBase' has a wrong offset!");
static_assert(offsetof(UW_FieldAction_Caution_04_C, CautionIcon) == 0x0004B0, "Member 'UW_FieldAction_Caution_04_C::CautionIcon' has a wrong offset!");
static_assert(offsetof(UW_FieldAction_Caution_04_C, Tail) == 0x0004B8, "Member 'UW_FieldAction_Caution_04_C::Tail' has a wrong offset!");

}

