#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_IconStamp_22

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_IconStamp_22.W_Field_IconStamp_22_C
// 0x0060 (0x0670 - 0x0610)
class UW_Field_IconStamp_22_C final : public UUIField_StampIconBase
{
public:
	class UWidgetAnimation*                       off;                                               // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Ase_L;                                             // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ase_R;                                             // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_A;                                           // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_B;                                           // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_C;                                           // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_D;                                           // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_IconStamp_22_C">();
	}
	static class UW_Field_IconStamp_22_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_IconStamp_22_C>();
	}
};
static_assert(alignof(UW_Field_IconStamp_22_C) == 0x000010, "Wrong alignment on UW_Field_IconStamp_22_C");
static_assert(sizeof(UW_Field_IconStamp_22_C) == 0x000670, "Wrong size on UW_Field_IconStamp_22_C");
static_assert(offsetof(UW_Field_IconStamp_22_C, off) == 0x000610, "Member 'UW_Field_IconStamp_22_C::off' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_22_C, on) == 0x000618, "Member 'UW_Field_IconStamp_22_C::on' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_22_C, Ase_L) == 0x000620, "Member 'UW_Field_IconStamp_22_C::Ase_L' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_22_C, Ase_R) == 0x000628, "Member 'UW_Field_IconStamp_22_C::Ase_R' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_22_C, Image_0) == 0x000630, "Member 'UW_Field_IconStamp_22_C::Image_0' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_22_C, Image_1) == 0x000638, "Member 'UW_Field_IconStamp_22_C::Image_1' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_22_C, Image_2) == 0x000640, "Member 'UW_Field_IconStamp_22_C::Image_2' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_22_C, Image_3) == 0x000648, "Member 'UW_Field_IconStamp_22_C::Image_3' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_22_C, Image_A) == 0x000650, "Member 'UW_Field_IconStamp_22_C::Image_A' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_22_C, Image_B) == 0x000658, "Member 'UW_Field_IconStamp_22_C::Image_B' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_22_C, Image_C) == 0x000660, "Member 'UW_Field_IconStamp_22_C::Image_C' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_22_C, Image_D) == 0x000668, "Member 'UW_Field_IconStamp_22_C::Image_D' has a wrong offset!");

}

