#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_ActionIcon_DivePoint

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_ActionIcon_DivePoint.W_Field_ActionIcon_DivePoint_C
// 0x0030 (0x05E0 - 0x05B0)
class UW_Field_ActionIcon_DivePoint_C final : public UUIField_ActionIcon_DivePoint
{
public:
	class UWidgetAnimation*                       Wait;                                              // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       off;                                               // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ActionIcon_DivePoint;                              // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Base;                                              // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_ActionIcon_DivePoint_C">();
	}
	static class UW_Field_ActionIcon_DivePoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_ActionIcon_DivePoint_C>();
	}
};
static_assert(alignof(UW_Field_ActionIcon_DivePoint_C) == 0x000010, "Wrong alignment on UW_Field_ActionIcon_DivePoint_C");
static_assert(sizeof(UW_Field_ActionIcon_DivePoint_C) == 0x0005E0, "Wrong size on UW_Field_ActionIcon_DivePoint_C");
static_assert(offsetof(UW_Field_ActionIcon_DivePoint_C, Wait) == 0x0005B0, "Member 'UW_Field_ActionIcon_DivePoint_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_Field_ActionIcon_DivePoint_C, off) == 0x0005B8, "Member 'UW_Field_ActionIcon_DivePoint_C::off' has a wrong offset!");
static_assert(offsetof(UW_Field_ActionIcon_DivePoint_C, on) == 0x0005C0, "Member 'UW_Field_ActionIcon_DivePoint_C::on' has a wrong offset!");
static_assert(offsetof(UW_Field_ActionIcon_DivePoint_C, ActionIcon_DivePoint) == 0x0005C8, "Member 'UW_Field_ActionIcon_DivePoint_C::ActionIcon_DivePoint' has a wrong offset!");
static_assert(offsetof(UW_Field_ActionIcon_DivePoint_C, Base) == 0x0005D0, "Member 'UW_Field_ActionIcon_DivePoint_C::Base' has a wrong offset!");

}

