#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_IconStamp

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_IconStamp.W_Field_IconStamp_C
// 0x0040 (0x0660 - 0x0620)
class UW_Field_IconStamp_C final : public UUIField_IconStamp
{
public:
	class UWidgetAnimation*                       Pop_Leave;                                         // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pop_Thousand_Strong;                               // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pop_Thousand;                                      // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pop_Million;                                       // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out_Artifact_Drop;                                 // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pop_R;                                             // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pop_L;                                             // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_IconStamp_C">();
	}
	static class UW_Field_IconStamp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_IconStamp_C>();
	}
};
static_assert(alignof(UW_Field_IconStamp_C) == 0x000010, "Wrong alignment on UW_Field_IconStamp_C");
static_assert(sizeof(UW_Field_IconStamp_C) == 0x000660, "Wrong size on UW_Field_IconStamp_C");
static_assert(offsetof(UW_Field_IconStamp_C, Pop_Leave) == 0x000620, "Member 'UW_Field_IconStamp_C::Pop_Leave' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_C, Pop_Thousand_Strong) == 0x000628, "Member 'UW_Field_IconStamp_C::Pop_Thousand_Strong' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_C, Pop_Thousand) == 0x000630, "Member 'UW_Field_IconStamp_C::Pop_Thousand' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_C, Pop_Million) == 0x000638, "Member 'UW_Field_IconStamp_C::Pop_Million' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_C, Out_Artifact_Drop) == 0x000640, "Member 'UW_Field_IconStamp_C::Out_Artifact_Drop' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_C, Pop_R) == 0x000648, "Member 'UW_Field_IconStamp_C::Pop_R' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_C, Out) == 0x000650, "Member 'UW_Field_IconStamp_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_C, Pop_L) == 0x000658, "Member 'UW_Field_IconStamp_C::Pop_L' has a wrong offset!");

}

