#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_IconStamp_36

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_IconStamp_36.W_Field_IconStamp_36_C
// 0x0060 (0x0670 - 0x0610)
class UW_Field_IconStamp_36_C final : public UUIField_StampIconBase
{
public:
	class UWidgetAnimation*                       leave;                                             // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_Strong;                                         // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       off;                                               // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait_Strong;                                       // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon01;                                            // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon02;                                            // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon03;                                            // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon03Add;                                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon04;                                            // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon04Add;                                         // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_IconStamp_36_C">();
	}
	static class UW_Field_IconStamp_36_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_IconStamp_36_C>();
	}
};
static_assert(alignof(UW_Field_IconStamp_36_C) == 0x000010, "Wrong alignment on UW_Field_IconStamp_36_C");
static_assert(sizeof(UW_Field_IconStamp_36_C) == 0x000670, "Wrong size on UW_Field_IconStamp_36_C");
static_assert(offsetof(UW_Field_IconStamp_36_C, leave) == 0x000610, "Member 'UW_Field_IconStamp_36_C::leave' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_36_C, In_Strong) == 0x000618, "Member 'UW_Field_IconStamp_36_C::In_Strong' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_36_C, In) == 0x000620, "Member 'UW_Field_IconStamp_36_C::In' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_36_C, off) == 0x000628, "Member 'UW_Field_IconStamp_36_C::off' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_36_C, Wait_Strong) == 0x000630, "Member 'UW_Field_IconStamp_36_C::Wait_Strong' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_36_C, Wait) == 0x000638, "Member 'UW_Field_IconStamp_36_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_36_C, Icon01) == 0x000640, "Member 'UW_Field_IconStamp_36_C::Icon01' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_36_C, Icon02) == 0x000648, "Member 'UW_Field_IconStamp_36_C::Icon02' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_36_C, Icon03) == 0x000650, "Member 'UW_Field_IconStamp_36_C::Icon03' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_36_C, Icon03Add) == 0x000658, "Member 'UW_Field_IconStamp_36_C::Icon03Add' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_36_C, Icon04) == 0x000660, "Member 'UW_Field_IconStamp_36_C::Icon04' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_36_C, Icon04Add) == 0x000668, "Member 'UW_Field_IconStamp_36_C::Icon04Add' has a wrong offset!");

}

