#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_IconStamp_Composite

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_IconStamp_Composite.W_Field_IconStamp_Composite_C
// 0x0050 (0x0620 - 0x05D0)
class UW_Field_IconStamp_Composite_C final : public UUIField_IconStamp_CompositeBase
{
public:
	class UWidgetAnimation*                       leave;                                             // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Thousand_Strong;                                   // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       thousand;                                          // 0x05E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       million;                                           // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x05F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 StampBase01_R;                                     // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StampBase01_R_1;                                   // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StampBase01_R_2;                                   // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StampBase01_R_3;                                   // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_IconStamp_Composite_C">();
	}
	static class UW_Field_IconStamp_Composite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_IconStamp_Composite_C>();
	}
};
static_assert(alignof(UW_Field_IconStamp_Composite_C) == 0x000010, "Wrong alignment on UW_Field_IconStamp_Composite_C");
static_assert(sizeof(UW_Field_IconStamp_Composite_C) == 0x000620, "Wrong size on UW_Field_IconStamp_Composite_C");
static_assert(offsetof(UW_Field_IconStamp_Composite_C, leave) == 0x0005D0, "Member 'UW_Field_IconStamp_Composite_C::leave' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_Composite_C, Thousand_Strong) == 0x0005D8, "Member 'UW_Field_IconStamp_Composite_C::Thousand_Strong' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_Composite_C, Normal) == 0x0005E0, "Member 'UW_Field_IconStamp_Composite_C::Normal' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_Composite_C, thousand) == 0x0005E8, "Member 'UW_Field_IconStamp_Composite_C::thousand' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_Composite_C, million) == 0x0005F0, "Member 'UW_Field_IconStamp_Composite_C::million' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_Composite_C, Wait) == 0x0005F8, "Member 'UW_Field_IconStamp_Composite_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_Composite_C, StampBase01_R) == 0x000600, "Member 'UW_Field_IconStamp_Composite_C::StampBase01_R' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_Composite_C, StampBase01_R_1) == 0x000608, "Member 'UW_Field_IconStamp_Composite_C::StampBase01_R_1' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_Composite_C, StampBase01_R_2) == 0x000610, "Member 'UW_Field_IconStamp_Composite_C::StampBase01_R_2' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_Composite_C, StampBase01_R_3) == 0x000618, "Member 'UW_Field_IconStamp_Composite_C::StampBase01_R_3' has a wrong offset!");

}

