#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_IconStamp_24

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_IconStamp_24.W_Field_IconStamp_24_C
// 0x0030 (0x0640 - 0x0610)
class UW_Field_IconStamp_24_C final : public UUIField_StampIconBase
{
public:
	class UWidgetAnimation*                       off;                                               // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_IconStamp_24_C">();
	}
	static class UW_Field_IconStamp_24_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_IconStamp_24_C>();
	}
};
static_assert(alignof(UW_Field_IconStamp_24_C) == 0x000010, "Wrong alignment on UW_Field_IconStamp_24_C");
static_assert(sizeof(UW_Field_IconStamp_24_C) == 0x000640, "Wrong size on UW_Field_IconStamp_24_C");
static_assert(offsetof(UW_Field_IconStamp_24_C, off) == 0x000610, "Member 'UW_Field_IconStamp_24_C::off' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_24_C, on) == 0x000618, "Member 'UW_Field_IconStamp_24_C::on' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_24_C, Image_0) == 0x000620, "Member 'UW_Field_IconStamp_24_C::Image_0' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_24_C, Image_1) == 0x000628, "Member 'UW_Field_IconStamp_24_C::Image_1' has a wrong offset!");
static_assert(offsetof(UW_Field_IconStamp_24_C, Image_2) == 0x000630, "Member 'UW_Field_IconStamp_24_C::Image_2' has a wrong offset!");

}

