#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_WinLink_Eff

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_WinLink_Eff.W_Field_WinLink_Eff_C
// 0x0028 (0x04B8 - 0x0490)
class UW_Field_WinLink_Eff_C final : public UUIField_WinLinkEff
{
public:
	class UWidgetAnimation*                       Disabled;                                          // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Charge;                                            // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Charge_Eff;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flash;                                             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_WinLink_Eff_C">();
	}
	static class UW_Field_WinLink_Eff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_WinLink_Eff_C>();
	}
};
static_assert(alignof(UW_Field_WinLink_Eff_C) == 0x000008, "Wrong alignment on UW_Field_WinLink_Eff_C");
static_assert(sizeof(UW_Field_WinLink_Eff_C) == 0x0004B8, "Wrong size on UW_Field_WinLink_Eff_C");
static_assert(offsetof(UW_Field_WinLink_Eff_C, Disabled) == 0x000490, "Member 'UW_Field_WinLink_Eff_C::Disabled' has a wrong offset!");
static_assert(offsetof(UW_Field_WinLink_Eff_C, Normal) == 0x000498, "Member 'UW_Field_WinLink_Eff_C::Normal' has a wrong offset!");
static_assert(offsetof(UW_Field_WinLink_Eff_C, Charge) == 0x0004A0, "Member 'UW_Field_WinLink_Eff_C::Charge' has a wrong offset!");
static_assert(offsetof(UW_Field_WinLink_Eff_C, Charge_Eff) == 0x0004A8, "Member 'UW_Field_WinLink_Eff_C::Charge_Eff' has a wrong offset!");
static_assert(offsetof(UW_Field_WinLink_Eff_C, Flash) == 0x0004B0, "Member 'UW_Field_WinLink_Eff_C::Flash' has a wrong offset!");

}

