#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_Win_Tutorial

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_Win_Tutorial.W_Field_Win_Tutorial_C
// 0x0098 (0x0590 - 0x04F8)
class UW_Field_Win_Tutorial_C final : public UUIField_WinTutorial
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Button_A;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_Base;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_31;                                          // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         ItemName;                                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MultiBase_1;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MultiBase_NextIcon_C*                NextIcon_L;                                        // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MultiBase_NextIcon_C*                NextIcon_R;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_Pointreader_C*                 Point_0001;                                        // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_Pointreader_C*                 Point_0002;                                        // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_Pointreader_C*                 Point_0003;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_Pointreader_C*                 Point_0004;                                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_Pointreader_C*                 Point_0005;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_Pointreader_C*                 Point_0006;                                        // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         TextBlock_14;                                      // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tips_Image;                                        // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BG_Black_C*                          W_BG_Black;                                        // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TextWidget_C*                        W_TextWidget;                                      // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_Win_Tutorial_C">();
	}
	static class UW_Field_Win_Tutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_Win_Tutorial_C>();
	}
};
static_assert(alignof(UW_Field_Win_Tutorial_C) == 0x000008, "Wrong alignment on UW_Field_Win_Tutorial_C");
static_assert(sizeof(UW_Field_Win_Tutorial_C) == 0x000590, "Wrong size on UW_Field_Win_Tutorial_C");
static_assert(offsetof(UW_Field_Win_Tutorial_C, Out) == 0x0004F8, "Member 'UW_Field_Win_Tutorial_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, In) == 0x000500, "Member 'UW_Field_Win_Tutorial_C::In' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, Button_A) == 0x000508, "Member 'UW_Field_Win_Tutorial_C::Button_A' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, Button_Base) == 0x000510, "Member 'UW_Field_Win_Tutorial_C::Button_Base' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, Image_31) == 0x000518, "Member 'UW_Field_Win_Tutorial_C::Image_31' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, ItemName) == 0x000520, "Member 'UW_Field_Win_Tutorial_C::ItemName' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, MultiBase_1) == 0x000528, "Member 'UW_Field_Win_Tutorial_C::MultiBase_1' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, NextIcon_L) == 0x000530, "Member 'UW_Field_Win_Tutorial_C::NextIcon_L' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, NextIcon_R) == 0x000538, "Member 'UW_Field_Win_Tutorial_C::NextIcon_R' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, Point_0001) == 0x000540, "Member 'UW_Field_Win_Tutorial_C::Point_0001' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, Point_0002) == 0x000548, "Member 'UW_Field_Win_Tutorial_C::Point_0002' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, Point_0003) == 0x000550, "Member 'UW_Field_Win_Tutorial_C::Point_0003' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, Point_0004) == 0x000558, "Member 'UW_Field_Win_Tutorial_C::Point_0004' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, Point_0005) == 0x000560, "Member 'UW_Field_Win_Tutorial_C::Point_0005' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, Point_0006) == 0x000568, "Member 'UW_Field_Win_Tutorial_C::Point_0006' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, TextBlock_14) == 0x000570, "Member 'UW_Field_Win_Tutorial_C::TextBlock_14' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, Tips_Image) == 0x000578, "Member 'UW_Field_Win_Tutorial_C::Tips_Image' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, W_BG_Black) == 0x000580, "Member 'UW_Field_Win_Tutorial_C::W_BG_Black' has a wrong offset!");
static_assert(offsetof(UW_Field_Win_Tutorial_C, W_TextWidget) == 0x000588, "Member 'UW_Field_Win_Tutorial_C::W_TextWidget' has a wrong offset!");

}

