#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_IconlockOn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_IconlockOn.W_Field_IconlockOn_C
// 0x0080 (0x0630 - 0x05B0)
class UW_Field_IconlockOn_C final : public UUIField_IconLockon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Rush_Wait;                                         // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal_Wait;                                       // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Rush_Lock_Off;                                     // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Rush_Lock_On;                                      // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lock_Off;                                          // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Lock_On;                                           // 0x05E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Nomal;                                             // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 nomal_Rock;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 nomal_Rock_Eff;                                    // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rush;                                              // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rush_Rock;                                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rush_Rock_Eff;                                     // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USceneComponent*                        TargetComponent;                                   // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Update(float DeltaTime);
	void EndUse();
	void Close();
	void SetTarget(class USceneComponent* SceneComponent);
	void OnInitialized();
	void ExecuteUbergraph_W_Field_IconlockOn(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_IconlockOn_C">();
	}
	static class UW_Field_IconlockOn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_IconlockOn_C>();
	}
};
static_assert(alignof(UW_Field_IconlockOn_C) == 0x000010, "Wrong alignment on UW_Field_IconlockOn_C");
static_assert(sizeof(UW_Field_IconlockOn_C) == 0x000630, "Wrong size on UW_Field_IconlockOn_C");
static_assert(offsetof(UW_Field_IconlockOn_C, UberGraphFrame) == 0x0005B0, "Member 'UW_Field_IconlockOn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, Rush_Wait) == 0x0005B8, "Member 'UW_Field_IconlockOn_C::Rush_Wait' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, Normal_Wait) == 0x0005C0, "Member 'UW_Field_IconlockOn_C::Normal_Wait' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, Rush_Lock_Off) == 0x0005C8, "Member 'UW_Field_IconlockOn_C::Rush_Lock_Off' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, Rush_Lock_On) == 0x0005D0, "Member 'UW_Field_IconlockOn_C::Rush_Lock_On' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, Wait) == 0x0005D8, "Member 'UW_Field_IconlockOn_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, Lock_Off) == 0x0005E0, "Member 'UW_Field_IconlockOn_C::Lock_Off' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, Lock_On) == 0x0005E8, "Member 'UW_Field_IconlockOn_C::Lock_On' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, CanvasPanel_1) == 0x0005F0, "Member 'UW_Field_IconlockOn_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, Nomal) == 0x0005F8, "Member 'UW_Field_IconlockOn_C::Nomal' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, nomal_Rock) == 0x000600, "Member 'UW_Field_IconlockOn_C::nomal_Rock' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, nomal_Rock_Eff) == 0x000608, "Member 'UW_Field_IconlockOn_C::nomal_Rock_Eff' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, Rush) == 0x000610, "Member 'UW_Field_IconlockOn_C::Rush' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, Rush_Rock) == 0x000618, "Member 'UW_Field_IconlockOn_C::Rush_Rock' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, Rush_Rock_Eff) == 0x000620, "Member 'UW_Field_IconlockOn_C::Rush_Rock_Eff' has a wrong offset!");
static_assert(offsetof(UW_Field_IconlockOn_C, TargetComponent) == 0x000628, "Member 'UW_Field_IconlockOn_C::TargetComponent' has a wrong offset!");

}

