#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Field_SearchPoint

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Field_SearchPoint.W_Field_SearchPoint_C
// 0x0050 (0x0600 - 0x05B0)
class UW_Field_SearchPoint_C final : public UUIField_SearchPoint
{
public:
	class UWidgetAnimation*                       PointerActive;                                     // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PointerNormal;                                     // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       off;                                               // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Active;                                            // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Nomal;                                             // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           PoinsetSet;                                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USceneComponent*                        TargetComponent;                                   // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NowAnim;                                           // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void WaitAnim();
	void PlayAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Field_SearchPoint_C">();
	}
	static class UW_Field_SearchPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Field_SearchPoint_C>();
	}
};
static_assert(alignof(UW_Field_SearchPoint_C) == 0x000010, "Wrong alignment on UW_Field_SearchPoint_C");
static_assert(sizeof(UW_Field_SearchPoint_C) == 0x000600, "Wrong size on UW_Field_SearchPoint_C");
static_assert(offsetof(UW_Field_SearchPoint_C, PointerActive) == 0x0005B0, "Member 'UW_Field_SearchPoint_C::PointerActive' has a wrong offset!");
static_assert(offsetof(UW_Field_SearchPoint_C, PointerNormal) == 0x0005B8, "Member 'UW_Field_SearchPoint_C::PointerNormal' has a wrong offset!");
static_assert(offsetof(UW_Field_SearchPoint_C, Wait) == 0x0005C0, "Member 'UW_Field_SearchPoint_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_Field_SearchPoint_C, off) == 0x0005C8, "Member 'UW_Field_SearchPoint_C::off' has a wrong offset!");
static_assert(offsetof(UW_Field_SearchPoint_C, on) == 0x0005D0, "Member 'UW_Field_SearchPoint_C::on' has a wrong offset!");
static_assert(offsetof(UW_Field_SearchPoint_C, Active) == 0x0005D8, "Member 'UW_Field_SearchPoint_C::Active' has a wrong offset!");
static_assert(offsetof(UW_Field_SearchPoint_C, Nomal) == 0x0005E0, "Member 'UW_Field_SearchPoint_C::Nomal' has a wrong offset!");
static_assert(offsetof(UW_Field_SearchPoint_C, PoinsetSet) == 0x0005E8, "Member 'UW_Field_SearchPoint_C::PoinsetSet' has a wrong offset!");
static_assert(offsetof(UW_Field_SearchPoint_C, TargetComponent) == 0x0005F0, "Member 'UW_Field_SearchPoint_C::TargetComponent' has a wrong offset!");
static_assert(offsetof(UW_Field_SearchPoint_C, NowAnim) == 0x0005F8, "Member 'UW_Field_SearchPoint_C::NowAnim' has a wrong offset!");

}

