#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FriendGauge_Field

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FriendGauge_Field.W_FriendGauge_Field_C
// 0x0018 (0x0508 - 0x04F0)
class UW_FriendGauge_Field_C final : public UUIGaugeBase
{
public:
	class UImage*                                 Image_215;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pc_HPMPGauge;                                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pc_HPMPGauge_Damage;                               // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_FriendGauge_Field_C">();
	}
	static class UW_FriendGauge_Field_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_FriendGauge_Field_C>();
	}
};
static_assert(alignof(UW_FriendGauge_Field_C) == 0x000008, "Wrong alignment on UW_FriendGauge_Field_C");
static_assert(sizeof(UW_FriendGauge_Field_C) == 0x000508, "Wrong size on UW_FriendGauge_Field_C");
static_assert(offsetof(UW_FriendGauge_Field_C, Image_215) == 0x0004F0, "Member 'UW_FriendGauge_Field_C::Image_215' has a wrong offset!");
static_assert(offsetof(UW_FriendGauge_Field_C, Pc_HPMPGauge) == 0x0004F8, "Member 'UW_FriendGauge_Field_C::Pc_HPMPGauge' has a wrong offset!");
static_assert(offsetof(UW_FriendGauge_Field_C, Pc_HPMPGauge_Damage) == 0x000500, "Member 'UW_FriendGauge_Field_C::Pc_HPMPGauge_Damage' has a wrong offset!");

}

