#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FriendGauge

#include "Basic.hpp"

#include "W_GaugeBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FriendGauge.W_FriendGauge_C
// 0x0018 (0x0508 - 0x04F0)
class UW_FriendGauge_C final : public UW_GaugeBase_C
{
public:
	class UWidgetAnimation*                       Gauge_Animation;                                   // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Friend_HPMPGauge;                                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Friend_HPMPGauge_Damage;                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_FriendGauge_C">();
	}
	static class UW_FriendGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_FriendGauge_C>();
	}
};
static_assert(alignof(UW_FriendGauge_C) == 0x000008, "Wrong alignment on UW_FriendGauge_C");
static_assert(sizeof(UW_FriendGauge_C) == 0x000508, "Wrong size on UW_FriendGauge_C");
static_assert(offsetof(UW_FriendGauge_C, Gauge_Animation) == 0x0004F0, "Member 'UW_FriendGauge_C::Gauge_Animation' has a wrong offset!");
static_assert(offsetof(UW_FriendGauge_C, Friend_HPMPGauge) == 0x0004F8, "Member 'UW_FriendGauge_C::Friend_HPMPGauge' has a wrong offset!");
static_assert(offsetof(UW_FriendGauge_C, Friend_HPMPGauge_Damage) == 0x000500, "Member 'UW_FriendGauge_C::Friend_HPMPGauge_Damage' has a wrong offset!");

}

