#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Hub_ArtifactPoint_03

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Hub_ArtifactPoint_03.W_Hub_ArtifactPoint_03_C
// 0x0140 (0x0650 - 0x0510)
class UW_Hub_ArtifactPoint_03_C final : public UUIHub_ArtifactPoint
{
public:
	class UWidgetAnimation*                       Base_Off;                                          // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Flash_Off;                                         // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Play;                                              // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base;                                              // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_10;                             // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_11;                             // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_12;                             // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_13;                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_01;                             // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_02;                             // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_03;                             // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_04;                             // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_05;                             // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_06;                             // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_07;                             // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_08;                             // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_09;                             // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Comma_C*              W_Hub_PointCount01_comma_01;                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Comma_C*              W_Hub_PointCount01_comma_02;                       // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Comma_C*              W_Hub_PointCount01_comma_03;                       // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Comma_C*              W_Hub_PointCount01_comma_04;                       // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_10;                       // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_11;                       // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_12;                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_13;                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_01;                       // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_02;                       // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_03;                       // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_04;                       // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_05;                       // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_06;                       // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_07;                       // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_08;                       // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_09;                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_FlashComma_C*         W_Hub_PointCount01_Flash_comma_01;                 // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_FlashComma_C*         W_Hub_PointCount01_Flash_comma_02;                 // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_FlashComma_C*         W_Hub_PointCount01_Flash_comma_03;                 // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_FlashComma_C*         W_Hub_PointCount01_Flash_comma_04;                 // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount_Flash_C*              W_Hub_PointCount01_Flash_G;                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_PointCount01_C*                  W_Hub_PointCount01_G;                              // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Hub_ArtifactPoint_03_C">();
	}
	static class UW_Hub_ArtifactPoint_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Hub_ArtifactPoint_03_C>();
	}
};
static_assert(alignof(UW_Hub_ArtifactPoint_03_C) == 0x000008, "Wrong alignment on UW_Hub_ArtifactPoint_03_C");
static_assert(sizeof(UW_Hub_ArtifactPoint_03_C) == 0x000650, "Wrong size on UW_Hub_ArtifactPoint_03_C");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, Base_Off) == 0x000510, "Member 'UW_Hub_ArtifactPoint_03_C::Base_Off' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, Flash_Off) == 0x000518, "Member 'UW_Hub_ArtifactPoint_03_C::Flash_Off' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, Play) == 0x000520, "Member 'UW_Hub_ArtifactPoint_03_C::Play' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, Base) == 0x000528, "Member 'UW_Hub_ArtifactPoint_03_C::Base' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_10) == 0x000530, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_10' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_11) == 0x000538, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_11' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_12) == 0x000540, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_12' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_13) == 0x000548, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_13' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_01) == 0x000550, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_01' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_02) == 0x000558, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_02' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_03) == 0x000560, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_03' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_04) == 0x000568, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_04' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_05) == 0x000570, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_05' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_06) == 0x000578, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_06' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_07) == 0x000580, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_07' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_08) == 0x000588, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_08' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_09) == 0x000590, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_09' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_comma_01) == 0x000598, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_comma_01' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_comma_02) == 0x0005A0, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_comma_02' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_comma_03) == 0x0005A8, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_comma_03' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_comma_04) == 0x0005B0, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_comma_04' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_10) == 0x0005B8, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_10' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_11) == 0x0005C0, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_11' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_12) == 0x0005C8, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_12' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_13) == 0x0005D0, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_13' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_01) == 0x0005D8, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_01' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_02) == 0x0005E0, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_02' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_03) == 0x0005E8, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_03' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_04) == 0x0005F0, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_04' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_05) == 0x0005F8, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_05' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_06) == 0x000600, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_06' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_07) == 0x000608, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_07' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_08) == 0x000610, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_08' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_09) == 0x000618, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_09' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_comma_01) == 0x000620, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_comma_01' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_comma_02) == 0x000628, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_comma_02' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_comma_03) == 0x000630, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_comma_03' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_comma_04) == 0x000638, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_comma_04' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_Flash_G) == 0x000640, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_Flash_G' has a wrong offset!");
static_assert(offsetof(UW_Hub_ArtifactPoint_03_C, W_Hub_PointCount01_G) == 0x000648, "Member 'UW_Hub_ArtifactPoint_03_C::W_Hub_PointCount01_G' has a wrong offset!");

}

