#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Hub_statusTitle

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Hub_statusTitle.W_Hub_StatusTitle_C
// 0x0018 (0x04B8 - 0x04A0)
class UW_Hub_StatusTitle_C final : public UUIHub_StatusTitle
{
public:
	class UWidgetAnimation*                       RankUp;                                            // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Status_TitlePlate00;                               // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Hub_StatusTitleRank_C*               W_Hub_StatusTitleRank;                             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Hub_StatusTitle_C">();
	}
	static class UW_Hub_StatusTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Hub_StatusTitle_C>();
	}
};
static_assert(alignof(UW_Hub_StatusTitle_C) == 0x000008, "Wrong alignment on UW_Hub_StatusTitle_C");
static_assert(sizeof(UW_Hub_StatusTitle_C) == 0x0004B8, "Wrong size on UW_Hub_StatusTitle_C");
static_assert(offsetof(UW_Hub_StatusTitle_C, RankUp) == 0x0004A0, "Member 'UW_Hub_StatusTitle_C::RankUp' has a wrong offset!");
static_assert(offsetof(UW_Hub_StatusTitle_C, Status_TitlePlate00) == 0x0004A8, "Member 'UW_Hub_StatusTitle_C::Status_TitlePlate00' has a wrong offset!");
static_assert(offsetof(UW_Hub_StatusTitle_C, W_Hub_StatusTitleRank) == 0x0004B0, "Member 'UW_Hub_StatusTitle_C::W_Hub_StatusTitleRank' has a wrong offset!");

}

