#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Itemmenu_SatisfactGauge

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Itemmenu_SatisfactGauge.W_Itemmenu_SatisfactGauge_C
// 0x0020 (0x04C0 - 0x04A0)
class UW_Itemmenu_SatisfactGauge_C final : public UUIItemmenu_SatisfactGauge
{
public:
	class UImage*                                 CookIcon_1;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CookIcon_2;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Itemmenu_SatisfactIcon_C*            W_Itemmenu_SatisfactIcon_L;                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Itemmenu_SatisfactIcon_C*            W_Itemmenu_SatisfactIcon_R;                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Itemmenu_SatisfactGauge_C">();
	}
	static class UW_Itemmenu_SatisfactGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Itemmenu_SatisfactGauge_C>();
	}
};
static_assert(alignof(UW_Itemmenu_SatisfactGauge_C) == 0x000008, "Wrong alignment on UW_Itemmenu_SatisfactGauge_C");
static_assert(sizeof(UW_Itemmenu_SatisfactGauge_C) == 0x0004C0, "Wrong size on UW_Itemmenu_SatisfactGauge_C");
static_assert(offsetof(UW_Itemmenu_SatisfactGauge_C, CookIcon_1) == 0x0004A0, "Member 'UW_Itemmenu_SatisfactGauge_C::CookIcon_1' has a wrong offset!");
static_assert(offsetof(UW_Itemmenu_SatisfactGauge_C, CookIcon_2) == 0x0004A8, "Member 'UW_Itemmenu_SatisfactGauge_C::CookIcon_2' has a wrong offset!");
static_assert(offsetof(UW_Itemmenu_SatisfactGauge_C, W_Itemmenu_SatisfactIcon_L) == 0x0004B0, "Member 'UW_Itemmenu_SatisfactGauge_C::W_Itemmenu_SatisfactIcon_L' has a wrong offset!");
static_assert(offsetof(UW_Itemmenu_SatisfactGauge_C, W_Itemmenu_SatisfactIcon_R) == 0x0004B8, "Member 'UW_Itemmenu_SatisfactGauge_C::W_Itemmenu_SatisfactIcon_R' has a wrong offset!");

}

