#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Itemmenu_SatisfactIcon

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Itemmenu_SatisfactIcon.W_Itemmenu_SatisfactIcon_C
// 0x0030 (0x04C0 - 0x0490)
class UW_Itemmenu_SatisfactIcon_C final : public UUIItemmenu_SatisfactIcon
{
public:
	class UWidgetAnimation*                       off;                                               // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       R_On;                                              // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       L_On;                                              // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon_off;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 L_Icon;                                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 R_Icon;                                            // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Itemmenu_SatisfactIcon_C">();
	}
	static class UW_Itemmenu_SatisfactIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Itemmenu_SatisfactIcon_C>();
	}
};
static_assert(alignof(UW_Itemmenu_SatisfactIcon_C) == 0x000008, "Wrong alignment on UW_Itemmenu_SatisfactIcon_C");
static_assert(sizeof(UW_Itemmenu_SatisfactIcon_C) == 0x0004C0, "Wrong size on UW_Itemmenu_SatisfactIcon_C");
static_assert(offsetof(UW_Itemmenu_SatisfactIcon_C, off) == 0x000490, "Member 'UW_Itemmenu_SatisfactIcon_C::off' has a wrong offset!");
static_assert(offsetof(UW_Itemmenu_SatisfactIcon_C, R_On) == 0x000498, "Member 'UW_Itemmenu_SatisfactIcon_C::R_On' has a wrong offset!");
static_assert(offsetof(UW_Itemmenu_SatisfactIcon_C, L_On) == 0x0004A0, "Member 'UW_Itemmenu_SatisfactIcon_C::L_On' has a wrong offset!");
static_assert(offsetof(UW_Itemmenu_SatisfactIcon_C, Icon_off) == 0x0004A8, "Member 'UW_Itemmenu_SatisfactIcon_C::Icon_off' has a wrong offset!");
static_assert(offsetof(UW_Itemmenu_SatisfactIcon_C, L_Icon) == 0x0004B0, "Member 'UW_Itemmenu_SatisfactIcon_C::L_Icon' has a wrong offset!");
static_assert(offsetof(UW_Itemmenu_SatisfactIcon_C, R_Icon) == 0x0004B8, "Member 'UW_Itemmenu_SatisfactIcon_C::R_Icon' has a wrong offset!");

}

