#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Itemget_NewItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Itemget_NewItem.W_Itemget_NewItem_C
// 0x01D0 (0x0660 - 0x0490)
class UW_Itemget_NewItem_C final : public UUIItemget_NewItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OS_Pos;                                            // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       JA_Pos;                                            // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Kira_Off;                                          // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Kira_On;                                           // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Item;                                              // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Button_A;                                          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         CloseText;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComputeTextBlock*                      Explanation01;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Explanation02;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Explanation03;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ExplanationBase_00;                                // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         ItemName;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Kira;                                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_01;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BG_Black_C*                          W_BG_Black;                                        // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         DecideVisibleTimer;                                // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTimer;                                          // 0x052C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ItemId;                                            // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ItemInfoData                       ItemData;                                          // 0x0538(0x0128)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetFlavorTextAnim();
	void SetKiraAnim(class FName InItemId, EItemDataType InItemType);
	void GetRecipeItemDataInfo(class FName InRecipeId, struct FST_ItemInfoData* OutRecipeItemInfo);
	void GetItemDataInfo(class FName InItemId, struct FST_ItemInfoData* OutItemInfo);
	void SetPrintData(const class FText& InName, TSoftObjectPtr<class UTexture2D> InIconTexture, const class FText& InText);
	void InputEventFunc(float DeltaTime, bool GamePaused, const struct FKeyInput& KeyInput, struct FKeyInput* OutKeyInput, struct FEventReply* Reply);
	void HiddenDesideButton();
	void VisibleDesideButton();
	void SetItemFlavorText(const class FString& SourceString);
	void SetItemData(class FName InItemId);
	void open();
	void Update(float DeltaTime);
	void ExecuteUbergraph_W_Itemget_NewItem(int32 EntryPoint);

	bool IsDecideVisible() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Itemget_NewItem_C">();
	}
	static class UW_Itemget_NewItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Itemget_NewItem_C>();
	}
};
static_assert(alignof(UW_Itemget_NewItem_C) == 0x000008, "Wrong alignment on UW_Itemget_NewItem_C");
static_assert(sizeof(UW_Itemget_NewItem_C) == 0x000660, "Wrong size on UW_Itemget_NewItem_C");
static_assert(offsetof(UW_Itemget_NewItem_C, UberGraphFrame) == 0x000490, "Member 'UW_Itemget_NewItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, OS_Pos) == 0x000498, "Member 'UW_Itemget_NewItem_C::OS_Pos' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, JA_Pos) == 0x0004A0, "Member 'UW_Itemget_NewItem_C::JA_Pos' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, Kira_Off) == 0x0004A8, "Member 'UW_Itemget_NewItem_C::Kira_Off' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, Kira_On) == 0x0004B0, "Member 'UW_Itemget_NewItem_C::Kira_On' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, Item) == 0x0004B8, "Member 'UW_Itemget_NewItem_C::Item' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, Out) == 0x0004C0, "Member 'UW_Itemget_NewItem_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, In) == 0x0004C8, "Member 'UW_Itemget_NewItem_C::In' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, Button_A) == 0x0004D0, "Member 'UW_Itemget_NewItem_C::Button_A' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, CloseText) == 0x0004D8, "Member 'UW_Itemget_NewItem_C::CloseText' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, Explanation01) == 0x0004E0, "Member 'UW_Itemget_NewItem_C::Explanation01' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, Explanation02) == 0x0004E8, "Member 'UW_Itemget_NewItem_C::Explanation02' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, Explanation03) == 0x0004F0, "Member 'UW_Itemget_NewItem_C::Explanation03' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, ExplanationBase_00) == 0x0004F8, "Member 'UW_Itemget_NewItem_C::ExplanationBase_00' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, Image_0) == 0x000500, "Member 'UW_Itemget_NewItem_C::Image_0' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, ItemName) == 0x000508, "Member 'UW_Itemget_NewItem_C::ItemName' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, Kira) == 0x000510, "Member 'UW_Itemget_NewItem_C::Kira' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, Line_01) == 0x000518, "Member 'UW_Itemget_NewItem_C::Line_01' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, W_BG_Black) == 0x000520, "Member 'UW_Itemget_NewItem_C::W_BG_Black' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, DecideVisibleTimer) == 0x000528, "Member 'UW_Itemget_NewItem_C::DecideVisibleTimer' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, MaxTimer) == 0x00052C, "Member 'UW_Itemget_NewItem_C::MaxTimer' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, ItemId) == 0x000530, "Member 'UW_Itemget_NewItem_C::ItemId' has a wrong offset!");
static_assert(offsetof(UW_Itemget_NewItem_C, ItemData) == 0x000538, "Member 'UW_Itemget_NewItem_C::ItemData' has a wrong offset!");

}

