#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Itemget_NewItem

#include "Basic.hpp"

#include "DarwinGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_Itemget_NewItem.W_Itemget_NewItem_C.SetFlavorTextAnim
// 0x0018 (0x0018 - 0x0000)
struct W_Itemget_NewItem_C_SetFlavorTextAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLargeSizeFlavorWindowByLanguage_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_Itemget_NewItem_C_SetFlavorTextAnim) == 0x000008, "Wrong alignment on W_Itemget_NewItem_C_SetFlavorTextAnim");
static_assert(sizeof(W_Itemget_NewItem_C_SetFlavorTextAnim) == 0x000018, "Wrong size on W_Itemget_NewItem_C_SetFlavorTextAnim");
static_assert(offsetof(W_Itemget_NewItem_C_SetFlavorTextAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'W_Itemget_NewItem_C_SetFlavorTextAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetFlavorTextAnim, CallFunc_PlayAnimation_ReturnValue_1) == 0x000008, "Member 'W_Itemget_NewItem_C_SetFlavorTextAnim::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetFlavorTextAnim, CallFunc_IsLargeSizeFlavorWindowByLanguage_ReturnValue) == 0x000010, "Member 'W_Itemget_NewItem_C_SetFlavorTextAnim::CallFunc_IsLargeSizeFlavorWindowByLanguage_ReturnValue' has a wrong offset!");

// Function W_Itemget_NewItem.W_Itemget_NewItem_C.SetKiraAnim
// 0x0030 (0x0030 - 0x0000)
struct W_Itemget_NewItem_C_SetKiraAnim final
{
public:
	class FName                                   InItemId;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemDataType                                 InItemType;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsLuxuryFoodId_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Itemget_NewItem_C_SetKiraAnim) == 0x000008, "Wrong alignment on W_Itemget_NewItem_C_SetKiraAnim");
static_assert(sizeof(W_Itemget_NewItem_C_SetKiraAnim) == 0x000030, "Wrong size on W_Itemget_NewItem_C_SetKiraAnim");
static_assert(offsetof(W_Itemget_NewItem_C_SetKiraAnim, InItemId) == 0x000000, "Member 'W_Itemget_NewItem_C_SetKiraAnim::InItemId' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetKiraAnim, InItemType) == 0x000008, "Member 'W_Itemget_NewItem_C_SetKiraAnim::InItemType' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetKiraAnim, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'W_Itemget_NewItem_C_SetKiraAnim::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetKiraAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'W_Itemget_NewItem_C_SetKiraAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetKiraAnim, CallFunc_GetIsLuxuryFoodId_ReturnValue) == 0x000018, "Member 'W_Itemget_NewItem_C_SetKiraAnim::CallFunc_GetIsLuxuryFoodId_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetKiraAnim, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'W_Itemget_NewItem_C_SetKiraAnim::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetKiraAnim, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'W_Itemget_NewItem_C_SetKiraAnim::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function W_Itemget_NewItem.W_Itemget_NewItem_C.GetRecipeItemDataInfo
// 0x0408 (0x0408 - 0x0000)
struct W_Itemget_NewItem_C_GetRecipeItemDataInfo final
{
public:
	class FName                                   InRecipeId;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ItemInfoData                       OutRecipeItemInfo;                                 // 0x0008(0x0128)(Parm, OutParm)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FST_UIFacilityBulletItem               CallFunc_GetDataTableRowFromName_OutRow;           // 0x0140(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FST_ItemInfoData                       CallFunc_GetItemDataInfo_OutItemInfo;              // 0x0188(0x0128)()
	struct FST_UIFacilityFoodItem                 CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x02B0(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_ItemInfoData                       CallFunc_GetItemDataInfo_OutItemInfo_1;            // 0x02E0(0x0128)()
};
static_assert(alignof(W_Itemget_NewItem_C_GetRecipeItemDataInfo) == 0x000008, "Wrong alignment on W_Itemget_NewItem_C_GetRecipeItemDataInfo");
static_assert(sizeof(W_Itemget_NewItem_C_GetRecipeItemDataInfo) == 0x000408, "Wrong size on W_Itemget_NewItem_C_GetRecipeItemDataInfo");
static_assert(offsetof(W_Itemget_NewItem_C_GetRecipeItemDataInfo, InRecipeId) == 0x000000, "Member 'W_Itemget_NewItem_C_GetRecipeItemDataInfo::InRecipeId' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetRecipeItemDataInfo, OutRecipeItemInfo) == 0x000008, "Member 'W_Itemget_NewItem_C_GetRecipeItemDataInfo::OutRecipeItemInfo' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetRecipeItemDataInfo, CallFunc_Conv_NameToString_ReturnValue) == 0x000130, "Member 'W_Itemget_NewItem_C_GetRecipeItemDataInfo::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetRecipeItemDataInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x000140, "Member 'W_Itemget_NewItem_C_GetRecipeItemDataInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetRecipeItemDataInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000160, "Member 'W_Itemget_NewItem_C_GetRecipeItemDataInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetRecipeItemDataInfo, CallFunc_Concat_StrStr_ReturnValue) == 0x000168, "Member 'W_Itemget_NewItem_C_GetRecipeItemDataInfo::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetRecipeItemDataInfo, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000178, "Member 'W_Itemget_NewItem_C_GetRecipeItemDataInfo::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetRecipeItemDataInfo, CallFunc_GetItemDataInfo_OutItemInfo) == 0x000188, "Member 'W_Itemget_NewItem_C_GetRecipeItemDataInfo::CallFunc_GetItemDataInfo_OutItemInfo' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetRecipeItemDataInfo, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0002B0, "Member 'W_Itemget_NewItem_C_GetRecipeItemDataInfo::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetRecipeItemDataInfo, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0002D8, "Member 'W_Itemget_NewItem_C_GetRecipeItemDataInfo::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetRecipeItemDataInfo, CallFunc_GetItemDataInfo_OutItemInfo_1) == 0x0002E0, "Member 'W_Itemget_NewItem_C_GetRecipeItemDataInfo::CallFunc_GetItemDataInfo_OutItemInfo_1' has a wrong offset!");

// Function W_Itemget_NewItem.W_Itemget_NewItem_C.GetItemDataInfo
// 0x0290 (0x0290 - 0x0000)
struct W_Itemget_NewItem_C_GetItemDataInfo final
{
public:
	class FName                                   InItemId;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_ItemInfoData                       OutItemInfo;                                       // 0x0008(0x0128)(Parm, OutParm)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FST_ItemInfoData                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0140(0x0128)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Itemget_NewItem_C_GetItemDataInfo) == 0x000008, "Wrong alignment on W_Itemget_NewItem_C_GetItemDataInfo");
static_assert(sizeof(W_Itemget_NewItem_C_GetItemDataInfo) == 0x000290, "Wrong size on W_Itemget_NewItem_C_GetItemDataInfo");
static_assert(offsetof(W_Itemget_NewItem_C_GetItemDataInfo, InItemId) == 0x000000, "Member 'W_Itemget_NewItem_C_GetItemDataInfo::InItemId' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetItemDataInfo, OutItemInfo) == 0x000008, "Member 'W_Itemget_NewItem_C_GetItemDataInfo::OutItemInfo' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetItemDataInfo, CallFunc_Conv_NameToString_ReturnValue) == 0x000130, "Member 'W_Itemget_NewItem_C_GetItemDataInfo::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetItemDataInfo, CallFunc_GetDataTableRowFromName_OutRow) == 0x000140, "Member 'W_Itemget_NewItem_C_GetItemDataInfo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetItemDataInfo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000268, "Member 'W_Itemget_NewItem_C_GetItemDataInfo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetItemDataInfo, CallFunc_Concat_StrStr_ReturnValue) == 0x000270, "Member 'W_Itemget_NewItem_C_GetItemDataInfo::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_GetItemDataInfo, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000280, "Member 'W_Itemget_NewItem_C_GetItemDataInfo::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");

// Function W_Itemget_NewItem.W_Itemget_NewItem_C.SetPrintData
// 0x00E0 (0x00E0 - 0x0000)
struct W_Itemget_NewItem_C_SetPrintData final
{
public:
	class FText                                   InName;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSoftObjectPtr<class UTexture2D>              InIconTexture;                                     // 0x0018(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FText                                   InText;                                            // 0x0040(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_SglListOf_ReturnValue;                    // 0x0068(0x0018)()
	class FString                                 CallFunc_AddNoBreakSpace_ReturnValue;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AddNoBreakSpace_ReturnValue_1;            // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_AlignNewLines_ReturnValue;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C0(0x0018)()
	class UTexture2D*                             CallFunc_LoadTextureSoft_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Itemget_NewItem_C_SetPrintData) == 0x000008, "Wrong alignment on W_Itemget_NewItem_C_SetPrintData");
static_assert(sizeof(W_Itemget_NewItem_C_SetPrintData) == 0x0000E0, "Wrong size on W_Itemget_NewItem_C_SetPrintData");
static_assert(offsetof(W_Itemget_NewItem_C_SetPrintData, InName) == 0x000000, "Member 'W_Itemget_NewItem_C_SetPrintData::InName' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetPrintData, InIconTexture) == 0x000018, "Member 'W_Itemget_NewItem_C_SetPrintData::InIconTexture' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetPrintData, InText) == 0x000040, "Member 'W_Itemget_NewItem_C_SetPrintData::InText' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetPrintData, CallFunc_Conv_TextToString_ReturnValue) == 0x000058, "Member 'W_Itemget_NewItem_C_SetPrintData::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetPrintData, CallFunc_SglListOf_ReturnValue) == 0x000068, "Member 'W_Itemget_NewItem_C_SetPrintData::CallFunc_SglListOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetPrintData, CallFunc_AddNoBreakSpace_ReturnValue) == 0x000080, "Member 'W_Itemget_NewItem_C_SetPrintData::CallFunc_AddNoBreakSpace_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetPrintData, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000090, "Member 'W_Itemget_NewItem_C_SetPrintData::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetPrintData, CallFunc_AddNoBreakSpace_ReturnValue_1) == 0x0000A0, "Member 'W_Itemget_NewItem_C_SetPrintData::CallFunc_AddNoBreakSpace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetPrintData, CallFunc_AlignNewLines_ReturnValue) == 0x0000B0, "Member 'W_Itemget_NewItem_C_SetPrintData::CallFunc_AlignNewLines_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetPrintData, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C0, "Member 'W_Itemget_NewItem_C_SetPrintData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetPrintData, CallFunc_LoadTextureSoft_ReturnValue) == 0x0000D8, "Member 'W_Itemget_NewItem_C_SetPrintData::CallFunc_LoadTextureSoft_ReturnValue' has a wrong offset!");

// Function W_Itemget_NewItem.W_Itemget_NewItem_C.InputEventFunc
// 0x0260 (0x0260 - 0x0000)
struct W_Itemget_NewItem_C_InputEventFunc final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GamePaused;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKeyInput                              KeyInput;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FKeyInput                              OutKeyInput;                                       // 0x0018(0x0010)(Parm, OutParm)
	struct FEventReply                            Reply;                                             // 0x0028(0x00B8)(Parm, OutParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00E0(0x00B8)()
	struct FKeyInput                              CallFunc_InputEventFunc_OutKeyInput;               // 0x0198(0x0010)()
	struct FEventReply                            CallFunc_InputEventFunc_Reply;                     // 0x01A8(0x00B8)()
};
static_assert(alignof(W_Itemget_NewItem_C_InputEventFunc) == 0x000008, "Wrong alignment on W_Itemget_NewItem_C_InputEventFunc");
static_assert(sizeof(W_Itemget_NewItem_C_InputEventFunc) == 0x000260, "Wrong size on W_Itemget_NewItem_C_InputEventFunc");
static_assert(offsetof(W_Itemget_NewItem_C_InputEventFunc, DeltaTime) == 0x000000, "Member 'W_Itemget_NewItem_C_InputEventFunc::DeltaTime' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_InputEventFunc, GamePaused) == 0x000004, "Member 'W_Itemget_NewItem_C_InputEventFunc::GamePaused' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_InputEventFunc, KeyInput) == 0x000008, "Member 'W_Itemget_NewItem_C_InputEventFunc::KeyInput' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_InputEventFunc, OutKeyInput) == 0x000018, "Member 'W_Itemget_NewItem_C_InputEventFunc::OutKeyInput' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_InputEventFunc, Reply) == 0x000028, "Member 'W_Itemget_NewItem_C_InputEventFunc::Reply' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_InputEventFunc, CallFunc_Handled_ReturnValue) == 0x0000E0, "Member 'W_Itemget_NewItem_C_InputEventFunc::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_InputEventFunc, CallFunc_InputEventFunc_OutKeyInput) == 0x000198, "Member 'W_Itemget_NewItem_C_InputEventFunc::CallFunc_InputEventFunc_OutKeyInput' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_InputEventFunc, CallFunc_InputEventFunc_Reply) == 0x0001A8, "Member 'W_Itemget_NewItem_C_InputEventFunc::CallFunc_InputEventFunc_Reply' has a wrong offset!");

// Function W_Itemget_NewItem.W_Itemget_NewItem_C.SetItemFlavorText
// 0x00D8 (0x00D8 - 0x0000)
struct W_Itemget_NewItem_C_SetItemFlavorText final
{
public:
	class FString                                 SourceString;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
	class FString                                 CallFunc_Split_LeftS;                              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Split_LeftS_1;                            // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS_1;                           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue_1;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0078(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0090(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x00A8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x00C0(0x0018)()
};
static_assert(alignof(W_Itemget_NewItem_C_SetItemFlavorText) == 0x000008, "Wrong alignment on W_Itemget_NewItem_C_SetItemFlavorText");
static_assert(sizeof(W_Itemget_NewItem_C_SetItemFlavorText) == 0x0000D8, "Wrong size on W_Itemget_NewItem_C_SetItemFlavorText");
static_assert(offsetof(W_Itemget_NewItem_C_SetItemFlavorText, SourceString) == 0x000000, "Member 'W_Itemget_NewItem_C_SetItemFlavorText::SourceString' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetItemFlavorText, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'W_Itemget_NewItem_C_SetItemFlavorText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetItemFlavorText, CallFunc_Split_LeftS) == 0x000028, "Member 'W_Itemget_NewItem_C_SetItemFlavorText::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetItemFlavorText, CallFunc_Split_RightS) == 0x000038, "Member 'W_Itemget_NewItem_C_SetItemFlavorText::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetItemFlavorText, CallFunc_Split_ReturnValue) == 0x000048, "Member 'W_Itemget_NewItem_C_SetItemFlavorText::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetItemFlavorText, CallFunc_Split_LeftS_1) == 0x000050, "Member 'W_Itemget_NewItem_C_SetItemFlavorText::CallFunc_Split_LeftS_1' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetItemFlavorText, CallFunc_Split_RightS_1) == 0x000060, "Member 'W_Itemget_NewItem_C_SetItemFlavorText::CallFunc_Split_RightS_1' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetItemFlavorText, CallFunc_Split_ReturnValue_1) == 0x000070, "Member 'W_Itemget_NewItem_C_SetItemFlavorText::CallFunc_Split_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetItemFlavorText, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000078, "Member 'W_Itemget_NewItem_C_SetItemFlavorText::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetItemFlavorText, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000090, "Member 'W_Itemget_NewItem_C_SetItemFlavorText::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetItemFlavorText, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0000A8, "Member 'W_Itemget_NewItem_C_SetItemFlavorText::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_SetItemFlavorText, CallFunc_Conv_StringToText_ReturnValue_4) == 0x0000C0, "Member 'W_Itemget_NewItem_C_SetItemFlavorText::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");

// Function W_Itemget_NewItem.W_Itemget_NewItem_C.SetItemData
// 0x0008 (0x0008 - 0x0000)
struct W_Itemget_NewItem_C_SetItemData final
{
public:
	class FName                                   InItemId;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Itemget_NewItem_C_SetItemData) == 0x000004, "Wrong alignment on W_Itemget_NewItem_C_SetItemData");
static_assert(sizeof(W_Itemget_NewItem_C_SetItemData) == 0x000008, "Wrong size on W_Itemget_NewItem_C_SetItemData");
static_assert(offsetof(W_Itemget_NewItem_C_SetItemData, InItemId) == 0x000000, "Member 'W_Itemget_NewItem_C_SetItemData::InItemId' has a wrong offset!");

// Function W_Itemget_NewItem.W_Itemget_NewItem_C.Update
// 0x0004 (0x0004 - 0x0000)
struct W_Itemget_NewItem_C_Update final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Itemget_NewItem_C_Update) == 0x000004, "Wrong alignment on W_Itemget_NewItem_C_Update");
static_assert(sizeof(W_Itemget_NewItem_C_Update) == 0x000004, "Wrong size on W_Itemget_NewItem_C_Update");
static_assert(offsetof(W_Itemget_NewItem_C_Update, DeltaTime) == 0x000000, "Member 'W_Itemget_NewItem_C_Update::DeltaTime' has a wrong offset!");

// Function W_Itemget_NewItem.W_Itemget_NewItem_C.ExecuteUbergraph_W_Itemget_NewItem
// 0x02C0 (0x02C0 - 0x0000)
struct W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InItemID;                             // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_ItemInfoData                       CallFunc_GetRecipeItemDataInfo_OutRecipeItemInfo;  // 0x0010(0x0128)()
	struct FST_ItemInfoData                       CallFunc_GetItemDataInfo_OutItemInfo;              // 0x0138(0x0128)()
	float                                         K2Node_Event_DeltaTime;                            // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatItemFlavorText_ReturnValue;         // 0x0270(0x0018)()
	class FText                                   CallFunc_FormatItemFlavorText_ReturnValue_1;       // 0x0288(0x0018)()
	bool                                          CallFunc_IsPlayingMe_ReturnValue;                  // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem) == 0x000008, "Wrong alignment on W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem");
static_assert(sizeof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem) == 0x0002C0, "Wrong size on W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem");
static_assert(offsetof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem, EntryPoint) == 0x000000, "Member 'W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem, K2Node_Event_InItemID) == 0x000004, "Member 'W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem::K2Node_Event_InItemID' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem, CallFunc_GetRecipeItemDataInfo_OutRecipeItemInfo) == 0x000010, "Member 'W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem::CallFunc_GetRecipeItemDataInfo_OutRecipeItemInfo' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem, CallFunc_GetItemDataInfo_OutItemInfo) == 0x000138, "Member 'W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem::CallFunc_GetItemDataInfo_OutItemInfo' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem, K2Node_Event_DeltaTime) == 0x000260, "Member 'W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem, CallFunc_Less_FloatFloat_ReturnValue) == 0x000264, "Member 'W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000268, "Member 'W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem, CallFunc_FormatItemFlavorText_ReturnValue) == 0x000270, "Member 'W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem::CallFunc_FormatItemFlavorText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem, CallFunc_FormatItemFlavorText_ReturnValue_1) == 0x000288, "Member 'W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem::CallFunc_FormatItemFlavorText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem, CallFunc_IsPlayingMe_ReturnValue) == 0x0002A0, "Member 'W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem::CallFunc_IsPlayingMe_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem, CallFunc_GetDisplayName_ReturnValue) == 0x0002A8, "Member 'W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002B8, "Member 'W_Itemget_NewItem_C_ExecuteUbergraph_W_Itemget_NewItem::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function W_Itemget_NewItem.W_Itemget_NewItem_C.IsDecideVisible
// 0x0002 (0x0002 - 0x0000)
struct W_Itemget_NewItem_C_IsDecideVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_Itemget_NewItem_C_IsDecideVisible) == 0x000001, "Wrong alignment on W_Itemget_NewItem_C_IsDecideVisible");
static_assert(sizeof(W_Itemget_NewItem_C_IsDecideVisible) == 0x000002, "Wrong size on W_Itemget_NewItem_C_IsDecideVisible");
static_assert(offsetof(W_Itemget_NewItem_C_IsDecideVisible, ReturnValue) == 0x000000, "Member 'W_Itemget_NewItem_C_IsDecideVisible::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Itemget_NewItem_C_IsDecideVisible, CallFunc_Less_FloatFloat_ReturnValue) == 0x000001, "Member 'W_Itemget_NewItem_C_IsDecideVisible::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

