#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_KnowledgeMenu

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_KnowledgeMenu.W_KnowledgeMenu_C
// 0x0040 (0x0588 - 0x0548)
class UW_KnowledgeMenu_C final : public UUIKnowledgeMenu
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Progress_Icon;                                     // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KnowledgeMenu_Page01_C*              W_KnowledgeMenu_Page01;                            // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_KnowledgeMenu_Page02_C*              W_KnowledgeMenu_Page02;                            // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LeftMenu_7_C*                        W_LeftMenu;                                        // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TopBar_01_C*                         W_TopBar_00;                                       // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Under_Button_C*                      W_Under_Button;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_KnowledgeMenu_C">();
	}
	static class UW_KnowledgeMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_KnowledgeMenu_C>();
	}
};
static_assert(alignof(UW_KnowledgeMenu_C) == 0x000008, "Wrong alignment on UW_KnowledgeMenu_C");
static_assert(sizeof(UW_KnowledgeMenu_C) == 0x000588, "Wrong size on UW_KnowledgeMenu_C");
static_assert(offsetof(UW_KnowledgeMenu_C, Out) == 0x000548, "Member 'UW_KnowledgeMenu_C::Out' has a wrong offset!");
static_assert(offsetof(UW_KnowledgeMenu_C, In) == 0x000550, "Member 'UW_KnowledgeMenu_C::In' has a wrong offset!");
static_assert(offsetof(UW_KnowledgeMenu_C, Progress_Icon) == 0x000558, "Member 'UW_KnowledgeMenu_C::Progress_Icon' has a wrong offset!");
static_assert(offsetof(UW_KnowledgeMenu_C, W_KnowledgeMenu_Page01) == 0x000560, "Member 'UW_KnowledgeMenu_C::W_KnowledgeMenu_Page01' has a wrong offset!");
static_assert(offsetof(UW_KnowledgeMenu_C, W_KnowledgeMenu_Page02) == 0x000568, "Member 'UW_KnowledgeMenu_C::W_KnowledgeMenu_Page02' has a wrong offset!");
static_assert(offsetof(UW_KnowledgeMenu_C, W_LeftMenu) == 0x000570, "Member 'UW_KnowledgeMenu_C::W_LeftMenu' has a wrong offset!");
static_assert(offsetof(UW_KnowledgeMenu_C, W_TopBar_00) == 0x000578, "Member 'UW_KnowledgeMenu_C::W_TopBar_00' has a wrong offset!");
static_assert(offsetof(UW_KnowledgeMenu_C, W_Under_Button) == 0x000580, "Member 'UW_KnowledgeMenu_C::W_Under_Button' has a wrong offset!");

}

