#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LeftMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LeftMenu.W_LeftMenu_C
// 0x00E0 (0x0730 - 0x0650)
class UW_LeftMenu_C final : public UUILeftMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BG_Off;                                            // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BG_Out;                                            // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BG_In;                                             // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemDict_Off;                                      // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemDict_On;                                       // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       White_On;                                          // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       White_Off;                                         // 0x0688(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_6_2ndPanel;                                     // 0x0690(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_6Panel;                                         // 0x0698(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x06A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BtnArea_1;                                         // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnArea_2;                                         // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Header_01_C*                         Header_01;                                         // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_02_C*               Select_Panel_01;                                   // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_02_C*               Select_Panel_02;                                   // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_02_C*               Select_Panel_03;                                   // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_02_C*               Select_Panel_04;                                   // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_02_C*               Select_Panel_05;                                   // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_02_C*               Select_Panel_06;                                   // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_02_C*               Select_SubPanel_01;                                // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_02_C*               Select_SubPanel_02;                                // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_02_C*               Select_SubPanel_03;                                // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_02_C*               Select_SubPanel_04;                                // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_02_C*               Select_SubPanel_05;                                // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PartyMenu_BG_C*                      W_PartyMenu_BG;                                    // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WhiteBG;                                           // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_LeftMenu(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_LeftMenu_C">();
	}
	static class UW_LeftMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LeftMenu_C>();
	}
};
static_assert(alignof(UW_LeftMenu_C) == 0x000008, "Wrong alignment on UW_LeftMenu_C");
static_assert(sizeof(UW_LeftMenu_C) == 0x000730, "Wrong size on UW_LeftMenu_C");
static_assert(offsetof(UW_LeftMenu_C, UberGraphFrame) == 0x000650, "Member 'UW_LeftMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, BG_Off) == 0x000658, "Member 'UW_LeftMenu_C::BG_Off' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, BG_Out) == 0x000660, "Member 'UW_LeftMenu_C::BG_Out' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, BG_In) == 0x000668, "Member 'UW_LeftMenu_C::BG_In' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, ItemDict_Off) == 0x000670, "Member 'UW_LeftMenu_C::ItemDict_Off' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, ItemDict_On) == 0x000678, "Member 'UW_LeftMenu_C::ItemDict_On' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, White_On) == 0x000680, "Member 'UW_LeftMenu_C::White_On' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, White_Off) == 0x000688, "Member 'UW_LeftMenu_C::White_Off' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, In_6_2ndPanel) == 0x000690, "Member 'UW_LeftMenu_C::In_6_2ndPanel' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, In_6Panel) == 0x000698, "Member 'UW_LeftMenu_C::In_6Panel' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, Out) == 0x0006A0, "Member 'UW_LeftMenu_C::Out' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, BtnArea_1) == 0x0006A8, "Member 'UW_LeftMenu_C::BtnArea_1' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, BtnArea_2) == 0x0006B0, "Member 'UW_LeftMenu_C::BtnArea_2' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, Header_01) == 0x0006B8, "Member 'UW_LeftMenu_C::Header_01' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, Select_Panel_01) == 0x0006C0, "Member 'UW_LeftMenu_C::Select_Panel_01' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, Select_Panel_02) == 0x0006C8, "Member 'UW_LeftMenu_C::Select_Panel_02' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, Select_Panel_03) == 0x0006D0, "Member 'UW_LeftMenu_C::Select_Panel_03' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, Select_Panel_04) == 0x0006D8, "Member 'UW_LeftMenu_C::Select_Panel_04' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, Select_Panel_05) == 0x0006E0, "Member 'UW_LeftMenu_C::Select_Panel_05' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, Select_Panel_06) == 0x0006E8, "Member 'UW_LeftMenu_C::Select_Panel_06' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, Select_SubPanel_01) == 0x0006F0, "Member 'UW_LeftMenu_C::Select_SubPanel_01' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, Select_SubPanel_02) == 0x0006F8, "Member 'UW_LeftMenu_C::Select_SubPanel_02' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, Select_SubPanel_03) == 0x000700, "Member 'UW_LeftMenu_C::Select_SubPanel_03' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, Select_SubPanel_04) == 0x000708, "Member 'UW_LeftMenu_C::Select_SubPanel_04' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, Select_SubPanel_05) == 0x000710, "Member 'UW_LeftMenu_C::Select_SubPanel_05' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, W_Menu_IconArrow) == 0x000718, "Member 'UW_LeftMenu_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, W_PartyMenu_BG) == 0x000720, "Member 'UW_LeftMenu_C::W_PartyMenu_BG' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_C, WhiteBG) == 0x000728, "Member 'UW_LeftMenu_C::WhiteBG' has a wrong offset!");

}

