#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LeftMenu_7

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LeftMenu_7.W_LeftMenu_7_C
// 0x0108 (0x0788 - 0x0680)
class UW_LeftMenu_7_C final : public UUILeftMenu_7
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       In_6_2ndPanel;                                     // 0x0688(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_6Panel;                                         // 0x0690(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0698(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BtnArea_1;                                         // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnArea_2;                                         // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Header_01_C*                         Header_01;                                         // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_Panel_10;                                   // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_Panel_01;                                   // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_Panel_02;                                   // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_Panel_03;                                   // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_Panel_04;                                   // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_Panel_05;                                   // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_Panel_06;                                   // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_Panel_07;                                   // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_Panel_08;                                   // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_Panel_09;                                   // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_SubPanel_01;                                // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_SubPanel_02;                                // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_SubPanel_03;                                // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_SubPanel_04;                                // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_SubPanel_05;                                // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_SubPanel_06;                                // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_SubPanel_07;                                // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_SubPanel_08;                                // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_06_C*               Select_SubPanel_09;                                // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconDelta_00_C*                 W_Menu_IconDelta_00;                               // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconDelta_01_C*                 W_Menu_IconDelta_01;                               // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconDelta_00_C*                 W_Menu_IconSubDelta_00;                            // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconDelta_01_C*                 W_Menu_IconSubDelta_01;                            // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PartyMenu_BG_C*                      W_PartyMenu_BG;                                    // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Under_Button_C*                      W_Under_Button;                                    // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_LeftMenu_7(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_LeftMenu_7_C">();
	}
	static class UW_LeftMenu_7_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LeftMenu_7_C>();
	}
};
static_assert(alignof(UW_LeftMenu_7_C) == 0x000008, "Wrong alignment on UW_LeftMenu_7_C");
static_assert(sizeof(UW_LeftMenu_7_C) == 0x000788, "Wrong size on UW_LeftMenu_7_C");
static_assert(offsetof(UW_LeftMenu_7_C, UberGraphFrame) == 0x000680, "Member 'UW_LeftMenu_7_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, In_6_2ndPanel) == 0x000688, "Member 'UW_LeftMenu_7_C::In_6_2ndPanel' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, In_6Panel) == 0x000690, "Member 'UW_LeftMenu_7_C::In_6Panel' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Out) == 0x000698, "Member 'UW_LeftMenu_7_C::Out' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, BtnArea_1) == 0x0006A0, "Member 'UW_LeftMenu_7_C::BtnArea_1' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, BtnArea_2) == 0x0006A8, "Member 'UW_LeftMenu_7_C::BtnArea_2' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Header_01) == 0x0006B0, "Member 'UW_LeftMenu_7_C::Header_01' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_Panel_10) == 0x0006B8, "Member 'UW_LeftMenu_7_C::Select_Panel_10' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_Panel_01) == 0x0006C0, "Member 'UW_LeftMenu_7_C::Select_Panel_01' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_Panel_02) == 0x0006C8, "Member 'UW_LeftMenu_7_C::Select_Panel_02' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_Panel_03) == 0x0006D0, "Member 'UW_LeftMenu_7_C::Select_Panel_03' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_Panel_04) == 0x0006D8, "Member 'UW_LeftMenu_7_C::Select_Panel_04' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_Panel_05) == 0x0006E0, "Member 'UW_LeftMenu_7_C::Select_Panel_05' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_Panel_06) == 0x0006E8, "Member 'UW_LeftMenu_7_C::Select_Panel_06' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_Panel_07) == 0x0006F0, "Member 'UW_LeftMenu_7_C::Select_Panel_07' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_Panel_08) == 0x0006F8, "Member 'UW_LeftMenu_7_C::Select_Panel_08' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_Panel_09) == 0x000700, "Member 'UW_LeftMenu_7_C::Select_Panel_09' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_SubPanel_01) == 0x000708, "Member 'UW_LeftMenu_7_C::Select_SubPanel_01' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_SubPanel_02) == 0x000710, "Member 'UW_LeftMenu_7_C::Select_SubPanel_02' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_SubPanel_03) == 0x000718, "Member 'UW_LeftMenu_7_C::Select_SubPanel_03' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_SubPanel_04) == 0x000720, "Member 'UW_LeftMenu_7_C::Select_SubPanel_04' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_SubPanel_05) == 0x000728, "Member 'UW_LeftMenu_7_C::Select_SubPanel_05' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_SubPanel_06) == 0x000730, "Member 'UW_LeftMenu_7_C::Select_SubPanel_06' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_SubPanel_07) == 0x000738, "Member 'UW_LeftMenu_7_C::Select_SubPanel_07' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_SubPanel_08) == 0x000740, "Member 'UW_LeftMenu_7_C::Select_SubPanel_08' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, Select_SubPanel_09) == 0x000748, "Member 'UW_LeftMenu_7_C::Select_SubPanel_09' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, W_Menu_IconArrow) == 0x000750, "Member 'UW_LeftMenu_7_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, W_Menu_IconDelta_00) == 0x000758, "Member 'UW_LeftMenu_7_C::W_Menu_IconDelta_00' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, W_Menu_IconDelta_01) == 0x000760, "Member 'UW_LeftMenu_7_C::W_Menu_IconDelta_01' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, W_Menu_IconSubDelta_00) == 0x000768, "Member 'UW_LeftMenu_7_C::W_Menu_IconSubDelta_00' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, W_Menu_IconSubDelta_01) == 0x000770, "Member 'UW_LeftMenu_7_C::W_Menu_IconSubDelta_01' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, W_PartyMenu_BG) == 0x000778, "Member 'UW_LeftMenu_7_C::W_PartyMenu_BG' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_7_C, W_Under_Button) == 0x000780, "Member 'UW_LeftMenu_7_C::W_Under_Button' has a wrong offset!");

}

