#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LeftMenu_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LeftMenu_2.W_LeftMenu_2_C
// 0x0078 (0x06C8 - 0x0650)
class UW_LeftMenu_2_C final : public UUILeftMenu_2
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out_Coin;                                          // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_Coin;                                           // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_2ndPanel;                                       // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BtnArea_1;                                         // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnArea_2;                                         // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Header_01_C*                         Header_01;                                         // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Header_Shadow;                                     // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_01_C*               Member_panel_01;                                   // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_01_C*               Member_panel_02;                                   // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_01_C*               Member_panel_03;                                   // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Cursor_Partymenu_01_C*               Member_panel_04;                                   // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_LeftMenu_2(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_LeftMenu_2_C">();
	}
	static class UW_LeftMenu_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LeftMenu_2_C>();
	}
};
static_assert(alignof(UW_LeftMenu_2_C) == 0x000008, "Wrong alignment on UW_LeftMenu_2_C");
static_assert(sizeof(UW_LeftMenu_2_C) == 0x0006C8, "Wrong size on UW_LeftMenu_2_C");
static_assert(offsetof(UW_LeftMenu_2_C, UberGraphFrame) == 0x000650, "Member 'UW_LeftMenu_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, Out_Coin) == 0x000658, "Member 'UW_LeftMenu_2_C::Out_Coin' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, In_Coin) == 0x000660, "Member 'UW_LeftMenu_2_C::In_Coin' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, In_2ndPanel) == 0x000668, "Member 'UW_LeftMenu_2_C::In_2ndPanel' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, Out) == 0x000670, "Member 'UW_LeftMenu_2_C::Out' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, In) == 0x000678, "Member 'UW_LeftMenu_2_C::In' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, BtnArea_1) == 0x000680, "Member 'UW_LeftMenu_2_C::BtnArea_1' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, BtnArea_2) == 0x000688, "Member 'UW_LeftMenu_2_C::BtnArea_2' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, Header_01) == 0x000690, "Member 'UW_LeftMenu_2_C::Header_01' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, Header_Shadow) == 0x000698, "Member 'UW_LeftMenu_2_C::Header_Shadow' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, Member_panel_01) == 0x0006A0, "Member 'UW_LeftMenu_2_C::Member_panel_01' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, Member_panel_02) == 0x0006A8, "Member 'UW_LeftMenu_2_C::Member_panel_02' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, Member_panel_03) == 0x0006B0, "Member 'UW_LeftMenu_2_C::Member_panel_03' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, Member_panel_04) == 0x0006B8, "Member 'UW_LeftMenu_2_C::Member_panel_04' has a wrong offset!");
static_assert(offsetof(UW_LeftMenu_2_C, W_Menu_IconArrow) == 0x0006C0, "Member 'UW_LeftMenu_2_C::W_Menu_IconArrow' has a wrong offset!");

}

