#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadIconFrame

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LoadIconFrame.W_LoadIconFrame_C
// 0x0028 (0x0520 - 0x04F8)
class UW_LoadIconFrame_C final : public UUIStartLoopAnimation
{
public:
	class UWidgetAnimation*                       off;                                               // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Additive;                                    // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_LoadIconFrame_C">();
	}
	static class UW_LoadIconFrame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LoadIconFrame_C>();
	}
};
static_assert(alignof(UW_LoadIconFrame_C) == 0x000008, "Wrong alignment on UW_LoadIconFrame_C");
static_assert(sizeof(UW_LoadIconFrame_C) == 0x000520, "Wrong size on UW_LoadIconFrame_C");
static_assert(offsetof(UW_LoadIconFrame_C, off) == 0x0004F8, "Member 'UW_LoadIconFrame_C::off' has a wrong offset!");
static_assert(offsetof(UW_LoadIconFrame_C, Wait) == 0x000500, "Member 'UW_LoadIconFrame_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_LoadIconFrame_C, on) == 0x000508, "Member 'UW_LoadIconFrame_C::on' has a wrong offset!");
static_assert(offsetof(UW_LoadIconFrame_C, Frame) == 0x000510, "Member 'UW_LoadIconFrame_C::Frame' has a wrong offset!");
static_assert(offsetof(UW_LoadIconFrame_C, Frame_Additive) == 0x000518, "Member 'UW_LoadIconFrame_C::Frame_Additive' has a wrong offset!");

}

