#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadContent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LoadContent.W_LoadContent_C
// 0x0050 (0x0668 - 0x0618)
class UW_LoadContent_C final : public UUILoadContent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Double;                                            // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Single;                                            // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 PM_ListBG_1;                                       // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleBase;                                         // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadIconChoice_C*                    W_LoadIconChoice_01;                               // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadIconChoice_C*                    W_LoadIconChoice_02;                               // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_LoadContent(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_LoadContent_C">();
	}
	static class UW_LoadContent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LoadContent_C>();
	}
};
static_assert(alignof(UW_LoadContent_C) == 0x000008, "Wrong alignment on UW_LoadContent_C");
static_assert(sizeof(UW_LoadContent_C) == 0x000668, "Wrong size on UW_LoadContent_C");
static_assert(offsetof(UW_LoadContent_C, UberGraphFrame) == 0x000618, "Member 'UW_LoadContent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_LoadContent_C, Double) == 0x000620, "Member 'UW_LoadContent_C::Double' has a wrong offset!");
static_assert(offsetof(UW_LoadContent_C, Single) == 0x000628, "Member 'UW_LoadContent_C::Single' has a wrong offset!");
static_assert(offsetof(UW_LoadContent_C, Out) == 0x000630, "Member 'UW_LoadContent_C::Out' has a wrong offset!");
static_assert(offsetof(UW_LoadContent_C, In) == 0x000638, "Member 'UW_LoadContent_C::In' has a wrong offset!");
static_assert(offsetof(UW_LoadContent_C, PM_ListBG_1) == 0x000640, "Member 'UW_LoadContent_C::PM_ListBG_1' has a wrong offset!");
static_assert(offsetof(UW_LoadContent_C, TitleBase) == 0x000648, "Member 'UW_LoadContent_C::TitleBase' has a wrong offset!");
static_assert(offsetof(UW_LoadContent_C, W_LoadIconChoice_01) == 0x000650, "Member 'UW_LoadContent_C::W_LoadIconChoice_01' has a wrong offset!");
static_assert(offsetof(UW_LoadContent_C, W_LoadIconChoice_02) == 0x000658, "Member 'UW_LoadContent_C::W_LoadIconChoice_02' has a wrong offset!");
static_assert(offsetof(UW_LoadContent_C, W_Menu_IconArrow) == 0x000660, "Member 'UW_LoadContent_C::W_Menu_IconArrow' has a wrong offset!");

}

