#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Loading_Win_Tutorial

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Loading_Win_Tutorial.W_Loading_Win_Tutorial_C
// 0x0098 (0x05D0 - 0x0538)
class UW_Loading_Win_Tutorial_C final : public UUILoading_Win_Tutorial
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Button_A;                                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_Base;                                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_186;                                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_223;                                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_253;                                         // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         ItemName;                                          // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MultiBase_NextIcon_C*                NextIcon_L;                                        // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MultiBase_NextIcon_C*                NextIcon_R;                                        // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_Pointreader_C*                 Point_0001;                                        // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_Pointreader_C*                 Point_0002;                                        // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_Pointreader_C*                 Point_0003;                                        // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_Pointreader_C*                 Point_0004;                                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_Pointreader_C*                 Point_0005;                                        // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Field_Pointreader_C*                 Point_0006;                                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         TextBlock_14;                                      // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tips_Image;                                        // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TextWidget_C*                        W_TextWidget;                                      // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Loading_Win_Tutorial_C">();
	}
	static class UW_Loading_Win_Tutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Loading_Win_Tutorial_C>();
	}
};
static_assert(alignof(UW_Loading_Win_Tutorial_C) == 0x000008, "Wrong alignment on UW_Loading_Win_Tutorial_C");
static_assert(sizeof(UW_Loading_Win_Tutorial_C) == 0x0005D0, "Wrong size on UW_Loading_Win_Tutorial_C");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, Out) == 0x000538, "Member 'UW_Loading_Win_Tutorial_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, In) == 0x000540, "Member 'UW_Loading_Win_Tutorial_C::In' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, Button_A) == 0x000548, "Member 'UW_Loading_Win_Tutorial_C::Button_A' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, Button_Base) == 0x000550, "Member 'UW_Loading_Win_Tutorial_C::Button_Base' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, Image_186) == 0x000558, "Member 'UW_Loading_Win_Tutorial_C::Image_186' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, Image_223) == 0x000560, "Member 'UW_Loading_Win_Tutorial_C::Image_223' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, Image_253) == 0x000568, "Member 'UW_Loading_Win_Tutorial_C::Image_253' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, ItemName) == 0x000570, "Member 'UW_Loading_Win_Tutorial_C::ItemName' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, NextIcon_L) == 0x000578, "Member 'UW_Loading_Win_Tutorial_C::NextIcon_L' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, NextIcon_R) == 0x000580, "Member 'UW_Loading_Win_Tutorial_C::NextIcon_R' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, Point_0001) == 0x000588, "Member 'UW_Loading_Win_Tutorial_C::Point_0001' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, Point_0002) == 0x000590, "Member 'UW_Loading_Win_Tutorial_C::Point_0002' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, Point_0003) == 0x000598, "Member 'UW_Loading_Win_Tutorial_C::Point_0003' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, Point_0004) == 0x0005A0, "Member 'UW_Loading_Win_Tutorial_C::Point_0004' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, Point_0005) == 0x0005A8, "Member 'UW_Loading_Win_Tutorial_C::Point_0005' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, Point_0006) == 0x0005B0, "Member 'UW_Loading_Win_Tutorial_C::Point_0006' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, TextBlock_14) == 0x0005B8, "Member 'UW_Loading_Win_Tutorial_C::TextBlock_14' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, Tips_Image) == 0x0005C0, "Member 'UW_Loading_Win_Tutorial_C::Tips_Image' has a wrong offset!");
static_assert(offsetof(UW_Loading_Win_Tutorial_C, W_TextWidget) == 0x0005C8, "Member 'UW_Loading_Win_Tutorial_C::W_TextWidget' has a wrong offset!");

}

