#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LoadIcon

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LoadIcon.W_LoadIcon_C
// 0x00C0 (0x0568 - 0x04A8)
class UW_LoadIcon_C final : public UUILoadIcon
{
public:
	class UWidgetAnimation*                       Icon_off;                                          // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Icon_On;                                           // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BasePlate;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGBase;                                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharacterFace_Add_01;                              // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharacterFace_Add_02;                              // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ClearIcon;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DataBase;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DataBase_Line;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_97;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameBase;                                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Picture;                                           // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SaveIconBase;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadFacePanel_C*                     W_LoadFacePanel_0;                                 // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadFacePanel_C*                     W_LoadFacePanel_1;                                 // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadFacePanel_C*                     W_LoadFacePanel_2;                                 // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LoadFacePanel_C*                     W_LoadFacePanel_3;                                 // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_LoadIcon_C">();
	}
	static class UW_LoadIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LoadIcon_C>();
	}
};
static_assert(alignof(UW_LoadIcon_C) == 0x000008, "Wrong alignment on UW_LoadIcon_C");
static_assert(sizeof(UW_LoadIcon_C) == 0x000568, "Wrong size on UW_LoadIcon_C");
static_assert(offsetof(UW_LoadIcon_C, Icon_off) == 0x0004A8, "Member 'UW_LoadIcon_C::Icon_off' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, Icon_On) == 0x0004B0, "Member 'UW_LoadIcon_C::Icon_On' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, BasePlate) == 0x0004B8, "Member 'UW_LoadIcon_C::BasePlate' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, BGBase) == 0x0004C0, "Member 'UW_LoadIcon_C::BGBase' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, CharacterFace_Add_01) == 0x0004C8, "Member 'UW_LoadIcon_C::CharacterFace_Add_01' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, CharacterFace_Add_02) == 0x0004D0, "Member 'UW_LoadIcon_C::CharacterFace_Add_02' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, ClearIcon) == 0x0004D8, "Member 'UW_LoadIcon_C::ClearIcon' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, DataBase) == 0x0004E0, "Member 'UW_LoadIcon_C::DataBase' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, DataBase_Line) == 0x0004E8, "Member 'UW_LoadIcon_C::DataBase_Line' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, Image) == 0x0004F0, "Member 'UW_LoadIcon_C::Image' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, Image_1) == 0x0004F8, "Member 'UW_LoadIcon_C::Image_1' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, Image_2) == 0x000500, "Member 'UW_LoadIcon_C::Image_2' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, Image_7) == 0x000508, "Member 'UW_LoadIcon_C::Image_7' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, Image_8) == 0x000510, "Member 'UW_LoadIcon_C::Image_8' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, Image_9) == 0x000518, "Member 'UW_LoadIcon_C::Image_9' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, Image_10) == 0x000520, "Member 'UW_LoadIcon_C::Image_10' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, Image_97) == 0x000528, "Member 'UW_LoadIcon_C::Image_97' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, NameBase) == 0x000530, "Member 'UW_LoadIcon_C::NameBase' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, Picture) == 0x000538, "Member 'UW_LoadIcon_C::Picture' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, SaveIconBase) == 0x000540, "Member 'UW_LoadIcon_C::SaveIconBase' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, W_LoadFacePanel_0) == 0x000548, "Member 'UW_LoadIcon_C::W_LoadFacePanel_0' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, W_LoadFacePanel_1) == 0x000550, "Member 'UW_LoadIcon_C::W_LoadFacePanel_1' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, W_LoadFacePanel_2) == 0x000558, "Member 'UW_LoadIcon_C::W_LoadFacePanel_2' has a wrong offset!");
static_assert(offsetof(UW_LoadIcon_C, W_LoadFacePanel_3) == 0x000560, "Member 'UW_LoadIcon_C::W_LoadFacePanel_3' has a wrong offset!");

}

