#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MainMenu_Setting

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MainMenu_Setting.W_MainMenu_Setting_C
// 0x0078 (0x05E0 - 0x0568)
class UW_MainMenu_Setting_C final : public UUIMainMenu_Button
{
public:
	class UWidgetAnimation*                       Disabled_Off;                                      // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disabled_On;                                       // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GrayOut_Off;                                       // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GrayOut_On;                                        // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       off;                                               // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BackPanel;                                         // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button;                                            // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corsor;                                            // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Corsor_add;                                        // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Disabled;                                          // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GoBaseIcon;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Out;                                               // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_MainMenu_Setting_C">();
	}
	static class UW_MainMenu_Setting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MainMenu_Setting_C>();
	}
};
static_assert(alignof(UW_MainMenu_Setting_C) == 0x000008, "Wrong alignment on UW_MainMenu_Setting_C");
static_assert(sizeof(UW_MainMenu_Setting_C) == 0x0005E0, "Wrong size on UW_MainMenu_Setting_C");
static_assert(offsetof(UW_MainMenu_Setting_C, Disabled_Off) == 0x000568, "Member 'UW_MainMenu_Setting_C::Disabled_Off' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, Disabled_On) == 0x000570, "Member 'UW_MainMenu_Setting_C::Disabled_On' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, GrayOut_Off) == 0x000578, "Member 'UW_MainMenu_Setting_C::GrayOut_Off' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, GrayOut_On) == 0x000580, "Member 'UW_MainMenu_Setting_C::GrayOut_On' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, Wait) == 0x000588, "Member 'UW_MainMenu_Setting_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, off) == 0x000590, "Member 'UW_MainMenu_Setting_C::off' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, on) == 0x000598, "Member 'UW_MainMenu_Setting_C::on' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, BackPanel) == 0x0005A0, "Member 'UW_MainMenu_Setting_C::BackPanel' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, Button) == 0x0005A8, "Member 'UW_MainMenu_Setting_C::Button' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, Corsor) == 0x0005B0, "Member 'UW_MainMenu_Setting_C::Corsor' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, Corsor_add) == 0x0005B8, "Member 'UW_MainMenu_Setting_C::Corsor_add' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, Disabled) == 0x0005C0, "Member 'UW_MainMenu_Setting_C::Disabled' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, GoBaseIcon) == 0x0005C8, "Member 'UW_MainMenu_Setting_C::GoBaseIcon' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, Icon) == 0x0005D0, "Member 'UW_MainMenu_Setting_C::Icon' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Setting_C, Out) == 0x0005D8, "Member 'UW_MainMenu_Setting_C::Out' has a wrong offset!");

}

