#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MainMenu_Gauge_00

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MainMenu_Gauge_00.W_MainMenu_Gauge_00_C
// 0x0018 (0x0508 - 0x04F0)
class UW_MainMenu_Gauge_00_C final : public UUIGaugeBase
{
public:
	class UWidgetAnimation*                       GaugeMove;                                         // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base;                                              // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gauge;                                             // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_MainMenu_Gauge_00_C">();
	}
	static class UW_MainMenu_Gauge_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MainMenu_Gauge_00_C>();
	}
};
static_assert(alignof(UW_MainMenu_Gauge_00_C) == 0x000008, "Wrong alignment on UW_MainMenu_Gauge_00_C");
static_assert(sizeof(UW_MainMenu_Gauge_00_C) == 0x000508, "Wrong size on UW_MainMenu_Gauge_00_C");
static_assert(offsetof(UW_MainMenu_Gauge_00_C, GaugeMove) == 0x0004F0, "Member 'UW_MainMenu_Gauge_00_C::GaugeMove' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Gauge_00_C, Base) == 0x0004F8, "Member 'UW_MainMenu_Gauge_00_C::Base' has a wrong offset!");
static_assert(offsetof(UW_MainMenu_Gauge_00_C, Gauge) == 0x000500, "Member 'UW_MainMenu_Gauge_00_C::Gauge' has a wrong offset!");

}

