#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Menu_WinSort

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Menu_WinSort.W_Menu_WinSort_C
// 0x0088 (0x06C0 - 0x0638)
class UW_Menu_WinSort_C final : public UUIMenu_WinSort
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Button_2;                                          // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Button_3;                                          // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Button_4;                                          // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_188;                                         // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 line;                                              // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BG_Black_C*                          W_BG_Black;                                        // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_IconChoice_C*                        W_IconChoice_01;                                   // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Itemmenu_SortIconChoice_C*           W_Itemmenu_SortIconChoice_01;                      // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Itemmenu_SortIconChoice_C*           W_Itemmenu_SortIconChoice_02;                      // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Itemmenu_SortIconChoice_C*           W_Itemmenu_SortIconChoice_03;                      // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Itemmenu_SortIconChoice_C*           W_Itemmenu_SortIconChoice_04;                      // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBase;                                        // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Menu_WinSort(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Menu_WinSort_C">();
	}
	static class UW_Menu_WinSort_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Menu_WinSort_C>();
	}
};
static_assert(alignof(UW_Menu_WinSort_C) == 0x000008, "Wrong alignment on UW_Menu_WinSort_C");
static_assert(sizeof(UW_Menu_WinSort_C) == 0x0006C0, "Wrong size on UW_Menu_WinSort_C");
static_assert(offsetof(UW_Menu_WinSort_C, UberGraphFrame) == 0x000638, "Member 'UW_Menu_WinSort_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, Button_2) == 0x000640, "Member 'UW_Menu_WinSort_C::Button_2' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, Button_3) == 0x000648, "Member 'UW_Menu_WinSort_C::Button_3' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, Button_4) == 0x000650, "Member 'UW_Menu_WinSort_C::Button_4' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, Out) == 0x000658, "Member 'UW_Menu_WinSort_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, In) == 0x000660, "Member 'UW_Menu_WinSort_C::In' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, Image_2) == 0x000668, "Member 'UW_Menu_WinSort_C::Image_2' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, Image_188) == 0x000670, "Member 'UW_Menu_WinSort_C::Image_188' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, line) == 0x000678, "Member 'UW_Menu_WinSort_C::line' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, W_BG_Black) == 0x000680, "Member 'UW_Menu_WinSort_C::W_BG_Black' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, W_IconChoice_01) == 0x000688, "Member 'UW_Menu_WinSort_C::W_IconChoice_01' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, W_Itemmenu_SortIconChoice_01) == 0x000690, "Member 'UW_Menu_WinSort_C::W_Itemmenu_SortIconChoice_01' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, W_Itemmenu_SortIconChoice_02) == 0x000698, "Member 'UW_Menu_WinSort_C::W_Itemmenu_SortIconChoice_02' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, W_Itemmenu_SortIconChoice_03) == 0x0006A0, "Member 'UW_Menu_WinSort_C::W_Itemmenu_SortIconChoice_03' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, W_Itemmenu_SortIconChoice_04) == 0x0006A8, "Member 'UW_Menu_WinSort_C::W_Itemmenu_SortIconChoice_04' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, W_Menu_IconArrow) == 0x0006B0, "Member 'UW_Menu_WinSort_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_Menu_WinSort_C, WindowBase) == 0x0006B8, "Member 'UW_Menu_WinSort_C::WindowBase' has a wrong offset!");

}

