#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Menu_IconDelta_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Menu_IconDelta_01.W_Menu_IconDelta_01_C
// 0x0028 (0x0520 - 0x04F8)
class UW_Menu_IconDelta_01_C final : public UUIStartLoopAnimation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Wait;                                              // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_Base;                                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Position;                                          // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEasingFunc                                   MoveEasingType;                                    // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x3];                                      // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EaseAlpha;                                         // 0x051C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Menu_IconDelta_01(int32 EntryPoint);
	void Update(float DeltaTime);
	void SetCursorPosition(const struct FVector2D& Pos);
	void UpdatePosition();
	struct FVector2D EasePositionLiner(const struct FVector2D& BeforePos, const struct FVector2D& AfterPos);
	void InitCursorPosition(const struct FVector2D& Pos);

	void GetCursorSlot(class UCanvasPanelSlot** CanvasSlot) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Menu_IconDelta_01_C">();
	}
	static class UW_Menu_IconDelta_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Menu_IconDelta_01_C>();
	}
};
static_assert(alignof(UW_Menu_IconDelta_01_C) == 0x000008, "Wrong alignment on UW_Menu_IconDelta_01_C");
static_assert(sizeof(UW_Menu_IconDelta_01_C) == 0x000520, "Wrong size on UW_Menu_IconDelta_01_C");
static_assert(offsetof(UW_Menu_IconDelta_01_C, UberGraphFrame) == 0x0004F8, "Member 'UW_Menu_IconDelta_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Menu_IconDelta_01_C, Wait) == 0x000500, "Member 'UW_Menu_IconDelta_01_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_Menu_IconDelta_01_C, Arrow_Base) == 0x000508, "Member 'UW_Menu_IconDelta_01_C::Arrow_Base' has a wrong offset!");
static_assert(offsetof(UW_Menu_IconDelta_01_C, Position) == 0x000510, "Member 'UW_Menu_IconDelta_01_C::Position' has a wrong offset!");
static_assert(offsetof(UW_Menu_IconDelta_01_C, MoveEasingType) == 0x000518, "Member 'UW_Menu_IconDelta_01_C::MoveEasingType' has a wrong offset!");
static_assert(offsetof(UW_Menu_IconDelta_01_C, EaseAlpha) == 0x00051C, "Member 'UW_Menu_IconDelta_01_C::EaseAlpha' has a wrong offset!");

}

