#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MemberPanel

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MemberPanel.W_MemberPanel_C
// 0x0110 (0x0698 - 0x0588)
class UW_MemberPanel_C final : public UUIMemberPanel
{
public:
	class UWidgetAnimation*                       Color_04;                                          // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color_03;                                          // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color_02;                                          // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Color_01;                                          // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Artifact_Off;                                      // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Artifact_On;                                       // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pos_Reset;                                         // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Dead;                                              // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LIVE;                                              // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       off;                                               // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_shadow;                                         // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Black_Panel;                                       // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDarwinTwoSceneCaptureImage*            Character_CaptureImage;                            // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Coffin;                                            // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_Base;                                       // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_Base_1;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Front_01;                                          // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Front_02;                                          // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MainMenu_Gauge_00_C*                 HPGauge;                                           // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgGlutIcon;                                       // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MainMenu_GlutGauge_C*                MainMenu_GlutGauge;                                // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MainMenu_Gauge_00_C*                 MpGauge;                                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NamePlate_1;                                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NamePlate_2;                                       // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NamePlate_3;                                       // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NamePlate_4;                                       // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ArtifactList_ArtifactIcon_C*         TreasureList_TreasureIcon_01;                      // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ArtifactList_ArtifactIcon_C*         TreasureList_TreasureIcon_02;                      // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ArtifactList_ArtifactIcon_C*         TreasureList_TreasureIcon_03;                      // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ArtifactList_ArtifactIcon_C*         TreasureList_TreasureIcon_04;                      // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ArtifactList_ArtifactIcon_C*         TreasureList_TreasureIcon_05;                      // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_MemberPanel_C">();
	}
	static class UW_MemberPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MemberPanel_C>();
	}
};
static_assert(alignof(UW_MemberPanel_C) == 0x000008, "Wrong alignment on UW_MemberPanel_C");
static_assert(sizeof(UW_MemberPanel_C) == 0x000698, "Wrong size on UW_MemberPanel_C");
static_assert(offsetof(UW_MemberPanel_C, Color_04) == 0x000588, "Member 'UW_MemberPanel_C::Color_04' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Color_03) == 0x000590, "Member 'UW_MemberPanel_C::Color_03' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Color_02) == 0x000598, "Member 'UW_MemberPanel_C::Color_02' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Color_01) == 0x0005A0, "Member 'UW_MemberPanel_C::Color_01' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Artifact_Off) == 0x0005A8, "Member 'UW_MemberPanel_C::Artifact_Off' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Artifact_On) == 0x0005B0, "Member 'UW_MemberPanel_C::Artifact_On' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Pos_Reset) == 0x0005B8, "Member 'UW_MemberPanel_C::Pos_Reset' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Dead) == 0x0005C0, "Member 'UW_MemberPanel_C::Dead' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, LIVE) == 0x0005C8, "Member 'UW_MemberPanel_C::LIVE' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Wait) == 0x0005D0, "Member 'UW_MemberPanel_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, off) == 0x0005D8, "Member 'UW_MemberPanel_C::off' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, on) == 0x0005E0, "Member 'UW_MemberPanel_C::on' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, BG) == 0x0005E8, "Member 'UW_MemberPanel_C::BG' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, BG_shadow) == 0x0005F0, "Member 'UW_MemberPanel_C::BG_shadow' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Black_Panel) == 0x0005F8, "Member 'UW_MemberPanel_C::Black_Panel' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Character_CaptureImage) == 0x000600, "Member 'UW_MemberPanel_C::Character_CaptureImage' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Coffin) == 0x000608, "Member 'UW_MemberPanel_C::Coffin' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Cursor_Base) == 0x000610, "Member 'UW_MemberPanel_C::Cursor_Base' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Cursor_Base_1) == 0x000618, "Member 'UW_MemberPanel_C::Cursor_Base_1' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Front_01) == 0x000620, "Member 'UW_MemberPanel_C::Front_01' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, Front_02) == 0x000628, "Member 'UW_MemberPanel_C::Front_02' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, HPGauge) == 0x000630, "Member 'UW_MemberPanel_C::HPGauge' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, ImgGlutIcon) == 0x000638, "Member 'UW_MemberPanel_C::ImgGlutIcon' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, MainMenu_GlutGauge) == 0x000640, "Member 'UW_MemberPanel_C::MainMenu_GlutGauge' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, MpGauge) == 0x000648, "Member 'UW_MemberPanel_C::MpGauge' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, NamePlate_1) == 0x000650, "Member 'UW_MemberPanel_C::NamePlate_1' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, NamePlate_2) == 0x000658, "Member 'UW_MemberPanel_C::NamePlate_2' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, NamePlate_3) == 0x000660, "Member 'UW_MemberPanel_C::NamePlate_3' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, NamePlate_4) == 0x000668, "Member 'UW_MemberPanel_C::NamePlate_4' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, TreasureList_TreasureIcon_01) == 0x000670, "Member 'UW_MemberPanel_C::TreasureList_TreasureIcon_01' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, TreasureList_TreasureIcon_02) == 0x000678, "Member 'UW_MemberPanel_C::TreasureList_TreasureIcon_02' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, TreasureList_TreasureIcon_03) == 0x000680, "Member 'UW_MemberPanel_C::TreasureList_TreasureIcon_03' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, TreasureList_TreasureIcon_04) == 0x000688, "Member 'UW_MemberPanel_C::TreasureList_TreasureIcon_04' has a wrong offset!");
static_assert(offsetof(UW_MemberPanel_C, TreasureList_TreasureIcon_05) == 0x000690, "Member 'UW_MemberPanel_C::TreasureList_TreasureIcon_05' has a wrong offset!");

}

