#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MonsterDict_Content_04

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MonsterDict_Content_04.W_MonsterDict_Content_04_C
// 0x0070 (0x0528 - 0x04B8)
class UW_MonsterDict_Content_04_C final : public UUIMonsterDict_Content_04
{
public:
	class UWidgetAnimation*                       TextHop_02;                                        // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TextHop_01;                                        // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Good_On_01;                                        // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       On_Text;                                           // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       On_Count;                                          // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       On_Treasure;                                       // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_Add_01;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Add_02;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Buymenu_DescriptionBase_02;                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ContentBase_1;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GoodIcon;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StateIcon;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleIcon;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Good_StateIcon_C*                    W_Good_StateIcon;                                  // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_MonsterDict_Content_04_C">();
	}
	static class UW_MonsterDict_Content_04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MonsterDict_Content_04_C>();
	}
};
static_assert(alignof(UW_MonsterDict_Content_04_C) == 0x000008, "Wrong alignment on UW_MonsterDict_Content_04_C");
static_assert(sizeof(UW_MonsterDict_Content_04_C) == 0x000528, "Wrong size on UW_MonsterDict_Content_04_C");
static_assert(offsetof(UW_MonsterDict_Content_04_C, TextHop_02) == 0x0004B8, "Member 'UW_MonsterDict_Content_04_C::TextHop_02' has a wrong offset!");
static_assert(offsetof(UW_MonsterDict_Content_04_C, TextHop_01) == 0x0004C0, "Member 'UW_MonsterDict_Content_04_C::TextHop_01' has a wrong offset!");
static_assert(offsetof(UW_MonsterDict_Content_04_C, Good_On_01) == 0x0004C8, "Member 'UW_MonsterDict_Content_04_C::Good_On_01' has a wrong offset!");
static_assert(offsetof(UW_MonsterDict_Content_04_C, On_Text) == 0x0004D0, "Member 'UW_MonsterDict_Content_04_C::On_Text' has a wrong offset!");
static_assert(offsetof(UW_MonsterDict_Content_04_C, On_Count) == 0x0004D8, "Member 'UW_MonsterDict_Content_04_C::On_Count' has a wrong offset!");
static_assert(offsetof(UW_MonsterDict_Content_04_C, On_Treasure) == 0x0004E0, "Member 'UW_MonsterDict_Content_04_C::On_Treasure' has a wrong offset!");
static_assert(offsetof(UW_MonsterDict_Content_04_C, Base_Add_01) == 0x0004E8, "Member 'UW_MonsterDict_Content_04_C::Base_Add_01' has a wrong offset!");
static_assert(offsetof(UW_MonsterDict_Content_04_C, Base_Add_02) == 0x0004F0, "Member 'UW_MonsterDict_Content_04_C::Base_Add_02' has a wrong offset!");
static_assert(offsetof(UW_MonsterDict_Content_04_C, Buymenu_DescriptionBase_02) == 0x0004F8, "Member 'UW_MonsterDict_Content_04_C::Buymenu_DescriptionBase_02' has a wrong offset!");
static_assert(offsetof(UW_MonsterDict_Content_04_C, ContentBase_1) == 0x000500, "Member 'UW_MonsterDict_Content_04_C::ContentBase_1' has a wrong offset!");
static_assert(offsetof(UW_MonsterDict_Content_04_C, GoodIcon) == 0x000508, "Member 'UW_MonsterDict_Content_04_C::GoodIcon' has a wrong offset!");
static_assert(offsetof(UW_MonsterDict_Content_04_C, StateIcon) == 0x000510, "Member 'UW_MonsterDict_Content_04_C::StateIcon' has a wrong offset!");
static_assert(offsetof(UW_MonsterDict_Content_04_C, TitleIcon) == 0x000518, "Member 'UW_MonsterDict_Content_04_C::TitleIcon' has a wrong offset!");
static_assert(offsetof(UW_MonsterDict_Content_04_C, W_Good_StateIcon) == 0x000520, "Member 'UW_MonsterDict_Content_04_C::W_Good_StateIcon' has a wrong offset!");

}

