#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MovieScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_MovieScreen.W_MovieScreen_C.SetMovieTexture
// 0x0008 (0x0008 - 0x0000)
struct W_MovieScreen_C_SetMovieTexture final
{
public:
	class UManaTexture*                           MovieTexture;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MovieScreen_C_SetMovieTexture) == 0x000008, "Wrong alignment on W_MovieScreen_C_SetMovieTexture");
static_assert(sizeof(W_MovieScreen_C_SetMovieTexture) == 0x000008, "Wrong size on W_MovieScreen_C_SetMovieTexture");
static_assert(offsetof(W_MovieScreen_C_SetMovieTexture, MovieTexture) == 0x000000, "Member 'W_MovieScreen_C_SetMovieTexture::MovieTexture' has a wrong offset!");

// Function W_MovieScreen.W_MovieScreen_C.ExecuteUbergraph_W_MovieScreen
// 0x0098 (0x0098 - 0x0000)
struct W_MovieScreen_C_ExecuteUbergraph_W_MovieScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UManaTexture*                           K2Node_Event_MovieTexture;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x0088)()
};
static_assert(alignof(W_MovieScreen_C_ExecuteUbergraph_W_MovieScreen) == 0x000008, "Wrong alignment on W_MovieScreen_C_ExecuteUbergraph_W_MovieScreen");
static_assert(sizeof(W_MovieScreen_C_ExecuteUbergraph_W_MovieScreen) == 0x000098, "Wrong size on W_MovieScreen_C_ExecuteUbergraph_W_MovieScreen");
static_assert(offsetof(W_MovieScreen_C_ExecuteUbergraph_W_MovieScreen, EntryPoint) == 0x000000, "Member 'W_MovieScreen_C_ExecuteUbergraph_W_MovieScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_MovieScreen_C_ExecuteUbergraph_W_MovieScreen, K2Node_Event_MovieTexture) == 0x000008, "Member 'W_MovieScreen_C_ExecuteUbergraph_W_MovieScreen::K2Node_Event_MovieTexture' has a wrong offset!");
static_assert(offsetof(W_MovieScreen_C_ExecuteUbergraph_W_MovieScreen, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'W_MovieScreen_C_ExecuteUbergraph_W_MovieScreen::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

}

