#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_NetWork_Connecting

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_NetWork_Connecting.W_NetWork_Connecting_C
// 0x0020 (0x04D0 - 0x04B0)
class UW_NetWork_Connecting_C final : public UUINetworkConnection
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BK;                                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Network_SignalIcon_C*                W_Network_SignalIcon;                              // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_NetWork_Connecting_C">();
	}
	static class UW_NetWork_Connecting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_NetWork_Connecting_C>();
	}
};
static_assert(alignof(UW_NetWork_Connecting_C) == 0x000008, "Wrong alignment on UW_NetWork_Connecting_C");
static_assert(sizeof(UW_NetWork_Connecting_C) == 0x0004D0, "Wrong size on UW_NetWork_Connecting_C");
static_assert(offsetof(UW_NetWork_Connecting_C, Out) == 0x0004B0, "Member 'UW_NetWork_Connecting_C::Out' has a wrong offset!");
static_assert(offsetof(UW_NetWork_Connecting_C, In) == 0x0004B8, "Member 'UW_NetWork_Connecting_C::In' has a wrong offset!");
static_assert(offsetof(UW_NetWork_Connecting_C, BK) == 0x0004C0, "Member 'UW_NetWork_Connecting_C::BK' has a wrong offset!");
static_assert(offsetof(UW_NetWork_Connecting_C, W_Network_SignalIcon) == 0x0004C8, "Member 'UW_NetWork_Connecting_C::W_Network_SignalIcon' has a wrong offset!");

}

