#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OptionScreen_PC_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OptionScreen_PC_01.W_OptionScreen_PC_01_C
// 0x00C0 (0x07D8 - 0x0718)
class UW_OptionScreen_PC_01_C final : public UUIOptionScreenPC
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0718(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0720(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 PM_ListBG;                                         // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar;                                         // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar_Base;                                    // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_10;                                 // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_11;                                 // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_12;                                 // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_13;                                 // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_14;                                 // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_15;                                 // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_16;                                 // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_17;                                 // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_18;                                 // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_01;                                 // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_02;                                 // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_03;                                 // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_04;                                 // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_05;                                 // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_06;                                 // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_07;                                 // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_08;                                 // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Option_01_C*                   W_Panel_Option_09;                                 // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_OptionScreen_PC_01_C">();
	}
	static class UW_OptionScreen_PC_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_OptionScreen_PC_01_C>();
	}
};
static_assert(alignof(UW_OptionScreen_PC_01_C) == 0x000008, "Wrong alignment on UW_OptionScreen_PC_01_C");
static_assert(sizeof(UW_OptionScreen_PC_01_C) == 0x0007D8, "Wrong size on UW_OptionScreen_PC_01_C");
static_assert(offsetof(UW_OptionScreen_PC_01_C, Out) == 0x000718, "Member 'UW_OptionScreen_PC_01_C::Out' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, In) == 0x000720, "Member 'UW_OptionScreen_PC_01_C::In' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, PM_ListBG) == 0x000728, "Member 'UW_OptionScreen_PC_01_C::PM_ListBG' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, ScrollBar) == 0x000730, "Member 'UW_OptionScreen_PC_01_C::ScrollBar' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, ScrollBar_Base) == 0x000738, "Member 'UW_OptionScreen_PC_01_C::ScrollBar_Base' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Menu_IconArrow) == 0x000740, "Member 'UW_OptionScreen_PC_01_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_10) == 0x000748, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_10' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_11) == 0x000750, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_11' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_12) == 0x000758, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_12' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_13) == 0x000760, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_13' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_14) == 0x000768, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_14' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_15) == 0x000770, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_15' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_16) == 0x000778, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_16' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_17) == 0x000780, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_17' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_18) == 0x000788, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_18' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_01) == 0x000790, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_01' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_02) == 0x000798, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_02' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_03) == 0x0007A0, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_03' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_04) == 0x0007A8, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_04' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_05) == 0x0007B0, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_05' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_06) == 0x0007B8, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_06' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_07) == 0x0007C0, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_07' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_08) == 0x0007C8, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_08' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_PC_01_C, W_Panel_Option_09) == 0x0007D0, "Member 'UW_OptionScreen_PC_01_C::W_Panel_Option_09' has a wrong offset!");

}

