#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OptionBrightness

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OptionBrightness.W_OptionBrightness_C
// 0x0030 (0x0678 - 0x0648)
class UW_OptionBrightness_C final : public UUIWinBrightness
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_01;                                             // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PM_ListBG;                                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Volume_02_C*                         W_Volume_D01;                                      // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_OptionBrightness_C">();
	}
	static class UW_OptionBrightness_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_OptionBrightness_C>();
	}
};
static_assert(alignof(UW_OptionBrightness_C) == 0x000008, "Wrong alignment on UW_OptionBrightness_C");
static_assert(sizeof(UW_OptionBrightness_C) == 0x000678, "Wrong size on UW_OptionBrightness_C");
static_assert(offsetof(UW_OptionBrightness_C, Out) == 0x000648, "Member 'UW_OptionBrightness_C::Out' has a wrong offset!");
static_assert(offsetof(UW_OptionBrightness_C, In) == 0x000650, "Member 'UW_OptionBrightness_C::In' has a wrong offset!");
static_assert(offsetof(UW_OptionBrightness_C, BG_01) == 0x000658, "Member 'UW_OptionBrightness_C::BG_01' has a wrong offset!");
static_assert(offsetof(UW_OptionBrightness_C, PM_ListBG) == 0x000660, "Member 'UW_OptionBrightness_C::PM_ListBG' has a wrong offset!");
static_assert(offsetof(UW_OptionBrightness_C, W_Menu_IconArrow) == 0x000668, "Member 'UW_OptionBrightness_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_OptionBrightness_C, W_Volume_D01) == 0x000670, "Member 'UW_OptionBrightness_C::W_Volume_D01' has a wrong offset!");

}

