#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OptionScreen

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_OptionScreen.W_OptionScreen_C
// 0x0080 (0x06A8 - 0x0628)
class UW_OptionScreen_C final : public UUIOptionScreen
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Commonmenu_WinLine_A;                              // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Commonmenu_WinLine_B;                              // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Commonmenu_WinLine_C;                              // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Commonmenu_WinLine_D;                              // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PM_ListBG;                                         // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_OptionChoiceBase_00_C*    W_Commonmenu_OptionChoiceBase_00_A01;              // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_OptionChoiceBase_00_C*    W_Commonmenu_OptionChoiceBase_00_A02;              // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_OptionChoiceBase_00_C*    W_Commonmenu_OptionChoiceBase_00_B01;              // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_OptionChoiceBase_00_C*    W_Commonmenu_OptionChoiceBase_00_B02;              // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_OptionChoiceBase_00_C*    W_Commonmenu_OptionChoiceBase_00_C01;              // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_OptionChoiceBase_00_C*    W_Commonmenu_OptionChoiceBase_00_C02;              // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Volume_01_C*                         W_Volume_D01;                                      // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Volume_01_C*                         W_Volume_E01;                                      // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_OptionScreen_C">();
	}
	static class UW_OptionScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_OptionScreen_C>();
	}
};
static_assert(alignof(UW_OptionScreen_C) == 0x000008, "Wrong alignment on UW_OptionScreen_C");
static_assert(sizeof(UW_OptionScreen_C) == 0x0006A8, "Wrong size on UW_OptionScreen_C");
static_assert(offsetof(UW_OptionScreen_C, Out) == 0x000628, "Member 'UW_OptionScreen_C::Out' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, In) == 0x000630, "Member 'UW_OptionScreen_C::In' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, Commonmenu_WinLine_A) == 0x000638, "Member 'UW_OptionScreen_C::Commonmenu_WinLine_A' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, Commonmenu_WinLine_B) == 0x000640, "Member 'UW_OptionScreen_C::Commonmenu_WinLine_B' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, Commonmenu_WinLine_C) == 0x000648, "Member 'UW_OptionScreen_C::Commonmenu_WinLine_C' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, Commonmenu_WinLine_D) == 0x000650, "Member 'UW_OptionScreen_C::Commonmenu_WinLine_D' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, PM_ListBG) == 0x000658, "Member 'UW_OptionScreen_C::PM_ListBG' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, W_Commonmenu_OptionChoiceBase_00_A01) == 0x000660, "Member 'UW_OptionScreen_C::W_Commonmenu_OptionChoiceBase_00_A01' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, W_Commonmenu_OptionChoiceBase_00_A02) == 0x000668, "Member 'UW_OptionScreen_C::W_Commonmenu_OptionChoiceBase_00_A02' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, W_Commonmenu_OptionChoiceBase_00_B01) == 0x000670, "Member 'UW_OptionScreen_C::W_Commonmenu_OptionChoiceBase_00_B01' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, W_Commonmenu_OptionChoiceBase_00_B02) == 0x000678, "Member 'UW_OptionScreen_C::W_Commonmenu_OptionChoiceBase_00_B02' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, W_Commonmenu_OptionChoiceBase_00_C01) == 0x000680, "Member 'UW_OptionScreen_C::W_Commonmenu_OptionChoiceBase_00_C01' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, W_Commonmenu_OptionChoiceBase_00_C02) == 0x000688, "Member 'UW_OptionScreen_C::W_Commonmenu_OptionChoiceBase_00_C02' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, W_Menu_IconArrow) == 0x000690, "Member 'UW_OptionScreen_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, W_Volume_D01) == 0x000698, "Member 'UW_OptionScreen_C::W_Volume_D01' has a wrong offset!");
static_assert(offsetof(UW_OptionScreen_C, W_Volume_E01) == 0x0006A0, "Member 'UW_OptionScreen_C::W_Volume_E01' has a wrong offset!");

}

