#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PartyMenu_Top

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PartyMenu_Top.W_PartyMenu_Top_C
// 0x0070 (0x05C0 - 0x0550)
class UW_PartyMenu_Top_C final : public UUIPartyMenu_Top
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       In_2ndPanel;                                       // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_LeftMenu_2_C*                        W_LeftMenu;                                        // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PartyMenu_BG_C*                      W_PartyMenu_BG;                                    // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PartyMenu_Tsuyosa_C*                 W_PartyMenu_Tsuyosa;                               // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PMR_Page_00_C*                       W_PMR_Page_00;                                     // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PMR_Page_01_C*                       W_PMR_Page_01;                                     // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PMR_Page_02_C*                       W_PMR_Page_02;                                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PMR_Page_03_C*                       W_PMR_Page_03;                                     // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PMR_Page_04_C*                       W_PMR_Page_04;                                     // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TopBar_00_C*                         W_TopBar_00;                                       // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Under_Button_C*                      W_Under_Button;                                    // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_PartyMenu_Top(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PartyMenu_Top_C">();
	}
	static class UW_PartyMenu_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PartyMenu_Top_C>();
	}
};
static_assert(alignof(UW_PartyMenu_Top_C) == 0x000008, "Wrong alignment on UW_PartyMenu_Top_C");
static_assert(sizeof(UW_PartyMenu_Top_C) == 0x0005C0, "Wrong size on UW_PartyMenu_Top_C");
static_assert(offsetof(UW_PartyMenu_Top_C, UberGraphFrame) == 0x000550, "Member 'UW_PartyMenu_Top_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Top_C, In_2ndPanel) == 0x000558, "Member 'UW_PartyMenu_Top_C::In_2ndPanel' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Top_C, Out) == 0x000560, "Member 'UW_PartyMenu_Top_C::Out' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Top_C, In) == 0x000568, "Member 'UW_PartyMenu_Top_C::In' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Top_C, W_LeftMenu) == 0x000570, "Member 'UW_PartyMenu_Top_C::W_LeftMenu' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Top_C, W_PartyMenu_BG) == 0x000578, "Member 'UW_PartyMenu_Top_C::W_PartyMenu_BG' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Top_C, W_PartyMenu_Tsuyosa) == 0x000580, "Member 'UW_PartyMenu_Top_C::W_PartyMenu_Tsuyosa' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Top_C, W_PMR_Page_00) == 0x000588, "Member 'UW_PartyMenu_Top_C::W_PMR_Page_00' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Top_C, W_PMR_Page_01) == 0x000590, "Member 'UW_PartyMenu_Top_C::W_PMR_Page_01' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Top_C, W_PMR_Page_02) == 0x000598, "Member 'UW_PartyMenu_Top_C::W_PMR_Page_02' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Top_C, W_PMR_Page_03) == 0x0005A0, "Member 'UW_PartyMenu_Top_C::W_PMR_Page_03' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Top_C, W_PMR_Page_04) == 0x0005A8, "Member 'UW_PartyMenu_Top_C::W_PMR_Page_04' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Top_C, W_TopBar_00) == 0x0005B0, "Member 'UW_PartyMenu_Top_C::W_TopBar_00' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Top_C, W_Under_Button) == 0x0005B8, "Member 'UW_PartyMenu_Top_C::W_Under_Button' has a wrong offset!");

}

