#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Page_CoinAbility

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Page_CoinAbility.W_Page_CoinAbility_C
// 0x0108 (0x0748 - 0x0640)
class UW_Page_CoinAbility_C final : public UUIPage_CoinAbility
{
public:
	class UWidgetAnimation*                       Empty_On;                                          // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Empty_Off;                                         // 0x0648(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CoinMenu;                                          // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Edit;                                              // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar;                                         // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar_Base;                                    // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Template;                                          // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_10;                            // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_11;                            // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_12;                            // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_13;                            // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_14;                            // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_15;                            // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_16;                            // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_17;                            // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_18;                            // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_19;                            // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_20;                            // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_21;                            // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_01;                            // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_02;                            // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_03;                            // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_04;                            // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_05;                            // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_06;                            // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_07;                            // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_08;                            // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_CoinAbility_C*                 W_Panel_CoinAbility_09;                            // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Page_CoinAbility_C">();
	}
	static class UW_Page_CoinAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Page_CoinAbility_C>();
	}
};
static_assert(alignof(UW_Page_CoinAbility_C) == 0x000008, "Wrong alignment on UW_Page_CoinAbility_C");
static_assert(sizeof(UW_Page_CoinAbility_C) == 0x000748, "Wrong size on UW_Page_CoinAbility_C");
static_assert(offsetof(UW_Page_CoinAbility_C, Empty_On) == 0x000640, "Member 'UW_Page_CoinAbility_C::Empty_On' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, Empty_Off) == 0x000648, "Member 'UW_Page_CoinAbility_C::Empty_Off' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, CoinMenu) == 0x000650, "Member 'UW_Page_CoinAbility_C::CoinMenu' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, Edit) == 0x000658, "Member 'UW_Page_CoinAbility_C::Edit' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, Out) == 0x000660, "Member 'UW_Page_CoinAbility_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, In) == 0x000668, "Member 'UW_Page_CoinAbility_C::In' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, Image_0) == 0x000670, "Member 'UW_Page_CoinAbility_C::Image_0' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, Image_1) == 0x000678, "Member 'UW_Page_CoinAbility_C::Image_1' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, ScrollBar) == 0x000680, "Member 'UW_Page_CoinAbility_C::ScrollBar' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, ScrollBar_Base) == 0x000688, "Member 'UW_Page_CoinAbility_C::ScrollBar_Base' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, Template) == 0x000690, "Member 'UW_Page_CoinAbility_C::Template' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Menu_IconArrow) == 0x000698, "Member 'UW_Page_CoinAbility_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_10) == 0x0006A0, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_10' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_11) == 0x0006A8, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_11' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_12) == 0x0006B0, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_12' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_13) == 0x0006B8, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_13' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_14) == 0x0006C0, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_14' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_15) == 0x0006C8, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_15' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_16) == 0x0006D0, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_16' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_17) == 0x0006D8, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_17' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_18) == 0x0006E0, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_18' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_19) == 0x0006E8, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_19' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_20) == 0x0006F0, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_20' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_21) == 0x0006F8, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_21' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_01) == 0x000700, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_01' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_02) == 0x000708, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_02' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_03) == 0x000710, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_03' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_04) == 0x000718, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_04' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_05) == 0x000720, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_05' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_06) == 0x000728, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_06' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_07) == 0x000730, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_07' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_08) == 0x000738, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_08' has a wrong offset!");
static_assert(offsetof(UW_Page_CoinAbility_C, W_Panel_CoinAbility_09) == 0x000740, "Member 'UW_Page_CoinAbility_C::W_Panel_CoinAbility_09' has a wrong offset!");

}

