#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PartyMenu_BG

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PartyMenu_BG.W_PartyMenu_BG_C
// 0x0048 (0x04E8 - 0x04A0)
class UW_PartyMenu_BG_C final : public UUIPartyMenu_BG
{
public:
	class UWidgetAnimation*                       Blur_Off;                                          // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Blur_On;                                           // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Status;                                            // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Tsuyosa;                                           // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_1;                                              // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_2;                                              // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG1;                                               // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PartyMenu_BG_C">();
	}
	static class UW_PartyMenu_BG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PartyMenu_BG_C>();
	}
};
static_assert(alignof(UW_PartyMenu_BG_C) == 0x000008, "Wrong alignment on UW_PartyMenu_BG_C");
static_assert(sizeof(UW_PartyMenu_BG_C) == 0x0004E8, "Wrong size on UW_PartyMenu_BG_C");
static_assert(offsetof(UW_PartyMenu_BG_C, Blur_Off) == 0x0004A0, "Member 'UW_PartyMenu_BG_C::Blur_Off' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_BG_C, Blur_On) == 0x0004A8, "Member 'UW_PartyMenu_BG_C::Blur_On' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_BG_C, Status) == 0x0004B0, "Member 'UW_PartyMenu_BG_C::Status' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_BG_C, Tsuyosa) == 0x0004B8, "Member 'UW_PartyMenu_BG_C::Tsuyosa' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_BG_C, Out) == 0x0004C0, "Member 'UW_PartyMenu_BG_C::Out' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_BG_C, In) == 0x0004C8, "Member 'UW_PartyMenu_BG_C::In' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_BG_C, BG_1) == 0x0004D0, "Member 'UW_PartyMenu_BG_C::BG_1' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_BG_C, BG_2) == 0x0004D8, "Member 'UW_PartyMenu_BG_C::BG_2' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_BG_C, BG1) == 0x0004E0, "Member 'UW_PartyMenu_BG_C::BG1' has a wrong offset!");

}

