#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Page_Strength

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Page_Strength.W_Page_Strength_C
// 0x0088 (0x0708 - 0x0680)
class UW_Page_Strength_C final : public UUIPartyMenu_PMR_Page_12
{
public:
	class UWidgetAnimation*                       Disp_HideEffect;                                   // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disp_Normal;                                       // 0x0688(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CoinMenu;                                          // 0x0690(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PartyMenu;                                         // 0x0698(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x06A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x06A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar;                                         // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar_Base;                                    // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Template;                                          // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Strength_C*                    W_Panel_Strength_01;                               // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Strength_C*                    W_Panel_Strength_02;                               // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Strength_C*                    W_Panel_Strength_03;                               // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Strength_C*                    W_Panel_Strength_04;                               // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Strength_C*                    W_Panel_Strength_05;                               // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_Strength_C*                    W_Panel_Strength_06;                               // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Page_Strength_C">();
	}
	static class UW_Page_Strength_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Page_Strength_C>();
	}
};
static_assert(alignof(UW_Page_Strength_C) == 0x000008, "Wrong alignment on UW_Page_Strength_C");
static_assert(sizeof(UW_Page_Strength_C) == 0x000708, "Wrong size on UW_Page_Strength_C");
static_assert(offsetof(UW_Page_Strength_C, Disp_HideEffect) == 0x000680, "Member 'UW_Page_Strength_C::Disp_HideEffect' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, Disp_Normal) == 0x000688, "Member 'UW_Page_Strength_C::Disp_Normal' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, CoinMenu) == 0x000690, "Member 'UW_Page_Strength_C::CoinMenu' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, PartyMenu) == 0x000698, "Member 'UW_Page_Strength_C::PartyMenu' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, Out) == 0x0006A0, "Member 'UW_Page_Strength_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, In) == 0x0006A8, "Member 'UW_Page_Strength_C::In' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, Image_0) == 0x0006B0, "Member 'UW_Page_Strength_C::Image_0' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, ScrollBar) == 0x0006B8, "Member 'UW_Page_Strength_C::ScrollBar' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, ScrollBar_Base) == 0x0006C0, "Member 'UW_Page_Strength_C::ScrollBar_Base' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, Template) == 0x0006C8, "Member 'UW_Page_Strength_C::Template' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, W_Menu_IconArrow) == 0x0006D0, "Member 'UW_Page_Strength_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, W_Panel_Strength_01) == 0x0006D8, "Member 'UW_Page_Strength_C::W_Panel_Strength_01' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, W_Panel_Strength_02) == 0x0006E0, "Member 'UW_Page_Strength_C::W_Panel_Strength_02' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, W_Panel_Strength_03) == 0x0006E8, "Member 'UW_Page_Strength_C::W_Panel_Strength_03' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, W_Panel_Strength_04) == 0x0006F0, "Member 'UW_Page_Strength_C::W_Panel_Strength_04' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, W_Panel_Strength_05) == 0x0006F8, "Member 'UW_Page_Strength_C::W_Panel_Strength_05' has a wrong offset!");
static_assert(offsetof(UW_Page_Strength_C, W_Panel_Strength_06) == 0x000700, "Member 'UW_Page_Strength_C::W_Panel_Strength_06' has a wrong offset!");

}

