#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Panel_Strength

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Panel_Strength.W_Panel_Strength_C
// 0x0038 (0x0570 - 0x0538)
class UW_Panel_Strength_C final : public UUIPartyMenu_PM_Panel_12
{
public:
	class UWidgetAnimation*                       off;                                               // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disp_HideEffect;                                   // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disp_Normal;                                       // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_Icon;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 line_1;                                            // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PM_CoinStates_03;                                  // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Icon_00_C*                        W_PM_Icon_00;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Panel_Strength_C">();
	}
	static class UW_Panel_Strength_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Panel_Strength_C>();
	}
};
static_assert(alignof(UW_Panel_Strength_C) == 0x000008, "Wrong alignment on UW_Panel_Strength_C");
static_assert(sizeof(UW_Panel_Strength_C) == 0x000570, "Wrong size on UW_Panel_Strength_C");
static_assert(offsetof(UW_Panel_Strength_C, off) == 0x000538, "Member 'UW_Panel_Strength_C::off' has a wrong offset!");
static_assert(offsetof(UW_Panel_Strength_C, Disp_HideEffect) == 0x000540, "Member 'UW_Panel_Strength_C::Disp_HideEffect' has a wrong offset!");
static_assert(offsetof(UW_Panel_Strength_C, Disp_Normal) == 0x000548, "Member 'UW_Panel_Strength_C::Disp_Normal' has a wrong offset!");
static_assert(offsetof(UW_Panel_Strength_C, Arrow_Icon) == 0x000550, "Member 'UW_Panel_Strength_C::Arrow_Icon' has a wrong offset!");
static_assert(offsetof(UW_Panel_Strength_C, line_1) == 0x000558, "Member 'UW_Panel_Strength_C::line_1' has a wrong offset!");
static_assert(offsetof(UW_Panel_Strength_C, PM_CoinStates_03) == 0x000560, "Member 'UW_Panel_Strength_C::PM_CoinStates_03' has a wrong offset!");
static_assert(offsetof(UW_Panel_Strength_C, W_PM_Icon_00) == 0x000568, "Member 'UW_Panel_Strength_C::W_PM_Icon_00' has a wrong offset!");

}

