#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PartyMenu_GlutGauge

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PartyMenu_GlutGauge.W_PartyMenu_GlutGauge_C
// 0x0080 (0x0538 - 0x04B8)
class UW_PartyMenu_GlutGauge_C final : public UUIGlutGaugeBase
{
public:
	class UWidgetAnimation*                       Type_06;                                           // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Type_05;                                           // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Type_04;                                           // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Type_03;                                           // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Type_02;                                           // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Type_01;                                           // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_1C;                                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PartyMenu_GlutGauge_100_C*           Base_1C_Gauge;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_1L;                                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PartyMenu_GlutGauge_100_C*           Base_1L_Gauge;                                     // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_1R;                                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PartyMenu_GlutGauge_100_C*           Base_1R_Gauge;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_2L;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PartyMenu_GlutGauge_101_C*           Base_2L_Gauge;                                     // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_2R;                                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PartyMenu_GlutGauge_101_C*           Base_2R_Gauge;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PartyMenu_GlutGauge_C">();
	}
	static class UW_PartyMenu_GlutGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PartyMenu_GlutGauge_C>();
	}
};
static_assert(alignof(UW_PartyMenu_GlutGauge_C) == 0x000008, "Wrong alignment on UW_PartyMenu_GlutGauge_C");
static_assert(sizeof(UW_PartyMenu_GlutGauge_C) == 0x000538, "Wrong size on UW_PartyMenu_GlutGauge_C");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Type_06) == 0x0004B8, "Member 'UW_PartyMenu_GlutGauge_C::Type_06' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Type_05) == 0x0004C0, "Member 'UW_PartyMenu_GlutGauge_C::Type_05' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Type_04) == 0x0004C8, "Member 'UW_PartyMenu_GlutGauge_C::Type_04' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Type_03) == 0x0004D0, "Member 'UW_PartyMenu_GlutGauge_C::Type_03' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Type_02) == 0x0004D8, "Member 'UW_PartyMenu_GlutGauge_C::Type_02' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Type_01) == 0x0004E0, "Member 'UW_PartyMenu_GlutGauge_C::Type_01' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Base_1C) == 0x0004E8, "Member 'UW_PartyMenu_GlutGauge_C::Base_1C' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Base_1C_Gauge) == 0x0004F0, "Member 'UW_PartyMenu_GlutGauge_C::Base_1C_Gauge' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Base_1L) == 0x0004F8, "Member 'UW_PartyMenu_GlutGauge_C::Base_1L' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Base_1L_Gauge) == 0x000500, "Member 'UW_PartyMenu_GlutGauge_C::Base_1L_Gauge' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Base_1R) == 0x000508, "Member 'UW_PartyMenu_GlutGauge_C::Base_1R' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Base_1R_Gauge) == 0x000510, "Member 'UW_PartyMenu_GlutGauge_C::Base_1R_Gauge' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Base_2L) == 0x000518, "Member 'UW_PartyMenu_GlutGauge_C::Base_2L' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Base_2L_Gauge) == 0x000520, "Member 'UW_PartyMenu_GlutGauge_C::Base_2L_Gauge' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Base_2R) == 0x000528, "Member 'UW_PartyMenu_GlutGauge_C::Base_2R' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_GlutGauge_C, Base_2R_Gauge) == 0x000530, "Member 'UW_PartyMenu_GlutGauge_C::Base_2R_Gauge' has a wrong offset!");

}

