#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Panel_Option_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Panel_Option_01.W_Panel_Option_01_C
// 0x00A8 (0x0640 - 0x0598)
class UW_Panel_Option_01_C final : public UUIOptionPanel
{
public:
	class UWidgetAnimation*                       Choice_01_Popup;                                   // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Volume_03;                                         // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Volume_01_NoLine;                                  // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Volume_02;                                         // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Choice_02_NoLine;                                  // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Choice_03;                                         // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Choice_02;                                         // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Choice_01;                                         // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Volume_01;                                         // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_Commonmenu_OptionChoiceBase_00_C*    ChoiceBase1_01;                                    // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_OptionChoiceBase_02_C*    ChoiceBase1_01_Popup;                              // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_OptionChoiceBase_00_C*    ChoiceBase2_01;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_OptionChoiceBase_00_C*    ChoiceBase2_02;                                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_OptionChoiceBase_01_C*    ChoiceBase3_01;                                    // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_OptionChoiceBase_01_C*    ChoiceBase3_02;                                    // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Commonmenu_OptionChoiceBase_01_C*    ChoiceBase3_03;                                    // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Volume_01_C*                         W_Volume1_01;                                      // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Volume_02_C*                         W_Volume2_01;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Volume_03_C*                         W_Volume3_01;                                      // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WinLine_01;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Panel_Option_01_C">();
	}
	static class UW_Panel_Option_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Panel_Option_01_C>();
	}
};
static_assert(alignof(UW_Panel_Option_01_C) == 0x000008, "Wrong alignment on UW_Panel_Option_01_C");
static_assert(sizeof(UW_Panel_Option_01_C) == 0x000640, "Wrong size on UW_Panel_Option_01_C");
static_assert(offsetof(UW_Panel_Option_01_C, Choice_01_Popup) == 0x000598, "Member 'UW_Panel_Option_01_C::Choice_01_Popup' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, Volume_03) == 0x0005A0, "Member 'UW_Panel_Option_01_C::Volume_03' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, Volume_01_NoLine) == 0x0005A8, "Member 'UW_Panel_Option_01_C::Volume_01_NoLine' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, Volume_02) == 0x0005B0, "Member 'UW_Panel_Option_01_C::Volume_02' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, Choice_02_NoLine) == 0x0005B8, "Member 'UW_Panel_Option_01_C::Choice_02_NoLine' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, Choice_03) == 0x0005C0, "Member 'UW_Panel_Option_01_C::Choice_03' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, Choice_02) == 0x0005C8, "Member 'UW_Panel_Option_01_C::Choice_02' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, Choice_01) == 0x0005D0, "Member 'UW_Panel_Option_01_C::Choice_01' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, Volume_01) == 0x0005D8, "Member 'UW_Panel_Option_01_C::Volume_01' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, ChoiceBase1_01) == 0x0005E0, "Member 'UW_Panel_Option_01_C::ChoiceBase1_01' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, ChoiceBase1_01_Popup) == 0x0005E8, "Member 'UW_Panel_Option_01_C::ChoiceBase1_01_Popup' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, ChoiceBase2_01) == 0x0005F0, "Member 'UW_Panel_Option_01_C::ChoiceBase2_01' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, ChoiceBase2_02) == 0x0005F8, "Member 'UW_Panel_Option_01_C::ChoiceBase2_02' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, ChoiceBase3_01) == 0x000600, "Member 'UW_Panel_Option_01_C::ChoiceBase3_01' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, ChoiceBase3_02) == 0x000608, "Member 'UW_Panel_Option_01_C::ChoiceBase3_02' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, ChoiceBase3_03) == 0x000610, "Member 'UW_Panel_Option_01_C::ChoiceBase3_03' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, W_Menu_IconArrow) == 0x000618, "Member 'UW_Panel_Option_01_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, W_Volume1_01) == 0x000620, "Member 'UW_Panel_Option_01_C::W_Volume1_01' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, W_Volume2_01) == 0x000628, "Member 'UW_Panel_Option_01_C::W_Volume2_01' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, W_Volume3_01) == 0x000630, "Member 'UW_Panel_Option_01_C::W_Volume3_01' has a wrong offset!");
static_assert(offsetof(UW_Panel_Option_01_C, WinLine_01) == 0x000638, "Member 'UW_Panel_Option_01_C::WinLine_01' has a wrong offset!");

}

