#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Panel_SettingButton_03

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Panel_SettingButton_03.W_Panel_SettingButton_03_C
// 0x0048 (0x0598 - 0x0550)
class UW_Panel_SettingButton_03_C final : public UUIPanelControllerMapping
{
public:
	class UWidgetAnimation*                       Of;                                                // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TitleName;                                         // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 line_1;                                            // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Select_Line;                                       // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_01_C*            SettingButton_01;                                  // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleName_Base;                                    // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Panel_SettingButton_03_C">();
	}
	static class UW_Panel_SettingButton_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Panel_SettingButton_03_C>();
	}
};
static_assert(alignof(UW_Panel_SettingButton_03_C) == 0x000008, "Wrong alignment on UW_Panel_SettingButton_03_C");
static_assert(sizeof(UW_Panel_SettingButton_03_C) == 0x000598, "Wrong size on UW_Panel_SettingButton_03_C");
static_assert(offsetof(UW_Panel_SettingButton_03_C, Of) == 0x000550, "Member 'UW_Panel_SettingButton_03_C::Of' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_03_C, TitleName) == 0x000558, "Member 'UW_Panel_SettingButton_03_C::TitleName' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_03_C, on) == 0x000560, "Member 'UW_Panel_SettingButton_03_C::on' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_03_C, Normal) == 0x000568, "Member 'UW_Panel_SettingButton_03_C::Normal' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_03_C, line_1) == 0x000570, "Member 'UW_Panel_SettingButton_03_C::line_1' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_03_C, Select_Line) == 0x000578, "Member 'UW_Panel_SettingButton_03_C::Select_Line' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_03_C, SettingButton_01) == 0x000580, "Member 'UW_Panel_SettingButton_03_C::SettingButton_01' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_03_C, TitleName_Base) == 0x000588, "Member 'UW_Panel_SettingButton_03_C::TitleName_Base' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_03_C, W_Menu_IconArrow) == 0x000590, "Member 'UW_Panel_SettingButton_03_C::W_Menu_IconArrow' has a wrong offset!");

}

