#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PartyMenu_Tsuyosa

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PartyMenu_Tsuyosa.W_PartyMenu_Tsuyosa_C
// 0x00A0 (0x0540 - 0x04A0)
class UW_PartyMenu_Tsuyosa_C final : public UUIPartyMenu_Tsuyosa
{
public:
	class UWidgetAnimation*                       Cat_Double;                                        // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Cat_Single;                                        // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Artifact_Off;                                      // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Artifact_On;                                       // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LIVE;                                              // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Dead;                                              // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Artifact_Base;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Artifact_Panel_01_C*                 Artifact_Panel;                                    // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 Category_Panel_1;                                  // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Category_Panel_00_C*                 Category_Panel_2;                                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDarwinTwoSceneCaptureImage*            DarwinSceneCaptureImage;                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Drop_Panel_01_C*                     Drop_Panel;                                        // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TsutosaGauge_C*                      Exp_Gauge;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TsutosaGauge_C*                      HP_Gauge;                                          // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HP_Icon;                                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TsutosaGauge_C*                      MP_Gauge;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MP_Icon;                                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Status_Base;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PartyMenu_Tsuyosa_C">();
	}
	static class UW_PartyMenu_Tsuyosa_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PartyMenu_Tsuyosa_C>();
	}
};
static_assert(alignof(UW_PartyMenu_Tsuyosa_C) == 0x000008, "Wrong alignment on UW_PartyMenu_Tsuyosa_C");
static_assert(sizeof(UW_PartyMenu_Tsuyosa_C) == 0x000540, "Wrong size on UW_PartyMenu_Tsuyosa_C");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, Cat_Double) == 0x0004A0, "Member 'UW_PartyMenu_Tsuyosa_C::Cat_Double' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, Cat_Single) == 0x0004A8, "Member 'UW_PartyMenu_Tsuyosa_C::Cat_Single' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, Artifact_Off) == 0x0004B0, "Member 'UW_PartyMenu_Tsuyosa_C::Artifact_Off' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, Artifact_On) == 0x0004B8, "Member 'UW_PartyMenu_Tsuyosa_C::Artifact_On' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, LIVE) == 0x0004C0, "Member 'UW_PartyMenu_Tsuyosa_C::LIVE' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, Dead) == 0x0004C8, "Member 'UW_PartyMenu_Tsuyosa_C::Dead' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, Out) == 0x0004D0, "Member 'UW_PartyMenu_Tsuyosa_C::Out' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, In) == 0x0004D8, "Member 'UW_PartyMenu_Tsuyosa_C::In' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, Artifact_Base) == 0x0004E0, "Member 'UW_PartyMenu_Tsuyosa_C::Artifact_Base' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, Artifact_Panel) == 0x0004E8, "Member 'UW_PartyMenu_Tsuyosa_C::Artifact_Panel' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, Category_Panel_1) == 0x0004F0, "Member 'UW_PartyMenu_Tsuyosa_C::Category_Panel_1' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, Category_Panel_2) == 0x0004F8, "Member 'UW_PartyMenu_Tsuyosa_C::Category_Panel_2' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, DarwinSceneCaptureImage) == 0x000500, "Member 'UW_PartyMenu_Tsuyosa_C::DarwinSceneCaptureImage' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, Drop_Panel) == 0x000508, "Member 'UW_PartyMenu_Tsuyosa_C::Drop_Panel' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, Exp_Gauge) == 0x000510, "Member 'UW_PartyMenu_Tsuyosa_C::Exp_Gauge' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, HP_Gauge) == 0x000518, "Member 'UW_PartyMenu_Tsuyosa_C::HP_Gauge' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, HP_Icon) == 0x000520, "Member 'UW_PartyMenu_Tsuyosa_C::HP_Icon' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, MP_Gauge) == 0x000528, "Member 'UW_PartyMenu_Tsuyosa_C::MP_Gauge' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, MP_Icon) == 0x000530, "Member 'UW_PartyMenu_Tsuyosa_C::MP_Icon' has a wrong offset!");
static_assert(offsetof(UW_PartyMenu_Tsuyosa_C, Status_Base) == 0x000538, "Member 'UW_PartyMenu_Tsuyosa_C::Status_Base' has a wrong offset!");

}

