#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Panel_SettingButton_02

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Panel_SettingButton_02.W_Panel_SettingButton_02_C
// 0x0050 (0x05D0 - 0x0580)
class UW_Panel_SettingButton_02_C final : public UUIPanelKeyboardMapping
{
public:
	class UWidgetAnimation*                       Of;                                                // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TitleName;                                         // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 line_1;                                            // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Select_Line;                                       // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_01_C*            SettingButton_01;                                  // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_01_C*            SettingButton_02;                                  // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleName_Base;                                    // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Panel_SettingButton_02_C">();
	}
	static class UW_Panel_SettingButton_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Panel_SettingButton_02_C>();
	}
};
static_assert(alignof(UW_Panel_SettingButton_02_C) == 0x000008, "Wrong alignment on UW_Panel_SettingButton_02_C");
static_assert(sizeof(UW_Panel_SettingButton_02_C) == 0x0005D0, "Wrong size on UW_Panel_SettingButton_02_C");
static_assert(offsetof(UW_Panel_SettingButton_02_C, Of) == 0x000580, "Member 'UW_Panel_SettingButton_02_C::Of' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_02_C, TitleName) == 0x000588, "Member 'UW_Panel_SettingButton_02_C::TitleName' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_02_C, on) == 0x000590, "Member 'UW_Panel_SettingButton_02_C::on' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_02_C, Normal) == 0x000598, "Member 'UW_Panel_SettingButton_02_C::Normal' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_02_C, line_1) == 0x0005A0, "Member 'UW_Panel_SettingButton_02_C::line_1' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_02_C, Select_Line) == 0x0005A8, "Member 'UW_Panel_SettingButton_02_C::Select_Line' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_02_C, SettingButton_01) == 0x0005B0, "Member 'UW_Panel_SettingButton_02_C::SettingButton_01' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_02_C, SettingButton_02) == 0x0005B8, "Member 'UW_Panel_SettingButton_02_C::SettingButton_02' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_02_C, TitleName_Base) == 0x0005C0, "Member 'UW_Panel_SettingButton_02_C::TitleName_Base' has a wrong offset!");
static_assert(offsetof(UW_Panel_SettingButton_02_C, W_Menu_IconArrow) == 0x0005C8, "Member 'UW_Panel_SettingButton_02_C::W_Menu_IconArrow' has a wrong offset!");

}

