#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PlayerTransformInfoForDebug

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PlayerTransformInfoForDebug.W_PlayerTransformInfoForDebug_C
// 0x0058 (0x0290 - 0x0238)
class UW_PlayerTransformInfoForDebug_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CameraRotX;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CameraRotY;                                        // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CameraRotZ;                                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerPosX;                                        // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerPosY;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerPosZ;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerRotX;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerRotY;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerRotZ;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_PlayerTransformInfoForDebug(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdatePlayerPosition();
	void UpdatePlayerRotation();
	void UpdateCameraRotation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PlayerTransformInfoForDebug_C">();
	}
	static class UW_PlayerTransformInfoForDebug_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PlayerTransformInfoForDebug_C>();
	}
};
static_assert(alignof(UW_PlayerTransformInfoForDebug_C) == 0x000008, "Wrong alignment on UW_PlayerTransformInfoForDebug_C");
static_assert(sizeof(UW_PlayerTransformInfoForDebug_C) == 0x000290, "Wrong size on UW_PlayerTransformInfoForDebug_C");
static_assert(offsetof(UW_PlayerTransformInfoForDebug_C, UberGraphFrame) == 0x000238, "Member 'UW_PlayerTransformInfoForDebug_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_PlayerTransformInfoForDebug_C, CameraRotX) == 0x000240, "Member 'UW_PlayerTransformInfoForDebug_C::CameraRotX' has a wrong offset!");
static_assert(offsetof(UW_PlayerTransformInfoForDebug_C, CameraRotY) == 0x000248, "Member 'UW_PlayerTransformInfoForDebug_C::CameraRotY' has a wrong offset!");
static_assert(offsetof(UW_PlayerTransformInfoForDebug_C, CameraRotZ) == 0x000250, "Member 'UW_PlayerTransformInfoForDebug_C::CameraRotZ' has a wrong offset!");
static_assert(offsetof(UW_PlayerTransformInfoForDebug_C, Image_0) == 0x000258, "Member 'UW_PlayerTransformInfoForDebug_C::Image_0' has a wrong offset!");
static_assert(offsetof(UW_PlayerTransformInfoForDebug_C, PlayerPosX) == 0x000260, "Member 'UW_PlayerTransformInfoForDebug_C::PlayerPosX' has a wrong offset!");
static_assert(offsetof(UW_PlayerTransformInfoForDebug_C, PlayerPosY) == 0x000268, "Member 'UW_PlayerTransformInfoForDebug_C::PlayerPosY' has a wrong offset!");
static_assert(offsetof(UW_PlayerTransformInfoForDebug_C, PlayerPosZ) == 0x000270, "Member 'UW_PlayerTransformInfoForDebug_C::PlayerPosZ' has a wrong offset!");
static_assert(offsetof(UW_PlayerTransformInfoForDebug_C, PlayerRotX) == 0x000278, "Member 'UW_PlayerTransformInfoForDebug_C::PlayerRotX' has a wrong offset!");
static_assert(offsetof(UW_PlayerTransformInfoForDebug_C, PlayerRotY) == 0x000280, "Member 'UW_PlayerTransformInfoForDebug_C::PlayerRotY' has a wrong offset!");
static_assert(offsetof(UW_PlayerTransformInfoForDebug_C, PlayerRotZ) == 0x000288, "Member 'UW_PlayerTransformInfoForDebug_C::PlayerRotZ' has a wrong offset!");

}

