#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PMR_Page_03

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PMR_Page_03.W_PMR_Page_03_C
// 0x0138 (0x0798 - 0x0660)
class UW_PMR_Page_03_C final : public UUIPartyMenu_PMR_Page_03
{
public:
	class UWidgetAnimation*                       CoinMenu;                                          // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PartyMenu;                                         // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemMenu;                                          // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Edit;                                              // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0688(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar;                                         // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar_Base;                                    // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Template;                                          // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_10;                                     // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_11;                                     // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_12;                                     // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_13;                                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_14;                                     // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_15;                                     // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_16;                                     // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_17;                                     // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_18;                                     // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_19;                                     // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_20;                                     // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_21;                                     // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_22;                                     // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_23;                                     // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_24;                                     // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_25;                                     // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_26;                                     // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_27;                                     // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_28;                                     // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_01;                                     // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_02;                                     // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_03;                                     // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_04;                                     // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_05;                                     // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_06;                                     // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_07;                                     // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_08;                                     // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_03_C*                       W_PM_Panel_09;                                     // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PMR_Page_03_C">();
	}
	static class UW_PMR_Page_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PMR_Page_03_C>();
	}
};
static_assert(alignof(UW_PMR_Page_03_C) == 0x000008, "Wrong alignment on UW_PMR_Page_03_C");
static_assert(sizeof(UW_PMR_Page_03_C) == 0x000798, "Wrong size on UW_PMR_Page_03_C");
static_assert(offsetof(UW_PMR_Page_03_C, CoinMenu) == 0x000660, "Member 'UW_PMR_Page_03_C::CoinMenu' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, PartyMenu) == 0x000668, "Member 'UW_PMR_Page_03_C::PartyMenu' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, ItemMenu) == 0x000670, "Member 'UW_PMR_Page_03_C::ItemMenu' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, Edit) == 0x000678, "Member 'UW_PMR_Page_03_C::Edit' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, Out) == 0x000680, "Member 'UW_PMR_Page_03_C::Out' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, In) == 0x000688, "Member 'UW_PMR_Page_03_C::In' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, Image) == 0x000690, "Member 'UW_PMR_Page_03_C::Image' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, ScrollBar) == 0x000698, "Member 'UW_PMR_Page_03_C::ScrollBar' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, ScrollBar_Base) == 0x0006A0, "Member 'UW_PMR_Page_03_C::ScrollBar_Base' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, Template) == 0x0006A8, "Member 'UW_PMR_Page_03_C::Template' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_Menu_IconArrow) == 0x0006B0, "Member 'UW_PMR_Page_03_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_10) == 0x0006B8, "Member 'UW_PMR_Page_03_C::W_PM_Panel_10' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_11) == 0x0006C0, "Member 'UW_PMR_Page_03_C::W_PM_Panel_11' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_12) == 0x0006C8, "Member 'UW_PMR_Page_03_C::W_PM_Panel_12' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_13) == 0x0006D0, "Member 'UW_PMR_Page_03_C::W_PM_Panel_13' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_14) == 0x0006D8, "Member 'UW_PMR_Page_03_C::W_PM_Panel_14' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_15) == 0x0006E0, "Member 'UW_PMR_Page_03_C::W_PM_Panel_15' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_16) == 0x0006E8, "Member 'UW_PMR_Page_03_C::W_PM_Panel_16' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_17) == 0x0006F0, "Member 'UW_PMR_Page_03_C::W_PM_Panel_17' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_18) == 0x0006F8, "Member 'UW_PMR_Page_03_C::W_PM_Panel_18' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_19) == 0x000700, "Member 'UW_PMR_Page_03_C::W_PM_Panel_19' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_20) == 0x000708, "Member 'UW_PMR_Page_03_C::W_PM_Panel_20' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_21) == 0x000710, "Member 'UW_PMR_Page_03_C::W_PM_Panel_21' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_22) == 0x000718, "Member 'UW_PMR_Page_03_C::W_PM_Panel_22' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_23) == 0x000720, "Member 'UW_PMR_Page_03_C::W_PM_Panel_23' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_24) == 0x000728, "Member 'UW_PMR_Page_03_C::W_PM_Panel_24' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_25) == 0x000730, "Member 'UW_PMR_Page_03_C::W_PM_Panel_25' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_26) == 0x000738, "Member 'UW_PMR_Page_03_C::W_PM_Panel_26' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_27) == 0x000740, "Member 'UW_PMR_Page_03_C::W_PM_Panel_27' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_28) == 0x000748, "Member 'UW_PMR_Page_03_C::W_PM_Panel_28' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_01) == 0x000750, "Member 'UW_PMR_Page_03_C::W_PM_Panel_01' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_02) == 0x000758, "Member 'UW_PMR_Page_03_C::W_PM_Panel_02' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_03) == 0x000760, "Member 'UW_PMR_Page_03_C::W_PM_Panel_03' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_04) == 0x000768, "Member 'UW_PMR_Page_03_C::W_PM_Panel_04' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_05) == 0x000770, "Member 'UW_PMR_Page_03_C::W_PM_Panel_05' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_06) == 0x000778, "Member 'UW_PMR_Page_03_C::W_PM_Panel_06' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_07) == 0x000780, "Member 'UW_PMR_Page_03_C::W_PM_Panel_07' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_08) == 0x000788, "Member 'UW_PMR_Page_03_C::W_PM_Panel_08' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_03_C, W_PM_Panel_09) == 0x000790, "Member 'UW_PMR_Page_03_C::W_PM_Panel_09' has a wrong offset!");

}

