#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PMR_Page_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PMR_Page_01.W_PMR_Page_01_C
// 0x00D0 (0x0720 - 0x0650)
class UW_PMR_Page_01_C final : public UUIPartyMenu_PMR_Page_01
{
public:
	class UWidgetAnimation*                       SubStateOff;                                       // 0x0650(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SubStateOn;                                        // 0x0658(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CoinMenu_SP;                                       // 0x0660(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CoinMenu;                                          // 0x0668(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PartyMenu;                                         // 0x0670(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Edit;                                              // 0x0678(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0688(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Roman_Base;                                        // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Roman_Base_1;                                      // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Template;                                          // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_01_C*                       W_PM_Panel_01;                                     // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_01_C*                       W_PM_Panel_02;                                     // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_01_C*                       W_PM_Panel_03;                                     // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_01_C*                       W_PM_Panel_04;                                     // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_01_C*                       W_PM_Panel_05;                                     // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_01_C*                       W_PM_Panel_06;                                     // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_01_C*                       W_PM_Panel_07;                                     // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_01_C*                       W_PM_Panel_08;                                     // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_01_C*                       W_PM_Panel_09;                                     // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Panel_01_C*                       W_PM_Panel_Roman;                                  // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PMR_Page_01_C">();
	}
	static class UW_PMR_Page_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PMR_Page_01_C>();
	}
};
static_assert(alignof(UW_PMR_Page_01_C) == 0x000008, "Wrong alignment on UW_PMR_Page_01_C");
static_assert(sizeof(UW_PMR_Page_01_C) == 0x000720, "Wrong size on UW_PMR_Page_01_C");
static_assert(offsetof(UW_PMR_Page_01_C, SubStateOff) == 0x000650, "Member 'UW_PMR_Page_01_C::SubStateOff' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, SubStateOn) == 0x000658, "Member 'UW_PMR_Page_01_C::SubStateOn' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, CoinMenu_SP) == 0x000660, "Member 'UW_PMR_Page_01_C::CoinMenu_SP' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, CoinMenu) == 0x000668, "Member 'UW_PMR_Page_01_C::CoinMenu' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, PartyMenu) == 0x000670, "Member 'UW_PMR_Page_01_C::PartyMenu' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, Edit) == 0x000678, "Member 'UW_PMR_Page_01_C::Edit' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, Out) == 0x000680, "Member 'UW_PMR_Page_01_C::Out' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, In) == 0x000688, "Member 'UW_PMR_Page_01_C::In' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, Image) == 0x000690, "Member 'UW_PMR_Page_01_C::Image' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, Image_0) == 0x000698, "Member 'UW_PMR_Page_01_C::Image_0' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, Image_1) == 0x0006A0, "Member 'UW_PMR_Page_01_C::Image_1' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, Image_2) == 0x0006A8, "Member 'UW_PMR_Page_01_C::Image_2' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, Roman_Base) == 0x0006B0, "Member 'UW_PMR_Page_01_C::Roman_Base' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, Roman_Base_1) == 0x0006B8, "Member 'UW_PMR_Page_01_C::Roman_Base_1' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, Template) == 0x0006C0, "Member 'UW_PMR_Page_01_C::Template' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, W_Menu_IconArrow) == 0x0006C8, "Member 'UW_PMR_Page_01_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, W_PM_Panel_01) == 0x0006D0, "Member 'UW_PMR_Page_01_C::W_PM_Panel_01' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, W_PM_Panel_02) == 0x0006D8, "Member 'UW_PMR_Page_01_C::W_PM_Panel_02' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, W_PM_Panel_03) == 0x0006E0, "Member 'UW_PMR_Page_01_C::W_PM_Panel_03' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, W_PM_Panel_04) == 0x0006E8, "Member 'UW_PMR_Page_01_C::W_PM_Panel_04' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, W_PM_Panel_05) == 0x0006F0, "Member 'UW_PMR_Page_01_C::W_PM_Panel_05' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, W_PM_Panel_06) == 0x0006F8, "Member 'UW_PMR_Page_01_C::W_PM_Panel_06' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, W_PM_Panel_07) == 0x000700, "Member 'UW_PMR_Page_01_C::W_PM_Panel_07' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, W_PM_Panel_08) == 0x000708, "Member 'UW_PMR_Page_01_C::W_PM_Panel_08' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, W_PM_Panel_09) == 0x000710, "Member 'UW_PMR_Page_01_C::W_PM_Panel_09' has a wrong offset!");
static_assert(offsetof(UW_PMR_Page_01_C, W_PM_Panel_Roman) == 0x000718, "Member 'UW_PMR_Page_01_C::W_PM_Panel_Roman' has a wrong offset!");

}

