#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PM_Panel_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PM_Panel_01.W_PM_Panel_01_C
// 0x0108 (0x0650 - 0x0548)
class UW_PM_Panel_01_C final : public UUIPartyMenu_PM_Panel_01
{
public:
	class UWidgetAnimation*                       Header_Off;                                        // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Header_On;                                         // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Title_Off;                                         // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Title_On;                                          // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Skill_On;                                          // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unknown_On;                                        // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Roman_On;                                          // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Mp_On;                                             // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Plate_Off;                                         // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Plate_On;                                          // 0x0590(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Panel_Normal;                                      // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelUnLock;                                       // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PanelLock;                                         // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       off;                                               // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Cursor_Add;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_Base;                                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Del;                                               // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_New;                                          // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_42;                                          // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_68;                                          // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_222;                                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 line_1;                                            // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lock_Icon;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Roman_Base;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Roman_Icon;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PM_Icon_00_C*                        W_PM_Icon_00;                                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SideScrollTextWidget_C*              W_SideScrollTextWidget;                            // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PM_Panel_01_C">();
	}
	static class UW_PM_Panel_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PM_Panel_01_C>();
	}
};
static_assert(alignof(UW_PM_Panel_01_C) == 0x000008, "Wrong alignment on UW_PM_Panel_01_C");
static_assert(sizeof(UW_PM_Panel_01_C) == 0x000650, "Wrong size on UW_PM_Panel_01_C");
static_assert(offsetof(UW_PM_Panel_01_C, Header_Off) == 0x000548, "Member 'UW_PM_Panel_01_C::Header_Off' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Header_On) == 0x000550, "Member 'UW_PM_Panel_01_C::Header_On' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Title_Off) == 0x000558, "Member 'UW_PM_Panel_01_C::Title_Off' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Title_On) == 0x000560, "Member 'UW_PM_Panel_01_C::Title_On' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Skill_On) == 0x000568, "Member 'UW_PM_Panel_01_C::Skill_On' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Unknown_On) == 0x000570, "Member 'UW_PM_Panel_01_C::Unknown_On' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Roman_On) == 0x000578, "Member 'UW_PM_Panel_01_C::Roman_On' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Mp_On) == 0x000580, "Member 'UW_PM_Panel_01_C::Mp_On' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Plate_Off) == 0x000588, "Member 'UW_PM_Panel_01_C::Plate_Off' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Plate_On) == 0x000590, "Member 'UW_PM_Panel_01_C::Plate_On' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Panel_Normal) == 0x000598, "Member 'UW_PM_Panel_01_C::Panel_Normal' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, PanelUnLock) == 0x0005A0, "Member 'UW_PM_Panel_01_C::PanelUnLock' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, PanelLock) == 0x0005A8, "Member 'UW_PM_Panel_01_C::PanelLock' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, off) == 0x0005B0, "Member 'UW_PM_Panel_01_C::off' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Wait) == 0x0005B8, "Member 'UW_PM_Panel_01_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, on) == 0x0005C0, "Member 'UW_PM_Panel_01_C::on' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Cursor_Add) == 0x0005C8, "Member 'UW_PM_Panel_01_C::Cursor_Add' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Cursor_Base) == 0x0005D0, "Member 'UW_PM_Panel_01_C::Cursor_Base' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Del) == 0x0005D8, "Member 'UW_PM_Panel_01_C::Del' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Icon_New) == 0x0005E0, "Member 'UW_PM_Panel_01_C::Icon_New' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Image) == 0x0005E8, "Member 'UW_PM_Panel_01_C::Image' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Image_0) == 0x0005F0, "Member 'UW_PM_Panel_01_C::Image_0' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Image_1) == 0x0005F8, "Member 'UW_PM_Panel_01_C::Image_1' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Image_2) == 0x000600, "Member 'UW_PM_Panel_01_C::Image_2' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Image_42) == 0x000608, "Member 'UW_PM_Panel_01_C::Image_42' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Image_68) == 0x000610, "Member 'UW_PM_Panel_01_C::Image_68' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Image_222) == 0x000618, "Member 'UW_PM_Panel_01_C::Image_222' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, line_1) == 0x000620, "Member 'UW_PM_Panel_01_C::line_1' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Lock_Icon) == 0x000628, "Member 'UW_PM_Panel_01_C::Lock_Icon' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Roman_Base) == 0x000630, "Member 'UW_PM_Panel_01_C::Roman_Base' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, Roman_Icon) == 0x000638, "Member 'UW_PM_Panel_01_C::Roman_Icon' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, W_PM_Icon_00) == 0x000640, "Member 'UW_PM_Panel_01_C::W_PM_Icon_00' has a wrong offset!");
static_assert(offsetof(UW_PM_Panel_01_C, W_SideScrollTextWidget) == 0x000648, "Member 'UW_PM_Panel_01_C::W_SideScrollTextWidget' has a wrong offset!");

}

