#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_PresentCode_InputBox

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_PresentCode_InputBox.W_PresentCode_InputBox_C
// 0x0040 (0x05D8 - 0x0598)
class UW_PresentCode_InputBox_C final : public UUINameBoxBase
{
public:
	class UWidgetAnimation*                       off;                                               // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           arrow;                                             // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChoiceBase_01;                                     // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChoiceBase_Additive;                               // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChoiceFrame;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          NameText;                                          // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class UCanvasPanel* GetArrow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_PresentCode_InputBox_C">();
	}
	static class UW_PresentCode_InputBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_PresentCode_InputBox_C>();
	}
};
static_assert(alignof(UW_PresentCode_InputBox_C) == 0x000008, "Wrong alignment on UW_PresentCode_InputBox_C");
static_assert(sizeof(UW_PresentCode_InputBox_C) == 0x0005D8, "Wrong size on UW_PresentCode_InputBox_C");
static_assert(offsetof(UW_PresentCode_InputBox_C, off) == 0x000598, "Member 'UW_PresentCode_InputBox_C::off' has a wrong offset!");
static_assert(offsetof(UW_PresentCode_InputBox_C, Wait) == 0x0005A0, "Member 'UW_PresentCode_InputBox_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_PresentCode_InputBox_C, on) == 0x0005A8, "Member 'UW_PresentCode_InputBox_C::on' has a wrong offset!");
static_assert(offsetof(UW_PresentCode_InputBox_C, arrow) == 0x0005B0, "Member 'UW_PresentCode_InputBox_C::arrow' has a wrong offset!");
static_assert(offsetof(UW_PresentCode_InputBox_C, ChoiceBase_01) == 0x0005B8, "Member 'UW_PresentCode_InputBox_C::ChoiceBase_01' has a wrong offset!");
static_assert(offsetof(UW_PresentCode_InputBox_C, ChoiceBase_Additive) == 0x0005C0, "Member 'UW_PresentCode_InputBox_C::ChoiceBase_Additive' has a wrong offset!");
static_assert(offsetof(UW_PresentCode_InputBox_C, ChoiceFrame) == 0x0005C8, "Member 'UW_PresentCode_InputBox_C::ChoiceFrame' has a wrong offset!");
static_assert(offsetof(UW_PresentCode_InputBox_C, NameText) == 0x0005D0, "Member 'UW_PresentCode_InputBox_C::NameText' has a wrong offset!");

}

