#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_QMR_Page_Btm_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_QMR_Page_Btm_01.W_QMR_Page_Btm_01_C
// 0x0060 (0x0640 - 0x05E0)
class UW_QMR_Page_Btm_01_C final : public UUIQMR_Page_Btm_01
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x05E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ScrollBar_1;                                       // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar_Base_1;                                  // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_00_C*                       W_QM_Panel_01;                                     // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_00_C*                       W_QM_Panel_02;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_00_C*                       W_QM_Panel_03;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_00_C*                       W_QM_Panel_04;                                     // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_00_C*                       W_QM_Panel_05;                                     // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_00_C*                       W_QM_Panel_06;                                     // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_00_C*                       W_QM_Panel_07;                                     // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_QMR_Page_Btm_01_C">();
	}
	static class UW_QMR_Page_Btm_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_QMR_Page_Btm_01_C>();
	}
};
static_assert(alignof(UW_QMR_Page_Btm_01_C) == 0x000008, "Wrong alignment on UW_QMR_Page_Btm_01_C");
static_assert(sizeof(UW_QMR_Page_Btm_01_C) == 0x000640, "Wrong size on UW_QMR_Page_Btm_01_C");
static_assert(offsetof(UW_QMR_Page_Btm_01_C, Out) == 0x0005E0, "Member 'UW_QMR_Page_Btm_01_C::Out' has a wrong offset!");
static_assert(offsetof(UW_QMR_Page_Btm_01_C, In) == 0x0005E8, "Member 'UW_QMR_Page_Btm_01_C::In' has a wrong offset!");
static_assert(offsetof(UW_QMR_Page_Btm_01_C, ScrollBar_1) == 0x0005F0, "Member 'UW_QMR_Page_Btm_01_C::ScrollBar_1' has a wrong offset!");
static_assert(offsetof(UW_QMR_Page_Btm_01_C, ScrollBar_Base_1) == 0x0005F8, "Member 'UW_QMR_Page_Btm_01_C::ScrollBar_Base_1' has a wrong offset!");
static_assert(offsetof(UW_QMR_Page_Btm_01_C, W_Menu_IconArrow) == 0x000600, "Member 'UW_QMR_Page_Btm_01_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_QMR_Page_Btm_01_C, W_QM_Panel_01) == 0x000608, "Member 'UW_QMR_Page_Btm_01_C::W_QM_Panel_01' has a wrong offset!");
static_assert(offsetof(UW_QMR_Page_Btm_01_C, W_QM_Panel_02) == 0x000610, "Member 'UW_QMR_Page_Btm_01_C::W_QM_Panel_02' has a wrong offset!");
static_assert(offsetof(UW_QMR_Page_Btm_01_C, W_QM_Panel_03) == 0x000618, "Member 'UW_QMR_Page_Btm_01_C::W_QM_Panel_03' has a wrong offset!");
static_assert(offsetof(UW_QMR_Page_Btm_01_C, W_QM_Panel_04) == 0x000620, "Member 'UW_QMR_Page_Btm_01_C::W_QM_Panel_04' has a wrong offset!");
static_assert(offsetof(UW_QMR_Page_Btm_01_C, W_QM_Panel_05) == 0x000628, "Member 'UW_QMR_Page_Btm_01_C::W_QM_Panel_05' has a wrong offset!");
static_assert(offsetof(UW_QMR_Page_Btm_01_C, W_QM_Panel_06) == 0x000630, "Member 'UW_QMR_Page_Btm_01_C::W_QM_Panel_06' has a wrong offset!");
static_assert(offsetof(UW_QMR_Page_Btm_01_C, W_QM_Panel_07) == 0x000638, "Member 'UW_QMR_Page_Btm_01_C::W_QM_Panel_07' has a wrong offset!");

}

