#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_QM_Panel_07

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_QM_Panel_07.W_QM_Panel_07_C
// 0x0040 (0x04D0 - 0x0490)
class UW_QM_Panel_07_C final : public UUIQM_Panel_07
{
public:
	class UWidgetAnimation*                       NewAnimation_1;                                    // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Count;                                             // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gold;                                              // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Nomal;                                             // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Box;                                               // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Under_line01;                                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_QM_Panel_07_C">();
	}
	static class UW_QM_Panel_07_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_QM_Panel_07_C>();
	}
};
static_assert(alignof(UW_QM_Panel_07_C) == 0x000008, "Wrong alignment on UW_QM_Panel_07_C");
static_assert(sizeof(UW_QM_Panel_07_C) == 0x0004D0, "Wrong size on UW_QM_Panel_07_C");
static_assert(offsetof(UW_QM_Panel_07_C, NewAnimation_1) == 0x000490, "Member 'UW_QM_Panel_07_C::NewAnimation_1' has a wrong offset!");
static_assert(offsetof(UW_QM_Panel_07_C, NewAnimation) == 0x000498, "Member 'UW_QM_Panel_07_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UW_QM_Panel_07_C, Count) == 0x0004A0, "Member 'UW_QM_Panel_07_C::Count' has a wrong offset!");
static_assert(offsetof(UW_QM_Panel_07_C, Gold) == 0x0004A8, "Member 'UW_QM_Panel_07_C::Gold' has a wrong offset!");
static_assert(offsetof(UW_QM_Panel_07_C, Nomal) == 0x0004B0, "Member 'UW_QM_Panel_07_C::Nomal' has a wrong offset!");
static_assert(offsetof(UW_QM_Panel_07_C, Box) == 0x0004B8, "Member 'UW_QM_Panel_07_C::Box' has a wrong offset!");
static_assert(offsetof(UW_QM_Panel_07_C, Check) == 0x0004C0, "Member 'UW_QM_Panel_07_C::Check' has a wrong offset!");
static_assert(offsetof(UW_QM_Panel_07_C, Under_line01) == 0x0004C8, "Member 'UW_QM_Panel_07_C::Under_line01' has a wrong offset!");

}

