#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_QM_Panel_04

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_QM_Panel_04.W_QM_Panel_04_C
// 0x0030 (0x04C0 - 0x0490)
class UW_QM_Panel_04_C final : public UUIQM_Panel_04
{
public:
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Count;                                             // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gold;                                              // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Nomal;                                             // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Box;                                               // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_QM_Panel_04_C">();
	}
	static class UW_QM_Panel_04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_QM_Panel_04_C>();
	}
};
static_assert(alignof(UW_QM_Panel_04_C) == 0x000008, "Wrong alignment on UW_QM_Panel_04_C");
static_assert(sizeof(UW_QM_Panel_04_C) == 0x0004C0, "Wrong size on UW_QM_Panel_04_C");
static_assert(offsetof(UW_QM_Panel_04_C, NewAnimation) == 0x000490, "Member 'UW_QM_Panel_04_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UW_QM_Panel_04_C, Count) == 0x000498, "Member 'UW_QM_Panel_04_C::Count' has a wrong offset!");
static_assert(offsetof(UW_QM_Panel_04_C, Gold) == 0x0004A0, "Member 'UW_QM_Panel_04_C::Gold' has a wrong offset!");
static_assert(offsetof(UW_QM_Panel_04_C, Nomal) == 0x0004A8, "Member 'UW_QM_Panel_04_C::Nomal' has a wrong offset!");
static_assert(offsetof(UW_QM_Panel_04_C, Box) == 0x0004B0, "Member 'UW_QM_Panel_04_C::Box' has a wrong offset!");
static_assert(offsetof(UW_QM_Panel_04_C, Check) == 0x0004B8, "Member 'UW_QM_Panel_04_C::Check' has a wrong offset!");

}

