#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Quest_WinDialog

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Quest_WinDialog.W_Quest_WinDialog_C
// 0x0050 (0x0668 - 0x0618)
class UW_Quest_WinDialog_C final : public UUIQuest_WinDialog
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Board_WindowHead;                                  // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_Base;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BG_Black_C*                          W_BG_Black;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_IconChoice_C*                        W_IconChoice_1;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_IconChoice_C*                        W_IconChoice_2;                                    // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Quest_WinDialog_Text_C*              W_Quest_WinDialog_Text;                            // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBase_01;                                     // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Quest_WinDialog_C">();
	}
	static class UW_Quest_WinDialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Quest_WinDialog_C>();
	}
};
static_assert(alignof(UW_Quest_WinDialog_C) == 0x000008, "Wrong alignment on UW_Quest_WinDialog_C");
static_assert(sizeof(UW_Quest_WinDialog_C) == 0x000668, "Wrong size on UW_Quest_WinDialog_C");
static_assert(offsetof(UW_Quest_WinDialog_C, Out) == 0x000618, "Member 'UW_Quest_WinDialog_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_C, In) == 0x000620, "Member 'UW_Quest_WinDialog_C::In' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_C, Board_WindowHead) == 0x000628, "Member 'UW_Quest_WinDialog_C::Board_WindowHead' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_C, Text_Base) == 0x000630, "Member 'UW_Quest_WinDialog_C::Text_Base' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_C, W_BG_Black) == 0x000638, "Member 'UW_Quest_WinDialog_C::W_BG_Black' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_C, W_IconChoice_1) == 0x000640, "Member 'UW_Quest_WinDialog_C::W_IconChoice_1' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_C, W_IconChoice_2) == 0x000648, "Member 'UW_Quest_WinDialog_C::W_IconChoice_2' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_C, W_Menu_IconArrow) == 0x000650, "Member 'UW_Quest_WinDialog_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_C, W_Quest_WinDialog_Text) == 0x000658, "Member 'UW_Quest_WinDialog_C::W_Quest_WinDialog_Text' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_C, WindowBase_01) == 0x000660, "Member 'UW_Quest_WinDialog_C::WindowBase_01' has a wrong offset!");

}

