#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Quest_WinDialog_Text

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Quest_WinDialog_Text.W_Quest_WinDialog_Text_C
// 0x00E8 (0x05F8 - 0x0510)
class UW_Quest_WinDialog_Text_C final : public UUIQuest_WinDialog_Text
{
public:
	class UImage*                                 QuestPanel_02;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar_Base;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_07_C*                       W_QM_Panel_01_1;                                   // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_07_C*                       W_QM_Panel_01_2;                                   // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_07_C*                       W_QM_Panel_01_3;                                   // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_07_C*                       W_QM_Panel_01_4;                                   // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_07_C*                       W_QM_Panel_01_5;                                   // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_07_C*                       W_QM_Panel_01_6;                                   // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_07_C*                       W_QM_Panel_01_7;                                   // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_07_C*                       W_QM_Panel_01_8;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_07_C*                       W_QM_Panel_01_9;                                   // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_07_C*                       W_QM_Panel_01_10;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_0;                                   // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_1;                                   // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_2;                                   // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_3;                                   // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_4;                                   // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_5;                                   // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_6;                                   // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_7;                                   // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_8;                                   // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_9;                                   // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_10;                                  // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_11;                                  // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_12;                                  // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_13;                                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_14;                                  // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_QM_Panel_08_C*                       W_QM_Panel_02_15;                                  // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Quest_WinDialog_Text_C">();
	}
	static class UW_Quest_WinDialog_Text_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Quest_WinDialog_Text_C>();
	}
};
static_assert(alignof(UW_Quest_WinDialog_Text_C) == 0x000008, "Wrong alignment on UW_Quest_WinDialog_Text_C");
static_assert(sizeof(UW_Quest_WinDialog_Text_C) == 0x0005F8, "Wrong size on UW_Quest_WinDialog_Text_C");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, QuestPanel_02) == 0x000510, "Member 'UW_Quest_WinDialog_Text_C::QuestPanel_02' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, ScrollBar) == 0x000518, "Member 'UW_Quest_WinDialog_Text_C::ScrollBar' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, ScrollBar_Base) == 0x000520, "Member 'UW_Quest_WinDialog_Text_C::ScrollBar_Base' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_01_1) == 0x000528, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_01_1' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_01_2) == 0x000530, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_01_2' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_01_3) == 0x000538, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_01_3' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_01_4) == 0x000540, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_01_4' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_01_5) == 0x000548, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_01_5' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_01_6) == 0x000550, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_01_6' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_01_7) == 0x000558, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_01_7' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_01_8) == 0x000560, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_01_8' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_01_9) == 0x000568, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_01_9' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_01_10) == 0x000570, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_01_10' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_0) == 0x000578, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_0' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_1) == 0x000580, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_1' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_2) == 0x000588, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_2' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_3) == 0x000590, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_3' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_4) == 0x000598, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_4' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_5) == 0x0005A0, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_5' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_6) == 0x0005A8, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_6' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_7) == 0x0005B0, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_7' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_8) == 0x0005B8, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_8' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_9) == 0x0005C0, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_9' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_10) == 0x0005C8, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_10' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_11) == 0x0005D0, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_11' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_12) == 0x0005D8, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_12' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_13) == 0x0005E0, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_13' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_14) == 0x0005E8, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_14' has a wrong offset!");
static_assert(offsetof(UW_Quest_WinDialog_Text_C, W_QM_Panel_02_15) == 0x0005F0, "Member 'UW_Quest_WinDialog_Text_C::W_QM_Panel_02_15' has a wrong offset!");

}

