#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingButton_Win_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SettingButton_Win_01.W_SettingButton_Win_01_C
// 0x01D0 (0x0940 - 0x0770)
class UW_SettingButton_Win_01_C final : public UUIWinKeyboardSetting
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0770(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0778(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_01;                                           // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_02;                                           // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_01;                                         // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_02;                                         // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_03;                                         // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_04;                                         // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_05;                                         // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_06;                                         // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Explanation_01;                                    // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar;                                         // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBar_Base;                                    // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_10;                                        // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_11;                                        // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_12;                                        // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_13;                                        // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_14;                                        // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_15;                                        // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_16;                                        // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_17;                                        // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_18;                                        // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_19;                                        // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_20;                                        // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_21;                                        // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_22;                                        // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_23;                                        // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_24;                                        // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_25;                                        // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_26;                                        // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_27;                                        // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_28;                                        // 0x0868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_29;                                        // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_30;                                        // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_31;                                        // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_32;                                        // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_33;                                        // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_34;                                        // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_35;                                        // 0x08A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_36;                                        // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_01;                                        // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_02;                                        // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_03;                                        // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_04;                                        // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_05;                                        // 0x08D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_06;                                        // 0x08D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_07;                                        // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_08;                                        // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Panel_SettingButton_02_C*            Setting_09;                                        // 0x08F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         TextBlock_01;                                      // 0x08F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         TextBlock_02;                                      // 0x0900(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         TextBlock_03;                                      // 0x0908(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         TextBlock_04;                                      // 0x0910(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         TextBlock_05;                                      // 0x0918(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BG_Black_C*                          W_BG_Black;                                        // 0x0920(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0928(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBase;                                        // 0x0930(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowNameBase;                                    // 0x0938(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SettingButton_Win_01_C">();
	}
	static class UW_SettingButton_Win_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SettingButton_Win_01_C>();
	}
};
static_assert(alignof(UW_SettingButton_Win_01_C) == 0x000008, "Wrong alignment on UW_SettingButton_Win_01_C");
static_assert(sizeof(UW_SettingButton_Win_01_C) == 0x000940, "Wrong size on UW_SettingButton_Win_01_C");
static_assert(offsetof(UW_SettingButton_Win_01_C, Out) == 0x000770, "Member 'UW_SettingButton_Win_01_C::Out' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, In) == 0x000778, "Member 'UW_SettingButton_Win_01_C::In' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Base_01) == 0x000780, "Member 'UW_SettingButton_Win_01_C::Base_01' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Base_02) == 0x000788, "Member 'UW_SettingButton_Win_01_C::Base_02' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Button_01) == 0x000790, "Member 'UW_SettingButton_Win_01_C::Button_01' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Button_02) == 0x000798, "Member 'UW_SettingButton_Win_01_C::Button_02' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Button_03) == 0x0007A0, "Member 'UW_SettingButton_Win_01_C::Button_03' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Button_04) == 0x0007A8, "Member 'UW_SettingButton_Win_01_C::Button_04' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Button_05) == 0x0007B0, "Member 'UW_SettingButton_Win_01_C::Button_05' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Button_06) == 0x0007B8, "Member 'UW_SettingButton_Win_01_C::Button_06' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Explanation_01) == 0x0007C0, "Member 'UW_SettingButton_Win_01_C::Explanation_01' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, ScrollBar) == 0x0007C8, "Member 'UW_SettingButton_Win_01_C::ScrollBar' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, ScrollBar_Base) == 0x0007D0, "Member 'UW_SettingButton_Win_01_C::ScrollBar_Base' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_10) == 0x0007D8, "Member 'UW_SettingButton_Win_01_C::Setting_10' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_11) == 0x0007E0, "Member 'UW_SettingButton_Win_01_C::Setting_11' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_12) == 0x0007E8, "Member 'UW_SettingButton_Win_01_C::Setting_12' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_13) == 0x0007F0, "Member 'UW_SettingButton_Win_01_C::Setting_13' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_14) == 0x0007F8, "Member 'UW_SettingButton_Win_01_C::Setting_14' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_15) == 0x000800, "Member 'UW_SettingButton_Win_01_C::Setting_15' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_16) == 0x000808, "Member 'UW_SettingButton_Win_01_C::Setting_16' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_17) == 0x000810, "Member 'UW_SettingButton_Win_01_C::Setting_17' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_18) == 0x000818, "Member 'UW_SettingButton_Win_01_C::Setting_18' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_19) == 0x000820, "Member 'UW_SettingButton_Win_01_C::Setting_19' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_20) == 0x000828, "Member 'UW_SettingButton_Win_01_C::Setting_20' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_21) == 0x000830, "Member 'UW_SettingButton_Win_01_C::Setting_21' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_22) == 0x000838, "Member 'UW_SettingButton_Win_01_C::Setting_22' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_23) == 0x000840, "Member 'UW_SettingButton_Win_01_C::Setting_23' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_24) == 0x000848, "Member 'UW_SettingButton_Win_01_C::Setting_24' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_25) == 0x000850, "Member 'UW_SettingButton_Win_01_C::Setting_25' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_26) == 0x000858, "Member 'UW_SettingButton_Win_01_C::Setting_26' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_27) == 0x000860, "Member 'UW_SettingButton_Win_01_C::Setting_27' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_28) == 0x000868, "Member 'UW_SettingButton_Win_01_C::Setting_28' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_29) == 0x000870, "Member 'UW_SettingButton_Win_01_C::Setting_29' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_30) == 0x000878, "Member 'UW_SettingButton_Win_01_C::Setting_30' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_31) == 0x000880, "Member 'UW_SettingButton_Win_01_C::Setting_31' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_32) == 0x000888, "Member 'UW_SettingButton_Win_01_C::Setting_32' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_33) == 0x000890, "Member 'UW_SettingButton_Win_01_C::Setting_33' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_34) == 0x000898, "Member 'UW_SettingButton_Win_01_C::Setting_34' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_35) == 0x0008A0, "Member 'UW_SettingButton_Win_01_C::Setting_35' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_36) == 0x0008A8, "Member 'UW_SettingButton_Win_01_C::Setting_36' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_01) == 0x0008B0, "Member 'UW_SettingButton_Win_01_C::Setting_01' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_02) == 0x0008B8, "Member 'UW_SettingButton_Win_01_C::Setting_02' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_03) == 0x0008C0, "Member 'UW_SettingButton_Win_01_C::Setting_03' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_04) == 0x0008C8, "Member 'UW_SettingButton_Win_01_C::Setting_04' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_05) == 0x0008D0, "Member 'UW_SettingButton_Win_01_C::Setting_05' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_06) == 0x0008D8, "Member 'UW_SettingButton_Win_01_C::Setting_06' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_07) == 0x0008E0, "Member 'UW_SettingButton_Win_01_C::Setting_07' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_08) == 0x0008E8, "Member 'UW_SettingButton_Win_01_C::Setting_08' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, Setting_09) == 0x0008F0, "Member 'UW_SettingButton_Win_01_C::Setting_09' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, TextBlock_01) == 0x0008F8, "Member 'UW_SettingButton_Win_01_C::TextBlock_01' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, TextBlock_02) == 0x000900, "Member 'UW_SettingButton_Win_01_C::TextBlock_02' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, TextBlock_03) == 0x000908, "Member 'UW_SettingButton_Win_01_C::TextBlock_03' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, TextBlock_04) == 0x000910, "Member 'UW_SettingButton_Win_01_C::TextBlock_04' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, TextBlock_05) == 0x000918, "Member 'UW_SettingButton_Win_01_C::TextBlock_05' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, W_BG_Black) == 0x000920, "Member 'UW_SettingButton_Win_01_C::W_BG_Black' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, W_Menu_IconArrow) == 0x000928, "Member 'UW_SettingButton_Win_01_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, WindowBase) == 0x000930, "Member 'UW_SettingButton_Win_01_C::WindowBase' has a wrong offset!");
static_assert(offsetof(UW_SettingButton_Win_01_C, WindowNameBase) == 0x000938, "Member 'UW_SettingButton_Win_01_C::WindowNameBase' has a wrong offset!");

}

