#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Setting_WinSelect_00

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Setting_WinSelect_00.W_Setting_WinSelect_00_C
// 0x0080 (0x06B8 - 0x0638)
class UW_Setting_WinSelect_00_C final : public UUIWinMenUMultipleChoices
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0640(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_25;                                          // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 line;                                              // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineBase_01;                                       // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineBase_02;                                       // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BG_Black_C*                          W_BG_Black;                                        // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_IconChoice_C*                        W_IconChoice_01;                                   // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Itemmenu_SortIconChoice_OS_C*        W_Itemmenu_SortIconChoice_OS_01;                   // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Itemmenu_SortIconChoice_OS_C*        W_Itemmenu_SortIconChoice_OS_02;                   // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Itemmenu_SortIconChoice_OS_C*        W_Itemmenu_SortIconChoice_OS_03;                   // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Itemmenu_SortIconChoice_OS_C*        W_Itemmenu_SortIconChoice_OS_04;                   // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Itemmenu_SortIconChoice_OS_C*        W_Itemmenu_SortIconChoice_OS_05;                   // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Itemmenu_SortIconChoice_OS_C*        W_Itemmenu_SortIconChoice_OS_06;                   // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WindowBase;                                        // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Setting_WinSelect_00_C">();
	}
	static class UW_Setting_WinSelect_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Setting_WinSelect_00_C>();
	}
};
static_assert(alignof(UW_Setting_WinSelect_00_C) == 0x000008, "Wrong alignment on UW_Setting_WinSelect_00_C");
static_assert(sizeof(UW_Setting_WinSelect_00_C) == 0x0006B8, "Wrong size on UW_Setting_WinSelect_00_C");
static_assert(offsetof(UW_Setting_WinSelect_00_C, Out) == 0x000638, "Member 'UW_Setting_WinSelect_00_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, In) == 0x000640, "Member 'UW_Setting_WinSelect_00_C::In' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, Image_25) == 0x000648, "Member 'UW_Setting_WinSelect_00_C::Image_25' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, line) == 0x000650, "Member 'UW_Setting_WinSelect_00_C::line' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, LineBase_01) == 0x000658, "Member 'UW_Setting_WinSelect_00_C::LineBase_01' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, LineBase_02) == 0x000660, "Member 'UW_Setting_WinSelect_00_C::LineBase_02' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, W_BG_Black) == 0x000668, "Member 'UW_Setting_WinSelect_00_C::W_BG_Black' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, W_IconChoice_01) == 0x000670, "Member 'UW_Setting_WinSelect_00_C::W_IconChoice_01' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, W_Itemmenu_SortIconChoice_OS_01) == 0x000678, "Member 'UW_Setting_WinSelect_00_C::W_Itemmenu_SortIconChoice_OS_01' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, W_Itemmenu_SortIconChoice_OS_02) == 0x000680, "Member 'UW_Setting_WinSelect_00_C::W_Itemmenu_SortIconChoice_OS_02' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, W_Itemmenu_SortIconChoice_OS_03) == 0x000688, "Member 'UW_Setting_WinSelect_00_C::W_Itemmenu_SortIconChoice_OS_03' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, W_Itemmenu_SortIconChoice_OS_04) == 0x000690, "Member 'UW_Setting_WinSelect_00_C::W_Itemmenu_SortIconChoice_OS_04' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, W_Itemmenu_SortIconChoice_OS_05) == 0x000698, "Member 'UW_Setting_WinSelect_00_C::W_Itemmenu_SortIconChoice_OS_05' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, W_Itemmenu_SortIconChoice_OS_06) == 0x0006A0, "Member 'UW_Setting_WinSelect_00_C::W_Itemmenu_SortIconChoice_OS_06' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, W_Menu_IconArrow) == 0x0006A8, "Member 'UW_Setting_WinSelect_00_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_Setting_WinSelect_00_C, WindowBase) == 0x0006B0, "Member 'UW_Setting_WinSelect_00_C::WindowBase' has a wrong offset!");

}

