#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Shot_WinStatus

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Shot_WinStatus.W_Shot_WinStatus_C
// 0x0138 (0x07C0 - 0x0688)
class UW_Shot_WinStatus_C final : public UUIShot_WinStatus
{
public:
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0688(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_Off;                                        // 0x0690(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_ON;                                         // 0x0698(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x06A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x06A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 A_Button;                                          // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ButtonArrow_C*                       ArrowBase_D;                                       // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ButtonArrow_C*                       ArrowBase_L;                                       // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ButtonArrow_C*                       ArrowBase_R;                                       // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ButtonArrow_C*                       ArrowBase_U;                                       // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Base;                                              // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Decide;                                            // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Guidebase;                                         // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Guidebase_1;                                       // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Help;                                              // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconBullet_C*                   Item_C_01;                                         // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconBullet_C*                   Item_Choice;                                       // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconBullet_C*                   Item_D_01;                                         // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconBullet_C*                   Item_D_02;                                         // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconBullet_C*                   Item_L_01;                                         // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconBullet_C*                   Item_L_02;                                         // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconBullet_C*                   Item_L_03;                                         // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconBullet_C*                   Item_R_01;                                         // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconBullet_C*                   Item_R_02;                                         // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconBullet_C*                   Item_R_03;                                         // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconBullet_C*                   Item_Select;                                       // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconBullet_C*                   Item_U_01;                                         // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconBullet_C*                   Item_U_02;                                         // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Putaway;                                           // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ScrollArea;                                        // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_Detail_C*                       W_Shot_Detail;                                     // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Shot_IconRange_C*                    W_Slingshot_GroupSelect;                           // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 X_Button;                                          // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Y_Button;                                          // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsPressedZR;                                       // 0x0798(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_799[0x7];                                      // 0x0799(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              LatentDispatcher;                                  // 0x07A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          WaitOneFrame;                                      // 0x07B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B1[0x3];                                      // 0x07B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OldCategoryNum;                                    // 0x07B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldRankNum;                                        // 0x07B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void IsExistBullet(bool* Result);
	void GetSelectProjectileIndex(int32* OutProjectileIndex);
	void SetUIVisible(bool SetUIVisible_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Shot_WinStatus_C">();
	}
	static class UW_Shot_WinStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Shot_WinStatus_C>();
	}
};
static_assert(alignof(UW_Shot_WinStatus_C) == 0x000008, "Wrong alignment on UW_Shot_WinStatus_C");
static_assert(sizeof(UW_Shot_WinStatus_C) == 0x0007C0, "Wrong size on UW_Shot_WinStatus_C");
static_assert(offsetof(UW_Shot_WinStatus_C, NewAnimation) == 0x000688, "Member 'UW_Shot_WinStatus_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Select_Off) == 0x000690, "Member 'UW_Shot_WinStatus_C::Select_Off' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Select_ON) == 0x000698, "Member 'UW_Shot_WinStatus_C::Select_ON' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Out) == 0x0006A0, "Member 'UW_Shot_WinStatus_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, In) == 0x0006A8, "Member 'UW_Shot_WinStatus_C::In' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, A_Button) == 0x0006B0, "Member 'UW_Shot_WinStatus_C::A_Button' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, ArrowBase_D) == 0x0006B8, "Member 'UW_Shot_WinStatus_C::ArrowBase_D' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, ArrowBase_L) == 0x0006C0, "Member 'UW_Shot_WinStatus_C::ArrowBase_L' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, ArrowBase_R) == 0x0006C8, "Member 'UW_Shot_WinStatus_C::ArrowBase_R' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, ArrowBase_U) == 0x0006D0, "Member 'UW_Shot_WinStatus_C::ArrowBase_U' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Base) == 0x0006D8, "Member 'UW_Shot_WinStatus_C::Base' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Decide) == 0x0006E0, "Member 'UW_Shot_WinStatus_C::Decide' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Guidebase) == 0x0006E8, "Member 'UW_Shot_WinStatus_C::Guidebase' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Guidebase_1) == 0x0006F0, "Member 'UW_Shot_WinStatus_C::Guidebase_1' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Help) == 0x0006F8, "Member 'UW_Shot_WinStatus_C::Help' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Item_C_01) == 0x000700, "Member 'UW_Shot_WinStatus_C::Item_C_01' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Item_Choice) == 0x000708, "Member 'UW_Shot_WinStatus_C::Item_Choice' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Item_D_01) == 0x000710, "Member 'UW_Shot_WinStatus_C::Item_D_01' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Item_D_02) == 0x000718, "Member 'UW_Shot_WinStatus_C::Item_D_02' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Item_L_01) == 0x000720, "Member 'UW_Shot_WinStatus_C::Item_L_01' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Item_L_02) == 0x000728, "Member 'UW_Shot_WinStatus_C::Item_L_02' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Item_L_03) == 0x000730, "Member 'UW_Shot_WinStatus_C::Item_L_03' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Item_R_01) == 0x000738, "Member 'UW_Shot_WinStatus_C::Item_R_01' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Item_R_02) == 0x000740, "Member 'UW_Shot_WinStatus_C::Item_R_02' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Item_R_03) == 0x000748, "Member 'UW_Shot_WinStatus_C::Item_R_03' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Item_Select) == 0x000750, "Member 'UW_Shot_WinStatus_C::Item_Select' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Item_U_01) == 0x000758, "Member 'UW_Shot_WinStatus_C::Item_U_01' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Item_U_02) == 0x000760, "Member 'UW_Shot_WinStatus_C::Item_U_02' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Putaway) == 0x000768, "Member 'UW_Shot_WinStatus_C::Putaway' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, ScrollArea) == 0x000770, "Member 'UW_Shot_WinStatus_C::ScrollArea' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, W_Shot_Detail) == 0x000778, "Member 'UW_Shot_WinStatus_C::W_Shot_Detail' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, W_Slingshot_GroupSelect) == 0x000780, "Member 'UW_Shot_WinStatus_C::W_Slingshot_GroupSelect' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, X_Button) == 0x000788, "Member 'UW_Shot_WinStatus_C::X_Button' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, Y_Button) == 0x000790, "Member 'UW_Shot_WinStatus_C::Y_Button' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, IsPressedZR) == 0x000798, "Member 'UW_Shot_WinStatus_C::IsPressedZR' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, LatentDispatcher) == 0x0007A0, "Member 'UW_Shot_WinStatus_C::LatentDispatcher' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, WaitOneFrame) == 0x0007B0, "Member 'UW_Shot_WinStatus_C::WaitOneFrame' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, OldCategoryNum) == 0x0007B4, "Member 'UW_Shot_WinStatus_C::OldCategoryNum' has a wrong offset!");
static_assert(offsetof(UW_Shot_WinStatus_C, OldRankNum) == 0x0007B8, "Member 'UW_Shot_WinStatus_C::OldRankNum' has a wrong offset!");

}

