#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Shot_Detail

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Shot_Detail.W_Shot_Detail_C
// 0x0048 (0x0500 - 0x04B8)
class UW_Shot_Detail_C final : public UUIShot_Detail
{
public:
	class UWidgetAnimation*                       Bullet_Size;                                       // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Glut_Size;                                         // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Category_Off;                                      // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Category_On;                                       // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NamePos_2;                                         // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NamePos_1;                                         // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Attrib_Icon;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconBase_01;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconBase_02;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Shot_Detail_C">();
	}
	static class UW_Shot_Detail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Shot_Detail_C>();
	}
};
static_assert(alignof(UW_Shot_Detail_C) == 0x000008, "Wrong alignment on UW_Shot_Detail_C");
static_assert(sizeof(UW_Shot_Detail_C) == 0x000500, "Wrong size on UW_Shot_Detail_C");
static_assert(offsetof(UW_Shot_Detail_C, Bullet_Size) == 0x0004B8, "Member 'UW_Shot_Detail_C::Bullet_Size' has a wrong offset!");
static_assert(offsetof(UW_Shot_Detail_C, Glut_Size) == 0x0004C0, "Member 'UW_Shot_Detail_C::Glut_Size' has a wrong offset!");
static_assert(offsetof(UW_Shot_Detail_C, Category_Off) == 0x0004C8, "Member 'UW_Shot_Detail_C::Category_Off' has a wrong offset!");
static_assert(offsetof(UW_Shot_Detail_C, Category_On) == 0x0004D0, "Member 'UW_Shot_Detail_C::Category_On' has a wrong offset!");
static_assert(offsetof(UW_Shot_Detail_C, NamePos_2) == 0x0004D8, "Member 'UW_Shot_Detail_C::NamePos_2' has a wrong offset!");
static_assert(offsetof(UW_Shot_Detail_C, NamePos_1) == 0x0004E0, "Member 'UW_Shot_Detail_C::NamePos_1' has a wrong offset!");
static_assert(offsetof(UW_Shot_Detail_C, Attrib_Icon) == 0x0004E8, "Member 'UW_Shot_Detail_C::Attrib_Icon' has a wrong offset!");
static_assert(offsetof(UW_Shot_Detail_C, IconBase_01) == 0x0004F0, "Member 'UW_Shot_Detail_C::IconBase_01' has a wrong offset!");
static_assert(offsetof(UW_Shot_Detail_C, IconBase_02) == 0x0004F8, "Member 'UW_Shot_Detail_C::IconBase_02' has a wrong offset!");

}

