#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Sign_IconMiss

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Sign_IconMiss.W_Sign_IconMiss_C
// 0x0020 (0x05D0 - 0x05B0)
class UW_Sign_IconMiss_C final : public UUISign_IconMiss
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       In_Icon;                                           // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Miss;                                        // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PlayOneshotMiss();
	void ExecuteUbergraph_W_Sign_IconMiss(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Sign_IconMiss_C">();
	}
	static class UW_Sign_IconMiss_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Sign_IconMiss_C>();
	}
};
static_assert(alignof(UW_Sign_IconMiss_C) == 0x000010, "Wrong alignment on UW_Sign_IconMiss_C");
static_assert(sizeof(UW_Sign_IconMiss_C) == 0x0005D0, "Wrong size on UW_Sign_IconMiss_C");
static_assert(offsetof(UW_Sign_IconMiss_C, UberGraphFrame) == 0x0005B0, "Member 'UW_Sign_IconMiss_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconMiss_C, In_Icon) == 0x0005B8, "Member 'UW_Sign_IconMiss_C::In_Icon' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconMiss_C, Image_Miss) == 0x0005C0, "Member 'UW_Sign_IconMiss_C::Image_Miss' has a wrong offset!");

}

