#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Sign_IconCritical_3

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Sign_IconCritical_3.W_Sign_IconCritical_3_C
// 0x0060 (0x0670 - 0x0610)
class UW_Sign_IconCritical_3_C final : public UUISign_IconDamageBase
{
public:
	class UWidgetAnimation*                       Damage_Normal;                                     // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Damage_Down;                                       // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Damage_Up;                                         // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Damage;                                            // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Base;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Base_1;                                      // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Effect;                                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text_Damage;                                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAutoTextBlock*                         Text_Damage_Flash;                                 // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DamageValue;                                       // 0x0658(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Sign_IconCritical_3_C">();
	}
	static class UW_Sign_IconCritical_3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Sign_IconCritical_3_C>();
	}
};
static_assert(alignof(UW_Sign_IconCritical_3_C) == 0x000010, "Wrong alignment on UW_Sign_IconCritical_3_C");
static_assert(sizeof(UW_Sign_IconCritical_3_C) == 0x000670, "Wrong size on UW_Sign_IconCritical_3_C");
static_assert(offsetof(UW_Sign_IconCritical_3_C, Damage_Normal) == 0x000610, "Member 'UW_Sign_IconCritical_3_C::Damage_Normal' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconCritical_3_C, Damage_Down) == 0x000618, "Member 'UW_Sign_IconCritical_3_C::Damage_Down' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconCritical_3_C, Damage_Up) == 0x000620, "Member 'UW_Sign_IconCritical_3_C::Damage_Up' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconCritical_3_C, Damage) == 0x000628, "Member 'UW_Sign_IconCritical_3_C::Damage' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconCritical_3_C, Image_Base) == 0x000630, "Member 'UW_Sign_IconCritical_3_C::Image_Base' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconCritical_3_C, Image_Base_1) == 0x000638, "Member 'UW_Sign_IconCritical_3_C::Image_Base_1' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconCritical_3_C, Image_Effect) == 0x000640, "Member 'UW_Sign_IconCritical_3_C::Image_Effect' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconCritical_3_C, Text_Damage) == 0x000648, "Member 'UW_Sign_IconCritical_3_C::Text_Damage' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconCritical_3_C, Text_Damage_Flash) == 0x000650, "Member 'UW_Sign_IconCritical_3_C::Text_Damage_Flash' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconCritical_3_C, DamageValue) == 0x000658, "Member 'UW_Sign_IconCritical_3_C::DamageValue' has a wrong offset!");

}

