#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Sign_IconExp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Sign_IconExp.W_Sign_IconExp_C
// 0x0020 (0x05D0 - 0x05B0)
class UW_Sign_IconExp_C final : public UUISign_IconExp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       In_Out;                                            // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAutoTextBlock*                         Number;                                            // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetExpValue(int32 InValue);
	void WidgetAnimationEvt_In_Out_K2Node_WidgetAnimationEvent_0();
	void ExecuteUbergraph_W_Sign_IconExp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Sign_IconExp_C">();
	}
	static class UW_Sign_IconExp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Sign_IconExp_C>();
	}
};
static_assert(alignof(UW_Sign_IconExp_C) == 0x000010, "Wrong alignment on UW_Sign_IconExp_C");
static_assert(sizeof(UW_Sign_IconExp_C) == 0x0005D0, "Wrong size on UW_Sign_IconExp_C");
static_assert(offsetof(UW_Sign_IconExp_C, UberGraphFrame) == 0x0005B0, "Member 'UW_Sign_IconExp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconExp_C, In_Out) == 0x0005B8, "Member 'UW_Sign_IconExp_C::In_Out' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconExp_C, Number) == 0x0005C0, "Member 'UW_Sign_IconExp_C::Number' has a wrong offset!");

}

