#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Sign_IconLvup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Sign_IconLvup.W_Sign_IconLvup_C
// 0x0060 (0x0620 - 0x05C0)
class UW_Sign_IconLvup_C final : public UUISign_IconLvup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LevelUp_NoIcon;                                    // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LevelUp;                                           // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Lvup01;                                      // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Lvup02;                                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsComboUp;                                         // 0x05E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ComboTexture01;                                    // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ComboTexture02;                                    // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             LevelUpTexture01;                                  // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             LevelUpTexture02;                                  // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlayingComboUp;                                  // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Close();
	void open();
	void WidgetAnimationEvt_LevelUp_K2Node_WidgetAnimationEvent_0();
	void PlayOneShotLvUp();
	void SetData(bool IsComboUp_0);
	void ExecuteUbergraph_W_Sign_IconLvup(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Sign_IconLvup_C">();
	}
	static class UW_Sign_IconLvup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Sign_IconLvup_C>();
	}
};
static_assert(alignof(UW_Sign_IconLvup_C) == 0x000010, "Wrong alignment on UW_Sign_IconLvup_C");
static_assert(sizeof(UW_Sign_IconLvup_C) == 0x000620, "Wrong size on UW_Sign_IconLvup_C");
static_assert(offsetof(UW_Sign_IconLvup_C, UberGraphFrame) == 0x0005C0, "Member 'UW_Sign_IconLvup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconLvup_C, LevelUp_NoIcon) == 0x0005C8, "Member 'UW_Sign_IconLvup_C::LevelUp_NoIcon' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconLvup_C, LevelUp) == 0x0005D0, "Member 'UW_Sign_IconLvup_C::LevelUp' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconLvup_C, Image_Lvup01) == 0x0005D8, "Member 'UW_Sign_IconLvup_C::Image_Lvup01' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconLvup_C, Image_Lvup02) == 0x0005E0, "Member 'UW_Sign_IconLvup_C::Image_Lvup02' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconLvup_C, IsComboUp) == 0x0005E8, "Member 'UW_Sign_IconLvup_C::IsComboUp' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconLvup_C, ComboTexture01) == 0x0005F0, "Member 'UW_Sign_IconLvup_C::ComboTexture01' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconLvup_C, ComboTexture02) == 0x0005F8, "Member 'UW_Sign_IconLvup_C::ComboTexture02' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconLvup_C, LevelUpTexture01) == 0x000600, "Member 'UW_Sign_IconLvup_C::LevelUpTexture01' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconLvup_C, LevelUpTexture02) == 0x000608, "Member 'UW_Sign_IconLvup_C::LevelUpTexture02' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconLvup_C, IsPlayingComboUp) == 0x000610, "Member 'UW_Sign_IconLvup_C::IsPlayingComboUp' has a wrong offset!");

}

