#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Sign_IconRival

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Sign_IconRival.W_Sign_IconRival_C
// 0x0040 (0x05F0 - 0x05B0)
class UW_Sign_IconRival_C final : public UUISign_IconRival
{
public:
	class UWidgetAnimation*                       Wait_Off;                                          // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait_On;                                           // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Another_layer;                                     // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Mid_Icon;                                          // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Near_Icon;                                         // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Far_Icon;                                          // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Quest;                                             // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Sign_IconRival_C">();
	}
	static class UW_Sign_IconRival_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Sign_IconRival_C>();
	}
};
static_assert(alignof(UW_Sign_IconRival_C) == 0x000010, "Wrong alignment on UW_Sign_IconRival_C");
static_assert(sizeof(UW_Sign_IconRival_C) == 0x0005F0, "Wrong size on UW_Sign_IconRival_C");
static_assert(offsetof(UW_Sign_IconRival_C, Wait_Off) == 0x0005B0, "Member 'UW_Sign_IconRival_C::Wait_Off' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconRival_C, Wait_On) == 0x0005B8, "Member 'UW_Sign_IconRival_C::Wait_On' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconRival_C, Another_layer) == 0x0005C0, "Member 'UW_Sign_IconRival_C::Another_layer' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconRival_C, Mid_Icon) == 0x0005C8, "Member 'UW_Sign_IconRival_C::Mid_Icon' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconRival_C, Near_Icon) == 0x0005D0, "Member 'UW_Sign_IconRival_C::Near_Icon' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconRival_C, Far_Icon) == 0x0005D8, "Member 'UW_Sign_IconRival_C::Far_Icon' has a wrong offset!");
static_assert(offsetof(UW_Sign_IconRival_C, Quest) == 0x0005E0, "Member 'UW_Sign_IconRival_C::Quest' has a wrong offset!");

}

