#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Steal

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Steal.W_Steal_C
// 0x00A0 (0x06A0 - 0x0600)
class UW_Steal_C final : public UUISteal
{
public:
	class UWidgetAnimation*                       Wait;                                              // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Miss;                                              // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Success;                                           // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press;                                             // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0620(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Base_2;                                            // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnBase;                                           // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnBase2;                                          // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnBase2_F;                                        // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button;                                            // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Gauge;                                             // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Miss_2;                                            // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Miss_Back;                                         // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Point;                                             // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Smoke;                                             // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Success_2;                                         // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Success_Add;                                       // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Success_Back;                                      // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Steal_C">();
	}
	static class UW_Steal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Steal_C>();
	}
};
static_assert(alignof(UW_Steal_C) == 0x000010, "Wrong alignment on UW_Steal_C");
static_assert(sizeof(UW_Steal_C) == 0x0006A0, "Wrong size on UW_Steal_C");
static_assert(offsetof(UW_Steal_C, Wait) == 0x000600, "Member 'UW_Steal_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Miss) == 0x000608, "Member 'UW_Steal_C::Miss' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Success) == 0x000610, "Member 'UW_Steal_C::Success' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Press) == 0x000618, "Member 'UW_Steal_C::Press' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Out) == 0x000620, "Member 'UW_Steal_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, In) == 0x000628, "Member 'UW_Steal_C::In' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Base_2) == 0x000630, "Member 'UW_Steal_C::Base_2' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, BtnBase) == 0x000638, "Member 'UW_Steal_C::BtnBase' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, BtnBase2) == 0x000640, "Member 'UW_Steal_C::BtnBase2' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, BtnBase2_F) == 0x000648, "Member 'UW_Steal_C::BtnBase2_F' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Button) == 0x000650, "Member 'UW_Steal_C::Button' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Gauge) == 0x000658, "Member 'UW_Steal_C::Gauge' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Miss_2) == 0x000660, "Member 'UW_Steal_C::Miss_2' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Miss_Back) == 0x000668, "Member 'UW_Steal_C::Miss_Back' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Point) == 0x000670, "Member 'UW_Steal_C::Point' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Smoke) == 0x000678, "Member 'UW_Steal_C::Smoke' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Success_2) == 0x000680, "Member 'UW_Steal_C::Success_2' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Success_Add) == 0x000688, "Member 'UW_Steal_C::Success_Add' has a wrong offset!");
static_assert(offsetof(UW_Steal_C, Success_Back) == 0x000690, "Member 'UW_Steal_C::Success_Back' has a wrong offset!");

}

