#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Staff_Roll_Root

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Staff_Roll_Root.W_Staff_Roll_Root_C
// 0x0018 (0x04E8 - 0x04D0)
class UW_Staff_Roll_Root_C final : public UUIStaff_Roll_Root
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BK;                                                // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Staff_Roll_Root_C">();
	}
	static class UW_Staff_Roll_Root_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Staff_Roll_Root_C>();
	}
};
static_assert(alignof(UW_Staff_Roll_Root_C) == 0x000008, "Wrong alignment on UW_Staff_Roll_Root_C");
static_assert(sizeof(UW_Staff_Roll_Root_C) == 0x0004E8, "Wrong size on UW_Staff_Roll_Root_C");
static_assert(offsetof(UW_Staff_Roll_Root_C, Out) == 0x0004D0, "Member 'UW_Staff_Roll_Root_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Staff_Roll_Root_C, In) == 0x0004D8, "Member 'UW_Staff_Roll_Root_C::In' has a wrong offset!");
static_assert(offsetof(UW_Staff_Roll_Root_C, BK) == 0x0004E0, "Member 'UW_Staff_Roll_Root_C::BK' has a wrong offset!");

}

