#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Talk_Arrow

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Talk_Arrow.W_Talk_Arrow_C
// 0x0020 (0x04B8 - 0x0498)
class UW_Talk_Arrow_C final : public UUITalk_Arrow
{
public:
	class UWidgetAnimation*                       Page_End;                                          // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Page_Next;                                         // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 arrow;                                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bar;                                               // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Talk_Arrow_C">();
	}
	static class UW_Talk_Arrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Talk_Arrow_C>();
	}
};
static_assert(alignof(UW_Talk_Arrow_C) == 0x000008, "Wrong alignment on UW_Talk_Arrow_C");
static_assert(sizeof(UW_Talk_Arrow_C) == 0x0004B8, "Wrong size on UW_Talk_Arrow_C");
static_assert(offsetof(UW_Talk_Arrow_C, Page_End) == 0x000498, "Member 'UW_Talk_Arrow_C::Page_End' has a wrong offset!");
static_assert(offsetof(UW_Talk_Arrow_C, Page_Next) == 0x0004A0, "Member 'UW_Talk_Arrow_C::Page_Next' has a wrong offset!");
static_assert(offsetof(UW_Talk_Arrow_C, arrow) == 0x0004A8, "Member 'UW_Talk_Arrow_C::arrow' has a wrong offset!");
static_assert(offsetof(UW_Talk_Arrow_C, Bar) == 0x0004B0, "Member 'UW_Talk_Arrow_C::Bar' has a wrong offset!");

}

