#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Talk_BtnChoice

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Talk_BtnChoice.W_Talk_BtnChoice_C
// 0x0090 (0x05E0 - 0x0550)
class alignas(0x10) UW_Talk_BtnChoice_C final : public UUITalk_BtnChoice
{
public:
	class UWidgetAnimation*                       Off_New;                                           // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       On_New;                                            // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       off;                                               // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       on;                                                // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Choice;                                            // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Slide_in;                                          // 0x0580(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Slide_Out;                                         // 0x0588(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ChoiceBase_01;                                     // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChoiceBase_02;                                     // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_Add;                                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cursor_Nomal;                                      // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_New;                                          // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Baceicon;                                    // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Button;                                      // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_SideScrollTextWidget_C*              W_SideScrollTextWidget;                            // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TextWidget_C*                        W_TextWidget;                                      // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Talk_BtnChoice_C">();
	}
	static class UW_Talk_BtnChoice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Talk_BtnChoice_C>();
	}
};
static_assert(alignof(UW_Talk_BtnChoice_C) == 0x000010, "Wrong alignment on UW_Talk_BtnChoice_C");
static_assert(sizeof(UW_Talk_BtnChoice_C) == 0x0005E0, "Wrong size on UW_Talk_BtnChoice_C");
static_assert(offsetof(UW_Talk_BtnChoice_C, Off_New) == 0x000550, "Member 'UW_Talk_BtnChoice_C::Off_New' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, On_New) == 0x000558, "Member 'UW_Talk_BtnChoice_C::On_New' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, off) == 0x000560, "Member 'UW_Talk_BtnChoice_C::off' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, Wait) == 0x000568, "Member 'UW_Talk_BtnChoice_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, on) == 0x000570, "Member 'UW_Talk_BtnChoice_C::on' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, Choice) == 0x000578, "Member 'UW_Talk_BtnChoice_C::Choice' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, Slide_in) == 0x000580, "Member 'UW_Talk_BtnChoice_C::Slide_in' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, Slide_Out) == 0x000588, "Member 'UW_Talk_BtnChoice_C::Slide_Out' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, ChoiceBase_01) == 0x000590, "Member 'UW_Talk_BtnChoice_C::ChoiceBase_01' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, ChoiceBase_02) == 0x000598, "Member 'UW_Talk_BtnChoice_C::ChoiceBase_02' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, Cursor_Add) == 0x0005A0, "Member 'UW_Talk_BtnChoice_C::Cursor_Add' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, Cursor_Nomal) == 0x0005A8, "Member 'UW_Talk_BtnChoice_C::Cursor_Nomal' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, Icon_New) == 0x0005B0, "Member 'UW_Talk_BtnChoice_C::Icon_New' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, Image_Baceicon) == 0x0005B8, "Member 'UW_Talk_BtnChoice_C::Image_Baceicon' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, Image_Button) == 0x0005C0, "Member 'UW_Talk_BtnChoice_C::Image_Button' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, Image_Icon) == 0x0005C8, "Member 'UW_Talk_BtnChoice_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, W_SideScrollTextWidget) == 0x0005D0, "Member 'UW_Talk_BtnChoice_C::W_SideScrollTextWidget' has a wrong offset!");
static_assert(offsetof(UW_Talk_BtnChoice_C, W_TextWidget) == 0x0005D8, "Member 'UW_Talk_BtnChoice_C::W_TextWidget' has a wrong offset!");

}

