#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Talk_WinStatus

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Talk_WinStatus.W_Talk_WinStatus_C
// 0x0060 (0x0720 - 0x06C0)
class UW_Talk_WinStatus_C final : public UUITalk_WinStatus
{
public:
	class UWidgetAnimation*                       Close_Talk;                                        // 0x06C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open_Talk;                                         // 0x06C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Talker;                                // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Character;                                   // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Narration;                                   // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NoName;                                      // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Speech;                                      // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Speech_1;                                    // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Speech_2;                                    // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Speech_3;                                    // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Talk_Arrow_C*                        W_Talk_Arrow;                                      // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TextWidget_C*                        W_TextWidget;                                      // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Talk_WinStatus_C">();
	}
	static class UW_Talk_WinStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Talk_WinStatus_C>();
	}
};
static_assert(alignof(UW_Talk_WinStatus_C) == 0x000008, "Wrong alignment on UW_Talk_WinStatus_C");
static_assert(sizeof(UW_Talk_WinStatus_C) == 0x000720, "Wrong size on UW_Talk_WinStatus_C");
static_assert(offsetof(UW_Talk_WinStatus_C, Close_Talk) == 0x0006C0, "Member 'UW_Talk_WinStatus_C::Close_Talk' has a wrong offset!");
static_assert(offsetof(UW_Talk_WinStatus_C, Open_Talk) == 0x0006C8, "Member 'UW_Talk_WinStatus_C::Open_Talk' has a wrong offset!");
static_assert(offsetof(UW_Talk_WinStatus_C, CanvasPanel_Talker) == 0x0006D0, "Member 'UW_Talk_WinStatus_C::CanvasPanel_Talker' has a wrong offset!");
static_assert(offsetof(UW_Talk_WinStatus_C, Image_Character) == 0x0006D8, "Member 'UW_Talk_WinStatus_C::Image_Character' has a wrong offset!");
static_assert(offsetof(UW_Talk_WinStatus_C, Image_Narration) == 0x0006E0, "Member 'UW_Talk_WinStatus_C::Image_Narration' has a wrong offset!");
static_assert(offsetof(UW_Talk_WinStatus_C, Image_NoName) == 0x0006E8, "Member 'UW_Talk_WinStatus_C::Image_NoName' has a wrong offset!");
static_assert(offsetof(UW_Talk_WinStatus_C, Image_Speech) == 0x0006F0, "Member 'UW_Talk_WinStatus_C::Image_Speech' has a wrong offset!");
static_assert(offsetof(UW_Talk_WinStatus_C, Image_Speech_1) == 0x0006F8, "Member 'UW_Talk_WinStatus_C::Image_Speech_1' has a wrong offset!");
static_assert(offsetof(UW_Talk_WinStatus_C, Image_Speech_2) == 0x000700, "Member 'UW_Talk_WinStatus_C::Image_Speech_2' has a wrong offset!");
static_assert(offsetof(UW_Talk_WinStatus_C, Image_Speech_3) == 0x000708, "Member 'UW_Talk_WinStatus_C::Image_Speech_3' has a wrong offset!");
static_assert(offsetof(UW_Talk_WinStatus_C, W_Talk_Arrow) == 0x000710, "Member 'UW_Talk_WinStatus_C::W_Talk_Arrow' has a wrong offset!");
static_assert(offsetof(UW_Talk_WinStatus_C, W_TextWidget) == 0x000718, "Member 'UW_Talk_WinStatus_C::W_TextWidget' has a wrong offset!");

}

