#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Title_Button_00

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Title_Button_00.W_Title_Button_00_C
// 0x0018 (0x04B0 - 0x0498)
class UW_Title_Button_00_C final : public UUITitle_Button_00
{
public:
	class UWidgetAnimation*                       off;                                               // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Wait;                                              // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Title_Button_00_C">();
	}
	static class UW_Title_Button_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Title_Button_00_C>();
	}
};
static_assert(alignof(UW_Title_Button_00_C) == 0x000008, "Wrong alignment on UW_Title_Button_00_C");
static_assert(sizeof(UW_Title_Button_00_C) == 0x0004B0, "Wrong size on UW_Title_Button_00_C");
static_assert(offsetof(UW_Title_Button_00_C, off) == 0x000498, "Member 'UW_Title_Button_00_C::off' has a wrong offset!");
static_assert(offsetof(UW_Title_Button_00_C, Wait) == 0x0004A0, "Member 'UW_Title_Button_00_C::Wait' has a wrong offset!");
static_assert(offsetof(UW_Title_Button_00_C, In) == 0x0004A8, "Member 'UW_Title_Button_00_C::In' has a wrong offset!");

}

