#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TopBar_10

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TopBar_10.W_TopBar_10_C
// 0x0088 (0x0580 - 0x04F8)
class UW_TopBar_10_C final : public UUITopbar_10
{
public:
	class UWidgetAnimation*                       PageLR_On;                                         // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PageLR_Off;                                        // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Page_Slide_02;                                     // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Page_Slide_01;                                     // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       R_Key_On;                                          // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       L_Key_On;                                          // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CenterBase;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 L_Arrow_1;                                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 L_Key;                                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenu_Page_01_C*                        Menu_Page_01;                                      // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenu_Page_01_C*                        Menu_Page_02;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenu_Page_01_C*                        Menu_Page_03;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenu_Page_01_C*                        Menu_Page_04;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 R_Arrow_1;                                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 R_Key;                                             // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_TopBar_10_C">();
	}
	static class UW_TopBar_10_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TopBar_10_C>();
	}
};
static_assert(alignof(UW_TopBar_10_C) == 0x000008, "Wrong alignment on UW_TopBar_10_C");
static_assert(sizeof(UW_TopBar_10_C) == 0x000580, "Wrong size on UW_TopBar_10_C");
static_assert(offsetof(UW_TopBar_10_C, PageLR_On) == 0x0004F8, "Member 'UW_TopBar_10_C::PageLR_On' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, PageLR_Off) == 0x000500, "Member 'UW_TopBar_10_C::PageLR_Off' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, Out) == 0x000508, "Member 'UW_TopBar_10_C::Out' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, In) == 0x000510, "Member 'UW_TopBar_10_C::In' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, Page_Slide_02) == 0x000518, "Member 'UW_TopBar_10_C::Page_Slide_02' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, Page_Slide_01) == 0x000520, "Member 'UW_TopBar_10_C::Page_Slide_01' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, R_Key_On) == 0x000528, "Member 'UW_TopBar_10_C::R_Key_On' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, L_Key_On) == 0x000530, "Member 'UW_TopBar_10_C::L_Key_On' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, CenterBase) == 0x000538, "Member 'UW_TopBar_10_C::CenterBase' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, L_Arrow_1) == 0x000540, "Member 'UW_TopBar_10_C::L_Arrow_1' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, L_Key) == 0x000548, "Member 'UW_TopBar_10_C::L_Key' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, Menu_Page_01) == 0x000550, "Member 'UW_TopBar_10_C::Menu_Page_01' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, Menu_Page_02) == 0x000558, "Member 'UW_TopBar_10_C::Menu_Page_02' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, Menu_Page_03) == 0x000560, "Member 'UW_TopBar_10_C::Menu_Page_03' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, Menu_Page_04) == 0x000568, "Member 'UW_TopBar_10_C::Menu_Page_04' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, R_Arrow_1) == 0x000570, "Member 'UW_TopBar_10_C::R_Arrow_1' has a wrong offset!");
static_assert(offsetof(UW_TopBar_10_C, R_Key) == 0x000578, "Member 'UW_TopBar_10_C::R_Key' has a wrong offset!");

}

