#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TreasureDetails_Page_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TreasureDetails_Page_01.W_TreasureDetails_Page_01_C
// 0x0048 (0x0560 - 0x0518)
class UW_TreasureDetails_Page_01_C final : public UUITreasureDetails_Page01
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ScrollBase_01;                                     // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBase_02;                                     // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MonsterDict_Content_10_C*            W_MonsterDict_Content_10;                          // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MonsterDict_Content_15_C*            W_MonsterDict_Content_15;                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MonsterDict_Content_16_C*            W_MonsterDict_Content_16;                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MonsterDict_Content_02_C*            W_MonsterDict_Content_02_1;                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Content_01_C*        W_TreasureDetails_Content_01;                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_TreasureDetails_Page_01_C">();
	}
	static class UW_TreasureDetails_Page_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TreasureDetails_Page_01_C>();
	}
};
static_assert(alignof(UW_TreasureDetails_Page_01_C) == 0x000008, "Wrong alignment on UW_TreasureDetails_Page_01_C");
static_assert(sizeof(UW_TreasureDetails_Page_01_C) == 0x000560, "Wrong size on UW_TreasureDetails_Page_01_C");
static_assert(offsetof(UW_TreasureDetails_Page_01_C, Out) == 0x000518, "Member 'UW_TreasureDetails_Page_01_C::Out' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_01_C, In) == 0x000520, "Member 'UW_TreasureDetails_Page_01_C::In' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_01_C, ScrollBase_01) == 0x000528, "Member 'UW_TreasureDetails_Page_01_C::ScrollBase_01' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_01_C, ScrollBase_02) == 0x000530, "Member 'UW_TreasureDetails_Page_01_C::ScrollBase_02' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_01_C, W_MonsterDict_Content_10) == 0x000538, "Member 'UW_TreasureDetails_Page_01_C::W_MonsterDict_Content_10' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_01_C, W_MonsterDict_Content_15) == 0x000540, "Member 'UW_TreasureDetails_Page_01_C::W_MonsterDict_Content_15' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_01_C, W_MonsterDict_Content_16) == 0x000548, "Member 'UW_TreasureDetails_Page_01_C::W_MonsterDict_Content_16' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_01_C, W_MonsterDict_Content_02_1) == 0x000550, "Member 'UW_TreasureDetails_Page_01_C::W_MonsterDict_Content_02_1' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_01_C, W_TreasureDetails_Content_01) == 0x000558, "Member 'UW_TreasureDetails_Page_01_C::W_TreasureDetails_Content_01' has a wrong offset!");

}

