#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TreasureDetails_Page_02

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TreasureDetails_Page_02.W_TreasureDetails_Page_02_C
// 0x0058 (0x05B8 - 0x0560)
class UW_TreasureDetails_Page_02_C final : public UUITreasureDetails_Page02
{
public:
	class UWidgetAnimation*                       Effect_Off;                                        // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0568(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0570(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Effect_GoodStatus;                                 // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBase_01;                                     // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBase_02;                                     // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MonsterDict_Content_02_C*            W_MonsterDict_Content_02_1;                        // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MonsterDict_Content_02_C*            W_MonsterDict_Content_02_2;                        // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MonsterDict_Content_04_C*            W_MonsterDict_Content_04;                          // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MonsterDict_Content_07_C*            W_MonsterDict_Content_07_1;                        // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MonsterDict_Content_07_C*            W_MonsterDict_Content_07_2;                        // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_TreasureDetails_Page_02_C">();
	}
	static class UW_TreasureDetails_Page_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TreasureDetails_Page_02_C>();
	}
};
static_assert(alignof(UW_TreasureDetails_Page_02_C) == 0x000008, "Wrong alignment on UW_TreasureDetails_Page_02_C");
static_assert(sizeof(UW_TreasureDetails_Page_02_C) == 0x0005B8, "Wrong size on UW_TreasureDetails_Page_02_C");
static_assert(offsetof(UW_TreasureDetails_Page_02_C, Effect_Off) == 0x000560, "Member 'UW_TreasureDetails_Page_02_C::Effect_Off' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_02_C, Out) == 0x000568, "Member 'UW_TreasureDetails_Page_02_C::Out' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_02_C, In) == 0x000570, "Member 'UW_TreasureDetails_Page_02_C::In' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_02_C, Effect_GoodStatus) == 0x000578, "Member 'UW_TreasureDetails_Page_02_C::Effect_GoodStatus' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_02_C, ScrollBase_01) == 0x000580, "Member 'UW_TreasureDetails_Page_02_C::ScrollBase_01' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_02_C, ScrollBase_02) == 0x000588, "Member 'UW_TreasureDetails_Page_02_C::ScrollBase_02' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_02_C, W_MonsterDict_Content_02_1) == 0x000590, "Member 'UW_TreasureDetails_Page_02_C::W_MonsterDict_Content_02_1' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_02_C, W_MonsterDict_Content_02_2) == 0x000598, "Member 'UW_TreasureDetails_Page_02_C::W_MonsterDict_Content_02_2' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_02_C, W_MonsterDict_Content_04) == 0x0005A0, "Member 'UW_TreasureDetails_Page_02_C::W_MonsterDict_Content_04' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_02_C, W_MonsterDict_Content_07_1) == 0x0005A8, "Member 'UW_TreasureDetails_Page_02_C::W_MonsterDict_Content_07_1' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_02_C, W_MonsterDict_Content_07_2) == 0x0005B0, "Member 'UW_TreasureDetails_Page_02_C::W_MonsterDict_Content_07_2' has a wrong offset!");

}

