#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TreasureDetails_ContentMenu

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TreasureDetails_ContentMenu.W_TreasureDetails_ContentMenu_C
// 0x00B0 (0x08F0 - 0x0840)
class UW_TreasureDetails_ContentMenu_C final : public UUITreasureDetails_ContentMenu
{
public:
	class UWidgetAnimation*                       W_Darkness_Off;                                    // 0x0840(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       W_Darkness_On;                                     // 0x0848(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TreasureSetIcon_Only;                              // 0x0850(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TreasureSetIcons;                                  // 0x0858(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0860(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0868(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Category_Icon;                                     // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_23;                                          // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Lock_Icon;                                         // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NameBase;                                          // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Official_Icon;                                     // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Replica_Icon;                                      // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x08A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Treasure_SetIcon;                                  // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDarwinArtifactTwoCaptureImage*         TreasureCaptureImage;                              // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Darkness_C*                          W_Darkness;                                        // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PartyMenu_BG_C*                      W_PartyMenu_BG;                                    // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TopBar_00_C*                         W_TopBar_00;                                       // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Page_01_C*           W_TreasureDetails_Page_01;                         // 0x08D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Page_02_C*           W_TreasureDetails_Page_02;                         // 0x08D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Page_03_C*           W_TreasureDetails_Page_03;                         // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Under_Button_C*                      W_Under_Button;                                    // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_TreasureDetails_ContentMenu_C">();
	}
	static class UW_TreasureDetails_ContentMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TreasureDetails_ContentMenu_C>();
	}
};
static_assert(alignof(UW_TreasureDetails_ContentMenu_C) == 0x000010, "Wrong alignment on UW_TreasureDetails_ContentMenu_C");
static_assert(sizeof(UW_TreasureDetails_ContentMenu_C) == 0x0008F0, "Wrong size on UW_TreasureDetails_ContentMenu_C");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, W_Darkness_Off) == 0x000840, "Member 'UW_TreasureDetails_ContentMenu_C::W_Darkness_Off' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, W_Darkness_On) == 0x000848, "Member 'UW_TreasureDetails_ContentMenu_C::W_Darkness_On' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, TreasureSetIcon_Only) == 0x000850, "Member 'UW_TreasureDetails_ContentMenu_C::TreasureSetIcon_Only' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, TreasureSetIcons) == 0x000858, "Member 'UW_TreasureDetails_ContentMenu_C::TreasureSetIcons' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, Out) == 0x000860, "Member 'UW_TreasureDetails_ContentMenu_C::Out' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, In) == 0x000868, "Member 'UW_TreasureDetails_ContentMenu_C::In' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, Category_Icon) == 0x000870, "Member 'UW_TreasureDetails_ContentMenu_C::Category_Icon' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, Image_23) == 0x000878, "Member 'UW_TreasureDetails_ContentMenu_C::Image_23' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, Lock_Icon) == 0x000880, "Member 'UW_TreasureDetails_ContentMenu_C::Lock_Icon' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, NameBase) == 0x000888, "Member 'UW_TreasureDetails_ContentMenu_C::NameBase' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, Official_Icon) == 0x000890, "Member 'UW_TreasureDetails_ContentMenu_C::Official_Icon' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, Replica_Icon) == 0x000898, "Member 'UW_TreasureDetails_ContentMenu_C::Replica_Icon' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, Shadow) == 0x0008A0, "Member 'UW_TreasureDetails_ContentMenu_C::Shadow' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, Treasure_SetIcon) == 0x0008A8, "Member 'UW_TreasureDetails_ContentMenu_C::Treasure_SetIcon' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, TreasureCaptureImage) == 0x0008B0, "Member 'UW_TreasureDetails_ContentMenu_C::TreasureCaptureImage' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, W_Darkness) == 0x0008B8, "Member 'UW_TreasureDetails_ContentMenu_C::W_Darkness' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, W_PartyMenu_BG) == 0x0008C0, "Member 'UW_TreasureDetails_ContentMenu_C::W_PartyMenu_BG' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, W_TopBar_00) == 0x0008C8, "Member 'UW_TreasureDetails_ContentMenu_C::W_TopBar_00' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, W_TreasureDetails_Page_01) == 0x0008D0, "Member 'UW_TreasureDetails_ContentMenu_C::W_TreasureDetails_Page_01' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, W_TreasureDetails_Page_02) == 0x0008D8, "Member 'UW_TreasureDetails_ContentMenu_C::W_TreasureDetails_Page_02' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, W_TreasureDetails_Page_03) == 0x0008E0, "Member 'UW_TreasureDetails_ContentMenu_C::W_TreasureDetails_Page_03' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_ContentMenu_C, W_Under_Button) == 0x0008E8, "Member 'UW_TreasureDetails_ContentMenu_C::W_Under_Button' has a wrong offset!");

}

