#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TreasureHouse_Table

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TreasureHouse_Table.W_TreasureHouse_Table_C
// 0x0040 (0x0760 - 0x0720)
class UW_TreasureHouse_Table_C final : public UUITreasureHouse_Table
{
public:
	class UWidgetAnimation*                       Text_Out;                                          // 0x0720(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0728(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0730(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_Commonmenu_04_C*                     W_Commonmenu_04;                                   // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_LeftMenu_8_C*                        W_LeftMenu;                                        // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Under_Button_C*                      W_Under_Button;                                    // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_TreasureHouse_Table_C">();
	}
	static class UW_TreasureHouse_Table_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TreasureHouse_Table_C>();
	}
};
static_assert(alignof(UW_TreasureHouse_Table_C) == 0x000010, "Wrong alignment on UW_TreasureHouse_Table_C");
static_assert(sizeof(UW_TreasureHouse_Table_C) == 0x000760, "Wrong size on UW_TreasureHouse_Table_C");
static_assert(offsetof(UW_TreasureHouse_Table_C, Text_Out) == 0x000720, "Member 'UW_TreasureHouse_Table_C::Text_Out' has a wrong offset!");
static_assert(offsetof(UW_TreasureHouse_Table_C, Out) == 0x000728, "Member 'UW_TreasureHouse_Table_C::Out' has a wrong offset!");
static_assert(offsetof(UW_TreasureHouse_Table_C, In) == 0x000730, "Member 'UW_TreasureHouse_Table_C::In' has a wrong offset!");
static_assert(offsetof(UW_TreasureHouse_Table_C, W_Commonmenu_04) == 0x000738, "Member 'UW_TreasureHouse_Table_C::W_Commonmenu_04' has a wrong offset!");
static_assert(offsetof(UW_TreasureHouse_Table_C, W_LeftMenu) == 0x000740, "Member 'UW_TreasureHouse_Table_C::W_LeftMenu' has a wrong offset!");
static_assert(offsetof(UW_TreasureHouse_Table_C, W_Menu_IconArrow) == 0x000748, "Member 'UW_TreasureHouse_Table_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_TreasureHouse_Table_C, W_Under_Button) == 0x000750, "Member 'UW_TreasureHouse_Table_C::W_Under_Button' has a wrong offset!");

}

