#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TreasureDetails_Page_03

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TreasureDetails_Page_03.W_TreasureDetails_Page_03_C
// 0x00E0 (0x05D0 - 0x04F0)
class UW_TreasureDetails_Page_03_C final : public UUITreasureDetails_Page03
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Buymenu_DescriptionBase;                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ContentBase;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_10;                                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_11;                                            // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_12;                                            // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_13;                                            // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_14;                                            // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_15;                                            // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_16;                                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_17;                                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_18;                                            // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_19;                                            // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_20;                                            // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_00;                                            // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_01;                                            // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_02;                                            // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_03;                                            // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_04;                                            // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_05;                                            // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_06;                                            // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_07;                                            // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_08;                                            // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TreasureDetails_Log_C*               Log_09;                                            // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBase_01;                                     // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBase_02;                                     // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleIcon_1;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_TreasureDetails_Page_03_C">();
	}
	static class UW_TreasureDetails_Page_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TreasureDetails_Page_03_C>();
	}
};
static_assert(alignof(UW_TreasureDetails_Page_03_C) == 0x000008, "Wrong alignment on UW_TreasureDetails_Page_03_C");
static_assert(sizeof(UW_TreasureDetails_Page_03_C) == 0x0005D0, "Wrong size on UW_TreasureDetails_Page_03_C");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Out) == 0x0004F0, "Member 'UW_TreasureDetails_Page_03_C::Out' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, In) == 0x0004F8, "Member 'UW_TreasureDetails_Page_03_C::In' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Buymenu_DescriptionBase) == 0x000500, "Member 'UW_TreasureDetails_Page_03_C::Buymenu_DescriptionBase' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, ContentBase) == 0x000508, "Member 'UW_TreasureDetails_Page_03_C::ContentBase' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_10) == 0x000510, "Member 'UW_TreasureDetails_Page_03_C::Log_10' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_11) == 0x000518, "Member 'UW_TreasureDetails_Page_03_C::Log_11' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_12) == 0x000520, "Member 'UW_TreasureDetails_Page_03_C::Log_12' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_13) == 0x000528, "Member 'UW_TreasureDetails_Page_03_C::Log_13' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_14) == 0x000530, "Member 'UW_TreasureDetails_Page_03_C::Log_14' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_15) == 0x000538, "Member 'UW_TreasureDetails_Page_03_C::Log_15' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_16) == 0x000540, "Member 'UW_TreasureDetails_Page_03_C::Log_16' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_17) == 0x000548, "Member 'UW_TreasureDetails_Page_03_C::Log_17' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_18) == 0x000550, "Member 'UW_TreasureDetails_Page_03_C::Log_18' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_19) == 0x000558, "Member 'UW_TreasureDetails_Page_03_C::Log_19' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_20) == 0x000560, "Member 'UW_TreasureDetails_Page_03_C::Log_20' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_00) == 0x000568, "Member 'UW_TreasureDetails_Page_03_C::Log_00' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_01) == 0x000570, "Member 'UW_TreasureDetails_Page_03_C::Log_01' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_02) == 0x000578, "Member 'UW_TreasureDetails_Page_03_C::Log_02' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_03) == 0x000580, "Member 'UW_TreasureDetails_Page_03_C::Log_03' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_04) == 0x000588, "Member 'UW_TreasureDetails_Page_03_C::Log_04' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_05) == 0x000590, "Member 'UW_TreasureDetails_Page_03_C::Log_05' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_06) == 0x000598, "Member 'UW_TreasureDetails_Page_03_C::Log_06' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_07) == 0x0005A0, "Member 'UW_TreasureDetails_Page_03_C::Log_07' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_08) == 0x0005A8, "Member 'UW_TreasureDetails_Page_03_C::Log_08' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, Log_09) == 0x0005B0, "Member 'UW_TreasureDetails_Page_03_C::Log_09' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, ScrollBase_01) == 0x0005B8, "Member 'UW_TreasureDetails_Page_03_C::ScrollBase_01' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, ScrollBase_02) == 0x0005C0, "Member 'UW_TreasureDetails_Page_03_C::ScrollBase_02' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Page_03_C, TitleIcon_1) == 0x0005C8, "Member 'UW_TreasureDetails_Page_03_C::TitleIcon_1' has a wrong offset!");

}

