#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TreasureDetails_Content_01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TreasureDetails_Content_01.W_TreasureDetails_Content_01_C
// 0x0018 (0x04B8 - 0x04A0)
class UW_TreasureDetails_Content_01_C final : public UUITreasureDetails_Content01
{
public:
	class UImage*                                 Buymenu_DescriptionBase_02;                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ContentBase;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleIcon;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_TreasureDetails_Content_01_C">();
	}
	static class UW_TreasureDetails_Content_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TreasureDetails_Content_01_C>();
	}
};
static_assert(alignof(UW_TreasureDetails_Content_01_C) == 0x000008, "Wrong alignment on UW_TreasureDetails_Content_01_C");
static_assert(sizeof(UW_TreasureDetails_Content_01_C) == 0x0004B8, "Wrong size on UW_TreasureDetails_Content_01_C");
static_assert(offsetof(UW_TreasureDetails_Content_01_C, Buymenu_DescriptionBase_02) == 0x0004A0, "Member 'UW_TreasureDetails_Content_01_C::Buymenu_DescriptionBase_02' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Content_01_C, ContentBase) == 0x0004A8, "Member 'UW_TreasureDetails_Content_01_C::ContentBase' has a wrong offset!");
static_assert(offsetof(UW_TreasureDetails_Content_01_C, TitleIcon) == 0x0004B0, "Member 'UW_TreasureDetails_Content_01_C::TitleIcon' has a wrong offset!");

}

