#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TsutosaGauge

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_TsutosaGauge.W_TsutosaGauge_C.ExecuteUbergraph_W_TsutosaGauge
// 0x0020 (0x0020 - 0x0000)
struct W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Param;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_MaxParam;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge) == 0x000008, "Wrong alignment on W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge");
static_assert(sizeof(W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge) == 0x000020, "Wrong size on W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge");
static_assert(offsetof(W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge, EntryPoint) == 0x000000, "Member 'W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge, K2Node_CustomEvent_Param) == 0x000004, "Member 'W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge::K2Node_CustomEvent_Param' has a wrong offset!");
static_assert(offsetof(W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge, K2Node_CustomEvent_MaxParam) == 0x000008, "Member 'W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge::K2Node_CustomEvent_MaxParam' has a wrong offset!");
static_assert(offsetof(W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'W_TsutosaGauge_C_ExecuteUbergraph_W_TsutosaGauge::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function W_TsutosaGauge.W_TsutosaGauge_C.SetGauge
// 0x0008 (0x0008 - 0x0000)
struct W_TsutosaGauge_C_SetGauge final
{
public:
	float                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxParam;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_TsutosaGauge_C_SetGauge) == 0x000004, "Wrong alignment on W_TsutosaGauge_C_SetGauge");
static_assert(sizeof(W_TsutosaGauge_C_SetGauge) == 0x000008, "Wrong size on W_TsutosaGauge_C_SetGauge");
static_assert(offsetof(W_TsutosaGauge_C_SetGauge, Param) == 0x000000, "Member 'W_TsutosaGauge_C_SetGauge::Param' has a wrong offset!");
static_assert(offsetof(W_TsutosaGauge_C_SetGauge, MaxParam) == 0x000004, "Member 'W_TsutosaGauge_C_SetGauge::MaxParam' has a wrong offset!");

}

