#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UnknownArtifact_Hub

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_UnknownArtifact_Hub.W_UnknownArtifact_Hub_C
// 0x0030 (0x04C8 - 0x0498)
class UW_UnknownArtifact_Hub_C final : public UUIUnknownArtifact_Hub
{
public:
	class UImage*                                 FlagIcon_1;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hub_FlagIconShadow;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hub_teamBase;                                      // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Official_Icon;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Pole_1;                                            // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextBase;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_UnknownArtifact_Hub_C">();
	}
	static class UW_UnknownArtifact_Hub_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_UnknownArtifact_Hub_C>();
	}
};
static_assert(alignof(UW_UnknownArtifact_Hub_C) == 0x000008, "Wrong alignment on UW_UnknownArtifact_Hub_C");
static_assert(sizeof(UW_UnknownArtifact_Hub_C) == 0x0004C8, "Wrong size on UW_UnknownArtifact_Hub_C");
static_assert(offsetof(UW_UnknownArtifact_Hub_C, FlagIcon_1) == 0x000498, "Member 'UW_UnknownArtifact_Hub_C::FlagIcon_1' has a wrong offset!");
static_assert(offsetof(UW_UnknownArtifact_Hub_C, Hub_FlagIconShadow) == 0x0004A0, "Member 'UW_UnknownArtifact_Hub_C::Hub_FlagIconShadow' has a wrong offset!");
static_assert(offsetof(UW_UnknownArtifact_Hub_C, Hub_teamBase) == 0x0004A8, "Member 'UW_UnknownArtifact_Hub_C::Hub_teamBase' has a wrong offset!");
static_assert(offsetof(UW_UnknownArtifact_Hub_C, Official_Icon) == 0x0004B0, "Member 'UW_UnknownArtifact_Hub_C::Official_Icon' has a wrong offset!");
static_assert(offsetof(UW_UnknownArtifact_Hub_C, Pole_1) == 0x0004B8, "Member 'UW_UnknownArtifact_Hub_C::Pole_1' has a wrong offset!");
static_assert(offsetof(UW_UnknownArtifact_Hub_C, TextBase) == 0x0004C0, "Member 'UW_UnknownArtifact_Hub_C::TextBase' has a wrong offset!");

}

