#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_UnknownArtifact_eff01

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_UnknownArtifact_eff01.W_UnknownArtifact_eff01_C
// 0x0018 (0x0508 - 0x04F0)
class UW_UnknownArtifact_eff01_C final : public UUIUnknownArtifact_Eff01
{
public:
	class UWidgetAnimation*                       Play;                                              // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Eff01;                                             // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff02;                                             // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_UnknownArtifact_eff01_C">();
	}
	static class UW_UnknownArtifact_eff01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_UnknownArtifact_eff01_C>();
	}
};
static_assert(alignof(UW_UnknownArtifact_eff01_C) == 0x000008, "Wrong alignment on UW_UnknownArtifact_eff01_C");
static_assert(sizeof(UW_UnknownArtifact_eff01_C) == 0x000508, "Wrong size on UW_UnknownArtifact_eff01_C");
static_assert(offsetof(UW_UnknownArtifact_eff01_C, Play) == 0x0004F0, "Member 'UW_UnknownArtifact_eff01_C::Play' has a wrong offset!");
static_assert(offsetof(UW_UnknownArtifact_eff01_C, Eff01) == 0x0004F8, "Member 'UW_UnknownArtifact_eff01_C::Eff01' has a wrong offset!");
static_assert(offsetof(UW_UnknownArtifact_eff01_C, Eff02) == 0x000500, "Member 'UW_UnknownArtifact_eff01_C::Eff02' has a wrong offset!");

}

