#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Vision_Select

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Vision_Select.W_Vision_Select_C
// 0x0020 (0x0610 - 0x05F0)
class UW_Vision_Select_C final : public UUIVision_Select
{
public:
	class UImage*                                 IconBase;                                          // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Vision_MonsterIcon_C*                W_Vision_MonsterIcon_01;                           // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Vision_MonsterIcon_C*                W_Vision_MonsterIcon_02;                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Vision_MonsterIcon_C*                W_Vision_MonsterIcon_03;                           // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Vision_Select_C">();
	}
	static class UW_Vision_Select_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Vision_Select_C>();
	}
};
static_assert(alignof(UW_Vision_Select_C) == 0x000008, "Wrong alignment on UW_Vision_Select_C");
static_assert(sizeof(UW_Vision_Select_C) == 0x000610, "Wrong size on UW_Vision_Select_C");
static_assert(offsetof(UW_Vision_Select_C, IconBase) == 0x0005F0, "Member 'UW_Vision_Select_C::IconBase' has a wrong offset!");
static_assert(offsetof(UW_Vision_Select_C, W_Vision_MonsterIcon_01) == 0x0005F8, "Member 'UW_Vision_Select_C::W_Vision_MonsterIcon_01' has a wrong offset!");
static_assert(offsetof(UW_Vision_Select_C, W_Vision_MonsterIcon_02) == 0x000600, "Member 'UW_Vision_Select_C::W_Vision_MonsterIcon_02' has a wrong offset!");
static_assert(offsetof(UW_Vision_Select_C, W_Vision_MonsterIcon_03) == 0x000608, "Member 'UW_Vision_Select_C::W_Vision_MonsterIcon_03' has a wrong offset!");

}

