#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Vision

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Vision.W_Vision_C
// 0x0088 (0x0578 - 0x04F0)
class UW_Vision_C final : public UUIVision
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NextIcon_Out;                                      // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NextIcon_In;                                       // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_Right;                                      // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_Center;                                     // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_Left;                                       // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InOut_R;                                           // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InOut_L;                                           // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Back;                                              // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MultiBase_NextIcon_C*                NextIcon_L;                                        // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MultiBase_NextIcon_C*                NextIcon_R;                                        // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Picture;                                           // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Under_Button_C*                      W_Under_Button;                                    // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Vision_Name_C*                       W_Vision_Name;                                     // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Vision_Select_C*                     W_Vision_Select;                                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTW_Vision_1();
	void SequenceEvent__ENTRYPOINTW_Vision_0();
	void LeftMove();
	void RightMove();
	void ExecuteUbergraph_W_Vision(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Vision_C">();
	}
	static class UW_Vision_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Vision_C>();
	}
};
static_assert(alignof(UW_Vision_C) == 0x000008, "Wrong alignment on UW_Vision_C");
static_assert(sizeof(UW_Vision_C) == 0x000578, "Wrong size on UW_Vision_C");
static_assert(offsetof(UW_Vision_C, UberGraphFrame) == 0x0004F0, "Member 'UW_Vision_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, NextIcon_Out) == 0x0004F8, "Member 'UW_Vision_C::NextIcon_Out' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, NextIcon_In) == 0x000500, "Member 'UW_Vision_C::NextIcon_In' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, Select_Right) == 0x000508, "Member 'UW_Vision_C::Select_Right' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, Select_Center) == 0x000510, "Member 'UW_Vision_C::Select_Center' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, Select_Left) == 0x000518, "Member 'UW_Vision_C::Select_Left' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, Out) == 0x000520, "Member 'UW_Vision_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, In) == 0x000528, "Member 'UW_Vision_C::In' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, InOut_R) == 0x000530, "Member 'UW_Vision_C::InOut_R' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, InOut_L) == 0x000538, "Member 'UW_Vision_C::InOut_L' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, Back) == 0x000540, "Member 'UW_Vision_C::Back' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, NextIcon_L) == 0x000548, "Member 'UW_Vision_C::NextIcon_L' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, NextIcon_R) == 0x000550, "Member 'UW_Vision_C::NextIcon_R' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, Picture) == 0x000558, "Member 'UW_Vision_C::Picture' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, W_Under_Button) == 0x000560, "Member 'UW_Vision_C::W_Under_Button' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, W_Vision_Name) == 0x000568, "Member 'UW_Vision_C::W_Vision_Name' has a wrong offset!");
static_assert(offsetof(UW_Vision_C, W_Vision_Select) == 0x000570, "Member 'UW_Vision_C::W_Vision_Select' has a wrong offset!");

}

