#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Vision_Field

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Vision_Field.W_Vision_Field_C
// 0x0070 (0x0570 - 0x0500)
class UW_Vision_Field_C final : public UUIVision_Field
{
public:
	class UWidgetAnimation*                       Panel_On;                                          // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Panel_Off;                                         // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Choice_03_Out;                                     // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Choice_02_Out;                                     // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Choice_01_Out;                                     // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Choice_03_In;                                      // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Choice_02_In;                                      // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Choice_01_In;                                      // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Picture;                                           // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Vision_FieldIconChoice_C*            W_Vision_FieldIconChoice_1;                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Vision_FieldIconChoice_C*            W_Vision_FieldIconChoice_2;                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Vision_FieldIconChoice_C*            W_Vision_FieldIconChoice_3;                        // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_Vision_Field_C">();
	}
	static class UW_Vision_Field_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Vision_Field_C>();
	}
};
static_assert(alignof(UW_Vision_Field_C) == 0x000008, "Wrong alignment on UW_Vision_Field_C");
static_assert(sizeof(UW_Vision_Field_C) == 0x000570, "Wrong size on UW_Vision_Field_C");
static_assert(offsetof(UW_Vision_Field_C, Panel_On) == 0x000500, "Member 'UW_Vision_Field_C::Panel_On' has a wrong offset!");
static_assert(offsetof(UW_Vision_Field_C, Panel_Off) == 0x000508, "Member 'UW_Vision_Field_C::Panel_Off' has a wrong offset!");
static_assert(offsetof(UW_Vision_Field_C, Choice_03_Out) == 0x000510, "Member 'UW_Vision_Field_C::Choice_03_Out' has a wrong offset!");
static_assert(offsetof(UW_Vision_Field_C, Choice_02_Out) == 0x000518, "Member 'UW_Vision_Field_C::Choice_02_Out' has a wrong offset!");
static_assert(offsetof(UW_Vision_Field_C, Choice_01_Out) == 0x000520, "Member 'UW_Vision_Field_C::Choice_01_Out' has a wrong offset!");
static_assert(offsetof(UW_Vision_Field_C, Out) == 0x000528, "Member 'UW_Vision_Field_C::Out' has a wrong offset!");
static_assert(offsetof(UW_Vision_Field_C, In) == 0x000530, "Member 'UW_Vision_Field_C::In' has a wrong offset!");
static_assert(offsetof(UW_Vision_Field_C, Choice_03_In) == 0x000538, "Member 'UW_Vision_Field_C::Choice_03_In' has a wrong offset!");
static_assert(offsetof(UW_Vision_Field_C, Choice_02_In) == 0x000540, "Member 'UW_Vision_Field_C::Choice_02_In' has a wrong offset!");
static_assert(offsetof(UW_Vision_Field_C, Choice_01_In) == 0x000548, "Member 'UW_Vision_Field_C::Choice_01_In' has a wrong offset!");
static_assert(offsetof(UW_Vision_Field_C, Picture) == 0x000550, "Member 'UW_Vision_Field_C::Picture' has a wrong offset!");
static_assert(offsetof(UW_Vision_Field_C, W_Vision_FieldIconChoice_1) == 0x000558, "Member 'UW_Vision_Field_C::W_Vision_FieldIconChoice_1' has a wrong offset!");
static_assert(offsetof(UW_Vision_Field_C, W_Vision_FieldIconChoice_2) == 0x000560, "Member 'UW_Vision_Field_C::W_Vision_FieldIconChoice_2' has a wrong offset!");
static_assert(offsetof(UW_Vision_Field_C, W_Vision_FieldIconChoice_3) == 0x000568, "Member 'UW_Vision_Field_C::W_Vision_FieldIconChoice_3' has a wrong offset!");

}

