#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WhiteOut

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WhiteOut.W_WhiteOut_C
// 0x0018 (0x04C8 - 0x04B0)
class UW_WhiteOut_C final : public UUIWhiteOut
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 WhiteBase;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_WhiteOut_C">();
	}
	static class UW_WhiteOut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_WhiteOut_C>();
	}
};
static_assert(alignof(UW_WhiteOut_C) == 0x000008, "Wrong alignment on UW_WhiteOut_C");
static_assert(sizeof(UW_WhiteOut_C) == 0x0004C8, "Wrong size on UW_WhiteOut_C");
static_assert(offsetof(UW_WhiteOut_C, Out) == 0x0004B0, "Member 'UW_WhiteOut_C::Out' has a wrong offset!");
static_assert(offsetof(UW_WhiteOut_C, In) == 0x0004B8, "Member 'UW_WhiteOut_C::In' has a wrong offset!");
static_assert(offsetof(UW_WhiteOut_C, WhiteBase) == 0x0004C0, "Member 'UW_WhiteOut_C::WhiteBase' has a wrong offset!");

}

