#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WinMenu_S_03

#include "Basic.hpp"

#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WinMenu_S_03.W_WinMenu_S_03_C
// 0x0020 (0x04B8 - 0x0498)
class UW_WinMenu_S_03_C final : public UUIWinMenu_S_03
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_BG_Black_C*                          W_BG_Black;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window;                                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_WinMenu_S_03_C">();
	}
	static class UW_WinMenu_S_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_WinMenu_S_03_C>();
	}
};
static_assert(alignof(UW_WinMenu_S_03_C) == 0x000008, "Wrong alignment on UW_WinMenu_S_03_C");
static_assert(sizeof(UW_WinMenu_S_03_C) == 0x0004B8, "Wrong size on UW_WinMenu_S_03_C");
static_assert(offsetof(UW_WinMenu_S_03_C, Out) == 0x000498, "Member 'UW_WinMenu_S_03_C::Out' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_03_C, In) == 0x0004A0, "Member 'UW_WinMenu_S_03_C::In' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_03_C, W_BG_Black) == 0x0004A8, "Member 'UW_WinMenu_S_03_C::W_BG_Black' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_03_C, Window) == 0x0004B0, "Member 'UW_WinMenu_S_03_C::Window' has a wrong offset!");

}

