#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WinMenu_S_04

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WinMenu_S_04.W_WinMenu_S_04_C
// 0x0040 (0x0638 - 0x05F8)
class UW_WinMenu_S_04_C final : public UUIWinMenu_S_04
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_BG_Black_C*                          W_BG_Black;                                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_IconChoice_C*                        W_IconChoice;                                      // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_WinBase_S_C*                    W_Menu_WinBase_S;                                  // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Network_SignalIcon_C*                W_Network_SignalIcon;                              // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_W_WinMenu_S_04(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_WinMenu_S_04_C">();
	}
	static class UW_WinMenu_S_04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_WinMenu_S_04_C>();
	}
};
static_assert(alignof(UW_WinMenu_S_04_C) == 0x000008, "Wrong alignment on UW_WinMenu_S_04_C");
static_assert(sizeof(UW_WinMenu_S_04_C) == 0x000638, "Wrong size on UW_WinMenu_S_04_C");
static_assert(offsetof(UW_WinMenu_S_04_C, UberGraphFrame) == 0x0005F8, "Member 'UW_WinMenu_S_04_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_04_C, Out) == 0x000600, "Member 'UW_WinMenu_S_04_C::Out' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_04_C, In) == 0x000608, "Member 'UW_WinMenu_S_04_C::In' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_04_C, W_BG_Black) == 0x000610, "Member 'UW_WinMenu_S_04_C::W_BG_Black' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_04_C, W_IconChoice) == 0x000618, "Member 'UW_WinMenu_S_04_C::W_IconChoice' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_04_C, W_Menu_IconArrow) == 0x000620, "Member 'UW_WinMenu_S_04_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_04_C, W_Menu_WinBase_S) == 0x000628, "Member 'UW_WinMenu_S_04_C::W_Menu_WinBase_S' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_04_C, W_Network_SignalIcon) == 0x000630, "Member 'UW_WinMenu_S_04_C::W_Network_SignalIcon' has a wrong offset!");

}

