#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_WinMenu_S_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DarwinGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_WinMenu_S_02.W_WinMenu_S_02_C
// 0x0048 (0x0668 - 0x0620)
class UW_WinMenu_S_02_C final : public UUIWinMenu_S_02
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UW_BG_Black_C*                          W_BG_Black;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_IconChoice_C*                        W_IconChoice;                                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_IconChoice_C*                        W_IconChoice_1;                                    // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_IconChoice_C*                        W_IconChoice_2;                                    // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Menu_IconArrow_C*                    W_Menu_IconArrow;                                  // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Window;                                            // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_WinMenu_S_02(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_WinMenu_S_02_C">();
	}
	static class UW_WinMenu_S_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_WinMenu_S_02_C>();
	}
};
static_assert(alignof(UW_WinMenu_S_02_C) == 0x000008, "Wrong alignment on UW_WinMenu_S_02_C");
static_assert(sizeof(UW_WinMenu_S_02_C) == 0x000668, "Wrong size on UW_WinMenu_S_02_C");
static_assert(offsetof(UW_WinMenu_S_02_C, UberGraphFrame) == 0x000620, "Member 'UW_WinMenu_S_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_02_C, Out) == 0x000628, "Member 'UW_WinMenu_S_02_C::Out' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_02_C, In) == 0x000630, "Member 'UW_WinMenu_S_02_C::In' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_02_C, W_BG_Black) == 0x000638, "Member 'UW_WinMenu_S_02_C::W_BG_Black' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_02_C, W_IconChoice) == 0x000640, "Member 'UW_WinMenu_S_02_C::W_IconChoice' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_02_C, W_IconChoice_1) == 0x000648, "Member 'UW_WinMenu_S_02_C::W_IconChoice_1' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_02_C, W_IconChoice_2) == 0x000650, "Member 'UW_WinMenu_S_02_C::W_IconChoice_2' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_02_C, W_Menu_IconArrow) == 0x000658, "Member 'UW_WinMenu_S_02_C::W_Menu_IconArrow' has a wrong offset!");
static_assert(offsetof(UW_WinMenu_S_02_C, Window) == 0x000660, "Member 'UW_WinMenu_S_02_C::Window' has a wrong offset!");

}

